{
  "department": {
    "name": "BIO",
    "courses": [
      {
        "sem": 3,
        "code": "MAT 2122",
        "title": "ENGINEERING MATHEMATICS – III",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Linear Algebra: Systems of Linear Equations, Matrices, Solving Systems of Linear Equations, Vector Spaces, Linear Independence, Basis and Rank, Linear Mappings, Affine Spaces",
          "Analytic Geometry: Norms, Inner Products, Lengths and Distances, Angles and Orthogonality, Orthonormal Basis, Orthogonal Complement, Inner Product of Functions, Orthogonal Projections, Rotations",
          "Matrix Decompositions: Determinant and Trace, Eigenvalues and Eigenvectors, Cholesky Decomposition, Eigen decomposition and Diagonalization, Singular Value Decomposition, Matrix Approximation",
          "Fourier Series and Transforms: Periodic function, Fourier Series expansion, even and odd functions, functions with arbitrary periods, Half range expansions, Fourier transform, basic properties, Parseval's identity and applications"
        ],
        "references": [
          "Marc Peter Deisenroth, A. Aldo Faisal, Cheng Soon Ong, Mathematics for Machine Learning, Cambridge University Press, 2020.",
          "Grewal B.S. - Higher Engineering Mathematics, Khanna Publishers, 43rd edition, 2015",
          "Stephen H. Friedberg Lawrence E Spence, Arnold J Insel, Elementary Linear Algebra: A Matrix Approach Introduction to Linear Algebra, Second Edition, 2019.",
          "David Lay, Steven Lay, Judi McDonald, Linear Algebra and Its Applications, Pearson, 2019.",
          "Gilbert Strang, Introduction to Linear Algebra, Fifth Edition (2016), Wellesley-Cambridge Press.",
          "Mordechai Ben-Ari, Mathematical Logic for Computer Science, Third Edition, Springer.",
          "Narayanan, Ramaniah and Manicavachagom Pillay, Advanced Engineering Mathematics, Vol 2 and 3, Vishwanthan Publishers Pvt Ltd. 1998",
          "Erwin Kreyszig, Advanced Engineering Mathematics, 5th Edition., Wiley Eastern, 1985"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2121",
        "title": "ANATOMY AND PHYSIOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Skeletal System: Types of bone, classification, Structure of bone, Blood supply",
          "Cartilage: Type, Structure in brief",
          "Joints: Classification, Structure of synovial joint, Major joints of the body",
          "Muscle tissue: Types, Structure of skeletal muscle, Types of muscles",
          "Brain: Parts, Brain stem, Ventricles, CSF, Meninges, Cranial nerves (names and functions only)",
          "Spinal cord: Gross features and structures, Spinal nerve, Nerve endings and receptors, Autonomic nervous system",
          "Sensory system: Eye, Ear, Skin",
          "Heart: Pericardium, Chambers, Blood supply Organs",
          "Respiratory system: Parts, Trachea, Lungs",
          "G I Tract: Parts, Stomach, Intestine, Liver, and Pancreas",
          "Urinary system",
          "Male and Female reproductive organs",
          "Endocrine glands",
          "Basic concepts: Body fluid compartments",
          "Nerve-Muscle physiology: Physiology of neuron, Membrane potential, Autonomic nervous system",
          "Skeletal Muscle: Structure, Neuromuscular transmission, Excitation contraction coupling, Electromyogram [EMG]",
          "Blood: Components and functions, Hemostasis, Blood groups",
          "Cardiovascular system: Functional anatomy, Origin of heart beat, Electrocardiogram (ECG), Heart sounds, Biophysical aspects of circulation, Cardiac output, Blood pressure",
          "Respiratory system: Functional anatomy, Mechanics of respiration, Lung volumes and capacities, Gas exchange, Regulation of respiration",
          "Excretory system: Functions of kidneys, Urine formation, Micturition, Thermoregulation",
          "Central nervous system: General organization of nervous system, Synaptic transmission, Sensory receptors, Sensory pathways, Motor system, Electroencephalogram (EEG) and sleep",
          "Special senses: Optics of eye, pitch and intensity discrimination of sound"
        ],
        "references": [
          "Sampath Madhyastha, Manipal Manual of Anatomy, CBS Publishers & Distributors, Edition 3, 2016",
          "Basics of Medical Physiology, 4th edition, D. Venkatesh, H.H.Sudhakar",
          "Manipal Manual of Medical Physiology, 1st edition, C. N. Chandra Shekar"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2122",
        "title": "ELECTRONIC CIRCUITS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Field Effect transistors: JFET and MOSFETs, biasing of field effect transistors, JFET and MOSFET small signal amplifiers, and oscillators",
          "Operational amplifiers: characteristics, differential amplifiers, offset voltages and currents, linear applications of Op-Amps, Instrumentation amplifier, active filters, integrators and differentiators",
          "Non-linear applications of Op-Amps: Multivibrators, Schmitt trigger and function generators",
          "The Timer IC 555 and its applications: Multivibrators, voltage to frequency converters, tone burst generators",
          "IC voltage regulators: Fixed, adjustable and variable power supplies, switching regulators",
          "Data converters: Analog-to-Digital Converters (ADC) and Digital-to-Analog Converters (DAC)"
        ],
        "references": [
          "R. L Boylestad, L. Nashelsky, “Electronic Devices and Circuit Theory”, 11th Edition, Pearson India Education Services, 2015",
          "Ramakanth A Gayakwad, “Op Amps and Linear Integrated Circuits”, Prentice Hall, Edition 4, 2000",
          "Jacob Millman, Christos C Halkias and Chetan D Parikh, “Integrated Electronics”, 2nd Edition, McGraw Hill, 2009",
          "Sergio F, “Design with Op Amps and Analog Integrated Circuits”, McGraw Hill, 2002",
          "William D. Stanley, “Operational Amplifiers with Linear Integrated Circuits”, 4th Edition, Pearson Education, 2007"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2123",
        "title": "DIGITAL SYSTEM DESIGN",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Combinational logic circuits: Overview of Algebraic simplification of Boolean expressions and realization using logic gates, minimization using Karnaugh map, Combinational circuit design using MSI chips: Multiplexers, demultiplexers, encoders, decoders, Arithmetic circuits: Half adder, full adder, adder-subtractor, ripple carry and carry look ahead adders, ALU",
          "Sequential logic circuits: Overview of flipflops; Counters and Shift registers",
          "Logic families and their characteristics: TTL families, CMOS families, CMOS logic; Introduction to CMOS, CMOS gates and circuits. CMOS based combinational logic cells, Transmission Gates, Sequential Logic Cells, Data path logic cells, Data path elements, Examples (Adders/ multiplication)",
          "Combinational Circuits Design, Shannon's expansion theorem, design of Sequential circuit",
          "CAD tool based digital system design, Design flow, Design styles: Full-custom IC, Semi-custom IC, ASIC (Application Specific Integrated Circuit), Types of ASICs, Programmable ASICs and logic cells, Programmable Logic Devices (PLD's) and applications, Programmable Array Logic, Complex Programmable Logic Devices (CPLD's), elements of CPLD, Example, Mask-programmable Gate Array (MPGA's), FPGA's architectures, Example, and applications"
        ],
        "references": [
          "Roth C. H., Fundamentals of logic design, Thomson Brooks, Australia, Edition 5, 2007",
          "Morris Mano, Digital logic and computer design, Pearson, New Delhi, 2013",
          "Stephen Brown, Zvonko Vranesic, “Fundamentals of Digital Logic with Verilog Design”, 3rd Edition, McGraw Hill Education (India) Pvt. Ltd., New Delhi, 2014",
          "Charles Roth, Lizy Kurian John, ByeongKil Lee, “Digital System Design Using Verilog”, Cengage Learning US, 2016",
          "M.J.S. Smith, “Application Specific Integrated Circuits”, Pearson, New Delhi, 2002",
          "J. Bhaskar “Verilog Primer”, 3rd Edition, Addison Wesley Longman Singapore Pvt Ltd., 2005",
          "M. Morris Mano and Michael D. Cilleti, “Digital Design with Introduction to Verilog HDL\", 5th Edition, Pearson, New Delhi, 2013"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2124",
        "title": "NETWORK ANALYSIS",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Network equations: (Basic concepts of Network), Coupled circuits",
          "Resonant circuits, Property of duality in networks",
          "Network Theorems: Superposition, Reciprocity, Millman's theorems, Thevinin's and Norton's theorems, Maximum Power transfer theorem",
          "Laplace transformation and its application: Definition, Basic theorems in Laplace transformation, properties of Laplace transforms, inverse Laplace transforms, partial fraction expansion, initial and final value theorems, Shifting theorems, step, ramp and delayed functions",
          "Solution of RL, RC, RLC networks using Laplace transformation method, Laplace transform of periodic and non-periodic signal",
          "Transient behaviour and Initial conditions in networks: Behaviour of circuit elements under switching condition and their representation. Evaluation of initial and final conditions in RL, RC and RLC circuits for AC and DC excitations",
          "Frequency response of the elements",
          "Linear wave shaping: Response of RC & RL circuits to step, pulse, square wave, ramp and exponential inputs, compensated attenuators",
          "Two port network and network functions: Open circuit impedance parameters, short circuit admittance parameters, Transmission parameters, Hybrid parameters, relationship between two port parameters, Parallel connection of two port networks, series connection of two port networks, cascade connection of two port networks"
        ],
        "references": [
          "M E Van Valkenburg, “Network Analysis”, Prentice Hall of India, New Delhi, Edition 3, 2007",
          "Joseph A Edminister, “Theory and Problems of Electric circuits”, McGraw Hill, Edition 5, 2001",
          "C.L. Wadhwa, “Network Analysis and Synthesis”, New Age International (P)Limited, Publishers, New Delhi, Edition 3, 2007",
          "Jacob Millman and Herbert Taub, “Pulse, Digital and Switching Waveforms” Mcgraw-Hill Book Company, New Delhi, 1992",
          "Engineering Circuit Analysis | 8th Edition by William H. Hayt, Jack Kemmerly, Steven M. Durbin"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2125",
        "title": "SIGNALS AND SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to signals",
          "Representations of continuous and discrete-time signals",
          "Some special signals",
          "Introduction to systems, system properties",
          "Continuous time and discrete time Linear shift-invariant (LSI) systems",
          "Frequency analysis of signals and systems",
          "Fourier series representation",
          "The Fourier Transform",
          "The Discrete-Time Fourier Transform (DTFT) and the Discrete Fourier Transform (DFT)",
          "The Laplace Transform for continuous time signals and systems",
          "The z-Transform for discrete time signals and systems",
          "Sampling Theorem and its implications",
          "Spectrum of sampled signals",
          "Reconstruction: ideal interpolator, zero-order hold, first-order hold, and so on",
          "Aliasing and its effects",
          "Relation between continuous and discrete time systems"
        ],
        "references": [
          "A.V. Oppenheim, A.S. Willsky and I.T. Young, \"Signals and Systems\", Pearson Education India, 2nd Edition, 2015.",
          "Simon Haykin and Van Veen, “Signals and Systems”, John Wiley, 2014.",
          "Hwei Hsu, Schaum's Outline of Signals and Systems, McGraw-Hill Education, 3rd edition, 2013.",
          "M. J. Roberts, Signals and Systems - Analysis using Transform methods and MATLAB, McGraw-Hill Education, 2nd Edition, 2011."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2141",
        "title": "BASIC PROGRAMMING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["core", "lab"],
        "syllabus": [
          "Programming in Python",
          "Variables, expressions and statements",
          "Conditional execution and iterations",
          "creating functions and File handling",
          "Plots in Python - Different types of plots",
          "subplots and data visualization with Python",
          "Linear algebra - Vectors",
          "Matrices, basic matrix operations",
          "Solving linear equations",
          "example scripts and exercises"
        ],
        "references": [
          "Hans-Petter Halvorsen. Python for science and engineering. Hans-Petter Halvorsen – a Blog about Technology, 2019, https://www.halvorsen.blog/",
          "Sinan Kalkan, Onur Tolga Sehitoglu, and Gokturk Ucoluk. Programming with Python for Engineers. 2021, https://ceng240.github.io/"
        ],
        "flags": ["c_credits_less_than_p"]
      },
      {
        "sem": 4,
        "code": "BME 2142",
        "title": "ELECTRONIC CIRCUITS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 6,
          "c": 2
        },
        "tags": ["core", "lab"],
        "syllabus": [
          "Analog electronics: To conduct experiments related to the characteristics of FET and MOSFETs. FET amplifiers",
          "Oscillators – RC Phase shift, Wein Bridge, Hartley and Colpitts Oscillators",
          "Digital Electronics: Combinational circuits- Arithmetic Circuits, Multiplexers, Decoder, comparator",
          "Sequential circuits- Counters, Shift Registers, PLDs",
          "Integrated Circuits: Op-amp linear applications – Adder, Subtractor, Integrator, Differentiator, and voltage – to – current converter",
          "Op-amp Non-linear applications – Comparators, square wave generator, multi-vibrators, function generators, oscillators, precision rectifiers",
          "Binary weighted and ladder type DACs",
          "IC voltage regulators, and Timer IC applications"
        ],
        "references": [
          "R.L Boylestad, L. Nashelsky, “Electronic Devices and Circuit Theory”, 11th Edition, Pearson India Education Services, 2015",
          "Jacob Millman, Christos C Halkias and Chetan D Parikh, “Integrated Electronics”, 2nd Edition, McGraw Hill, 2009",
          "C. H. Roth, “Fundamentals of Logic Design”, 7th Edition, CL Publication, 2015",
          "Morris Mano, “Digital Logic and Computer Design”, Pearson education, 2016",
          "Ramakanth A Gayakwad, “Op Amps and Linear Integrated Circuits”, Prentice Hall, Edition 4, 2000"
        ],
        "flags": ["semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "MAT 2223",
        "title": "ENGINEERING MATHEMATICS – IV",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Probability and Distributions: Construction of a Probability Space, Discrete and Continuous Probabilities, Sum Rule, Product Rule, and Bayes' Theorem, Summary Statistics and Independence, Distributions: Binomial, Poisson, uniform, normal, Chi-square and exponential distributions",
          "Multivariate Random variables and Stochastic Process: Two and higher dimensional random variables, covariance, correlation coefficient, Moment generating function, functions of one dimensional and two-dimensional random variables",
          "Static probabilities: review and prerequisites generating functions, difference equations",
          "Dynamic probability: definition and description with examples, Markov chains, transition probabilities",
          "Vector Calculus: Differentiation of Univariate Functions, Partial Differentiation and Gradients, Gradients of Vector-Valued Functions, Gradients of Matrices, Useful Identities for Computing Gradients, Backpropagation and Automatic Differentiation, Higher-Order Derivatives, Linearization and Multivariate Taylor Series",
          "Optimization: Basic solution, Convex sets and function, Simplex Method, Optimization Using Gradient Descent, Constrained Optimization and Lagrange Multipliers"
        ],
        "references": [
          "Marc Peter Deisenroth, A. Aldo Faisal, Cheng Soon Ong, Mathematics for Machine Learning, Cambridge University Press, 2020",
          "P L Meyer, Introductory Probability and Statistical Applications, Addison Wiley",
          "Medhi. J. Stochastic Processes, Wiley Eastern",
          "Murray R. Spiegel, Vector Analysis Theory and Problems, Schaum's Outline Series, 2019",
          "Hamdy A. Taha, “Operations Research: An Introduction”, 8th Edn., Pearson Education (2008)",
          "Sheldon M. Ross, Introduction to Probability Models Eleventh Edition Elsevier",
          "E. S. Page, L. B. Wilson, An Introduction to Computational Combinatorics, Cambridge University Press",
          "Bhat U R, Elements of Applied Stochastic Processes, John Wiley"
        ],
        "flags": ["semester_mismatch_possible"]
      },
      {
        "sem": 3,
        "code": "BME 2221",
        "title": "BASIC CLINICAL SCIENCES I",
        "credits": {
          "l": 4,
          "t": 0,
          "p": 0,
          "c": 4
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "CARDIOLOGY: Heart structure and function – overview, Details of cardiovascular physiology – blood flow (circulation), Detail anatomy of human heart, principles of cardiovascular measurements-blood pressure, cardiac output, etc. Heart valves, Prosthetic heart valves – evolution, detail structure, functions and applications, Open heart surgery and Heart lung machines, Basics of 12-lead Electrocardiography – Einthoven's triangle, ECG potentials – generation and conduction, conduction system, Applications of ECG in cardiac clinics, Normal and abnormal ECGs, Diagnostic applications, Interpretation of ECG, Cardiac pacing. Assisted cardiac devices-concepts and applications from biomedical engineering perspective, Holter monitor. Cardiac Interventional hardware (Guide wires,catheters,stents)",
          "ANAESTHESIOLOGY: Overview of basic physical principles and applications in anaesthesia and intensive care, general and regional anaesthetic techniques, anaesthesia machine, medical gas supply systems, intravenous drug delivery systems, principles of equipment used in pain therapy, mechanical ventilation, humidifiers, Baby Incubators, Central oxygen supply, Principles of operation theatre tables and lights, phototherapy, surgical diathermy",
          "SPEECH & HEARING: Introductory Lectures on Anatomy of the vocal tract and the ear; Audiometers, Middle ear analyzer, Evoked potentials, OAE, Hearing aids, Cochlear implants, ALD, Hearing aid analyzer, Electro Glottography, AAC, Introduction to speech assessment, DSP, Assessment of voice and fluency, Voice and fluency therapy assessment, Artificial larynx, Spirometry, Speech synthesis, Practical demonstration",
          "ORTHOPAEDICS: Bioengineering aspects of fracture management, Structure of bone-gross, Microscopic biochemical fractures, Types, Mechanism of injury, Normal Healing of Fractures, Treatment of fractures, Biomechanics of internal fixation, Bioengineering principles of internal fixation, Intramedullary nails, Plates, and Screws, concepts of load bearing, load sharing and stress shielding by implants, Piezo electricity and electrical stimulation for bone healing, Bioengineering aspects of joint diseases, Structure of joints, Lubrication of joints, Degeneration of cartilage, Degenerative arthritis and Rheumatoid arthritis, Joint replacement, Biomaterials, Bioengineering principles of management of paralytic problems, Gait analysis, Orthotics, Principles of tendon transfer, Bioengineering principles of amputation and prosthetics, Upper limb prosthesis, Lower limb prosthesis"
        ],
        "references": [
          "Kim E. Barrett, “Ganong's Review of Medical Physiology”, McGraw Hill, Edition 24, 2012",
          "C. C. Chatterjee S, “Human Physiology”, CBS Publisher, Edition 11, 2016",
          "Leo Schamroth Text book of electrophysiology",
          "William Grossman-Interventional cardiology",
          "M.K. Bykes and M.D. Vickers, “Measurements in Anesthesia”, Blackwell, 1981",
          "Mushin, “Automatic ventilation of lung”, Blackwell, 1970",
          "Saunders, “Community based Rehabilitation”, ISBN 0-7020-1941-0. London, 1997",
          "Victor H Frankel and Margareta Nordin, “Basic Biomechanics of the skeletal system”. Lea and Febiger, 1980",
          "M. Dena Gardiner, “The principles of exercise therapy”, CBS press, Edition 4, 1985"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2222",
        "title": "BIOMEDICAL INSTRUMENTATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Biomedical transducers: Classification and Selection",
          "Pressure Transducers: Resistive, capacitive, Inductive & Piezo-electric transducers, Photoelectric transducers & its types; Thermal transducers & its types",
          "Electrodes & Amplifiers: Principles of working and their characteristics, Half-cell potential, Types of electrodes, Electrode-Electrolyte model",
          "Physiological Signals & Measurements: Basics of ECG, EMG, EEG, PCG, blood pressure & blood flow and the instrumentation for measuring these signals",
          "Cardiac Pacemakers: Types of pacemakers, Modes of triggering, Pacemaker power supplies, pacemaker codes",
          "Defibrillators: AC and DC defibrillators, Types of electrodes and their features, cardioverters",
          "Lasers: Basic principles, types of lasers and their medical applications",
          "X-ray systems, Fluoroscopic system, principles of tomography",
          "Electrical Hazards & Safety: Safety code standards, Micro and Macro shock and its physiological effects, Methods of electrical safety"
        ],
        "references": [
          "Webster JG, Eren H, “Measurement, Instrumentation, and Sensors Handbook” CRC press; Edition 2, 2018.",
          "John G Webster, “Medical Instrumentation Applications and Design”, John Wiley and Sons, New York, Edition 5, 2020.",
          "R S Khandpur, “Handbook of Biomedical Instrumentation”, McGraw Hill, Delhi, Edition 3, 2014.",
          "L A Geddes, L E Baker, “Principles of Applied Medical Instrumentation”, Wiley India, New Delhi, Edition 3, 2008.",
          "Richard Aston, “Principles of biomedical Instrumentation and measurement”, Merrill, New York, 1991.",
          "Joseph J Carr, John M Brown, “Introduction to Biomedical Equipment technology”, Prentice Hall, New Jersey, Edition 4, 2003."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2223",
        "title": "BIOMECHANICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Bio-fluid mechanics: Viscosity, classification of fluids, blood rheology, fundamental method for measuring viscosity, rheology of blood in micro-vessels, mechanical model of cardiovascular system, relationship among blood velocity, blood pressure and blood vessel diameter in the vascular tree, resistance against blood flow, types of blood flow, prosthesis-related complications attributable to valve fluid dynamics",
          "Mechanics of breathing, physical aspects of alveoli, diffusion, airway resistance",
          "Connective tissue mechanics: structure and biomechanical properties of collagen, tendon, ligament & cartilage; composition, structure and biomechanical properties of bone, bone fracture and failure mechanics, skeletal muscle tissue properties and functions, skeletal muscle architecture, force generation in the muscle, role of skeletal muscle, force-velocity relationship in skeletal muscle, joint flexibility",
          "Human movement mechanics: linear kinematics- kinematic parameters, fundamental concepts of gait, projectile motion, linear kinematics of walking & running, angular kinematics- types of angles, lower extremity joint angles, angular motion relationships, relationship between linear and angular motion, angle-angle diagrams, linear kinetics- laws of motion, types of forces, representation of forces acting on a system, angular kinetics- Newton's laws of motion (angular analogs), center of mass calculation, Rotation and Leverage, Pulley systems, Analysis using Newton's laws of motion"
        ],
        "references": [
          "Lee Waite and Jerry Fine, Applied Biofluid Mechanics, McGraw-Hill Education, Second Edition, 2017, USA",
          "C. Ross Ethier, Craig A. Simmons, Introductory Biomechanics, Cambridge University Press, First Edition, 2009, New York, USA",
          "W. Mark Saltzman, Biomedical Engineering: Bridging Medicine and Technology, Cambridge University Press, Second Edition, 2015, USA",
          "Joseph Hamill and Kathleen M. Knutzen, Biomechanical Basis of Human Movement, Lippincott Williams & Wilkins, Third Edition, 2008, Philadelphia, USA",
          "Susan J. Hall, Basic Biomechanics, McGraw-Hill International Editions, Seventh Edition, 2014, Singapore"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2224",
        "title": "MICROCONTROLLERS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to the Microprocessor and microcontrollers",
          "Microcontroller architectures. CISC Microcontroller- The Intel 8051 Microcontroller: Hardware architecture and software architecture, Programming",
          "RISC Microcontroller – The ARM Cortex-M3 Microcontroller: Hardware architecture and software architecture, Programming",
          "Interfacing: External memory, UART, Keyboard, Display, ADC and DAC interfaces, temperature monitoring system, Stepper motor interface, and Real-Time-Clock (RTC) interface"
        ],
        "references": [
          "Kenneth J. Ayala, “8051 Microcontrolelr and Embedded System Using Assembly and C”, 2nd Edition, Cengage Learning, New delhi, 2009",
          "Muhammad Ali Mazidi, Janice Gillispie Mazidi, “8051 Microcontroller and Embedded System Using Assembly and C”, 2nd Edition, Pearson Education, New Delhi, 2013",
          "Joseph Yiu, “The definitive Guide to the ARM Cortex-M3”, 2nd Edition, Elsevier, 2010",
          "Steve Furber, “ARM System-On-Chip Architecture”, 2nd Edition, Pearson Education, New Delhi, 2012"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2225",
        "title": "DIGITAL SIGNAL PROCESSING",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Discrete time signal and systems",
          "Z Transform: Definition and properties",
          "region of convergence",
          "inverse Z transform",
          "transfer function",
          "poles and zeros",
          "application of Z transforms to discrete-time systems",
          "representation of systems – signal flow graph",
          "realization of a z-domain transfer function",
          "relation between s-plane and z-plane",
          "Discrete Fourier Transform: properties",
          "linear convolution using the DFT"
        ],
        "references": [
          "Ronald W. Schafer, Alan V. Oppenheim, Discrete-Time Signal Processing, PEARSON 3rd Edition, 2014",
          "Dimitris G Manolakis, John G. Proakis, Digital Signal Processing: Principles, Algorithms, and Applications, PEARSON, 4th Edition, 2007",
          "Sanjit K. Mitra, Digital Signal Processing: A Computer - Based Approach, McGraw Hill Education; 4th Edition, 2013"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 2241",
        "title": "SIGNAL PROCESSING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["lab"],
        "syllabus": [
          "Signal Processing in MATLAB",
          "Introduction",
          "Convolution",
          "Discrete Fourier Transform and its properties",
          "Simple filter design",
          "FIR and IIR filters - design and implementation",
          "Periodogram",
          "Waveform analysis",
          "event detection in biomedical signals"
        ],
        "references": [
          "Houcque, David. \"Introduction to Matlab for engineering students.\" Northwestern University 1 2005.",
          "Mohindru, P., & Mohindru, P., MATLAB and SIMULINK (A Basic Understanding for Engineers). Cambridge Scholars Publishing, 2020."
        ],
        "flags": []
      },
      {
        "sem": 5,
        "code": "BME 2242",
        "title": "MICROCONTROLLERS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["lab", "core"],
        "syllabus": [
          "Familiarization of the 8051 microcontroller Simulation tool and trainer kits, and experiments based on the 8051 microcontrollers",
          "Familiarization of ARM programming tools and ARM kits and experiments based on ARM Cortex-M3 Microcontroller",
          "Interfacing experiments based on the 8051 and ARM Cortex-M3 microcontrollers"
        ],
        "references": [
          "Kenneth J. Ayala, “8051 Microcontroller and Embedded System Using Assembly and C”, 2nd Edition, Cengage Learning, New Delhi, 2009",
          "Muhammad Ali Mazidi, Janice Gillispie Mazidi, “8051 Microcontroller and Embedded System Using Assembly and C”, 2nd Edition, Pearson Education, New Delhi, 2013",
          "Joseph Yiu, “The definitive Guide to the ARM Cortex-M3”, 2nd Edition, Elsevier, 2010"
        ],
        "flags": ["semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "HUM 3021",
        "title": "ENGG ECONOMICS AND FINANCIAL MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Nature and significance",
          "Micro & macro differences",
          "Law of demand and supply",
          "Elasticity & equilibrium of demand & supply",
          "Time value of money",
          "Interest factors for discrete compounding",
          "Nominal & effective interest rates",
          "Present and future worth of single",
          "Uniform gradient cash flow",
          "Bases for comparison of alternatives",
          "Present worth amount",
          "Capitalized equivalent amount",
          "Annual equivalent amount",
          "Future worth amount",
          "Capital recovery with return",
          "Rate of return method",
          "Incremental approach for economic analysis of alternatives",
          "Replacement analysis",
          "Break even analysis for single product and multi product firms",
          "Break even analysis for evaluation of investment alternatives",
          "Physical & functional depreciation",
          "Straight line depreciation",
          "Declining balance method of depreciation",
          "Sum-of-the-years digits method of depreciation",
          "Sinking fund and service output methods",
          "Introduction to balance sheet and profit & loss statement",
          "Ratio analysis - Financial ratios such as liquidity ratios, Leverage ratios, Turn over ratios, and profitability ratios"
        ],
        "references": [
          "Prasanna Chandra (2005), “Fundamentals of Financial Management”, Tata Mc-Graw Hill Companies, New Delhi",
          "James L Riggs, David D Bedworth and Sabah U Randhawa, (2004), “Engineering Economics”, Tata McGraw – Hill Publishing Company Ltd, New Delhi",
          "T. Ramachandran (2001), “Accounting and Financial Management”, Scitech Publications Pvt. Ltd. India",
          "Eugene F. B. & Joel F. H. (2009), “Fundamentals of Financial Management”, 12th ed., Cengage Learning Publisher",
          "M. Y. Khan & P. K. Jain (2008), “Financial Management”, 5th edition Tata McGraw Hill Publication, New Delhi",
          "Thuesen G.J (2005), “Engineering Economics” Prentice Hall of India, New Delhi",
          "Blank Leland T. Tarquin Anthony J. (2002), “Engineering Economy”, McGraw Hill, Delhi",
          "Chan S. Park, (2013), “Fundamentals of Engineering Economics”, 3rd edition, Pearson Publication"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3121",
        "title": "BASIC CLINICAL SCIENCES – II",
        "credits": {
          "l": 4,
          "t": 0,
          "p": 0,
          "c": 4
        },
        "tags": ["core", "theory"],
        "syllabus": ["RADIOTHERAPY", "RADIOLOGY", "NEUROLOGY", "OPHTHALMOLOGY"],
        "references": [
          "Meredith W J, Massey J B, Fundamental Physics of Radiology, John Wright, Edition 3, 1977.",
          "Johns H E, Cunningham John Robert, The Physics of Radiology, Charle C Thomas, Edition 4, 1983.",
          "Romesh Chandra, Introduction to Nuclear Medicine.",
          "Thomas S. Curry, James E. Dowdey, Rober t C. Murray, \"Christensen's Physics of Diagnostic Radiology\", Illustrated Edition, Lippincott Williams and Wilkins, 1990.",
          "Joseph Selman, The fundamentals of Imaging Physics and Radiobiology, 9th Edition, Charles C. Thomas, 2000.",
          "Penelope Allisy-Roberts, Jerry R Williams, \"Farr's Physics of Medical Imaging\", Illustrated Edition, Elsevier Health Sciences, 2007.",
          "Victor Maurice, Adams Raymond D, Principles of Neurology, McGraw Hill, Edition 5, 1993.",
          "Erodal, Neuroanatomy.",
          "Lance and Moleod, Physiological approach to Clinical Neurology",
          "Tandon, Radhika, Parson Diseases of the Eye, Elsevier, Edition 21, 2010.",
          "Duke Elder, System of Ophthalmology, Vol. VII, Mosby, St. Louis, 1965."
        ],
        "flags": ["structure_mismatch"]
      },
      {
        "sem": 3,
        "code": "BME 3122",
        "title": "MEDICAL DEVICES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Respiratory measurements and aids: Principle of Impedance",
          "Pneumography & Pneumotachograph; Ventilators, Impulse",
          "Oscillometry, Clinical Laboratory Instrumentation: Spectrophotometry,",
          "Auto analysers, Electrosurgical units: Principle of working, modes of operation, Risks and the safety measures associated with ESU.",
          "Ultrasonography: Interaction of ultrasound with tissues, scanning modules, echocardiograph, Endoscopes, Neonatal instrumentation: Incubators, Apnea monitors and neonatal ventilators (High frequency ventilators (HFO);",
          "Anaesthesia equipment, Lithotripsy, Heart-Lung Machine: Qualitative requirements, Functional details of the types of blood oxygenators,"
        ],
        "references": [
          "John G Webster, “Medical Instrumentation Applications and Design”, John Wiley and Sons, New York, 5th Edition, 2020.",
          "R S Khandpur, “Handbook of Biomedical Instrumentation”, McGraw Hill, Delhi, 3rd Edition, 2014.",
          "L A Geddes, L E Baker, “Principles of Applied Medical Instrumentation”, Wiley India, New Delhi, 3rd Edition, 2008.",
          "Joseph J. Carr, John M Brown, “Introduction to Biomedical Equipment Technology”, Prentice Hall, New Jersey, 4Th Edition, 2003.",
          "Richard Aston, “Principles of biomedical Instrumentation and measurement”, Merrill, New York, 1991."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3123",
        "title": "BIOMATERIALS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Bio-materials: definition of biomaterials, requirements and its uses, classification of biomaterials, performance of biomaterials",
          "Types of biomaterials: Metallic Biomaterials- introduction, types - Stainless steel, Co-Cr alloys, Ti alloys, dental metals and other metals, corrosion behavior. Ceramic Biomaterials: introduction, Classification - Non-absorbable or relatively bioinert bio ceramics, Biodegradable or Resorbable ceramics, Bioactive or surface reactive ceramics. Polymeric Biomaterials: introduction, polymerization and its types, basic structure, classification solid state properties, discussion on different class of synthetic non-degradable polymers Biodegradable Polymeric Biomaterials, Biologic Biomaterials: Tissue Derived Biomaterials; Composite Biomaterials: introduction, structure, types, properties and applications",
          "Implantable Medical devices: (a) Orthopaedics-joint replacement, bone defects, bone fracture, cartilage defects, (b) Cardiovascular system- arteries and veins, Heart valve prostheses- introduction, causes, mechanical and bioprosthetic heart valves, (c) eyes and ears-contact lenses, IOL, cochlear implant, (d) dentistry, maxillofacial and craniofacial – dental implants, craniofacial reconstruction, (e) general soft tissue repair",
          "Biomaterials for regenerative medicine-background, tissue engineering templates, types of template materials, fabrication route"
        ],
        "references": [
          "Joseph D Bronzino, “The Biomedical Engineering Handbook”, 3rd Edition, CRC press, USA, 2006",
          "Park Joon Bu, “Biomaterials Science and Engineering”, Plenum Press, University of Michigan, 1984",
          "Buddy D Ratner & Allen S Hoffman, “Biomaterials Science and Introduction to Materials in Medicine”, 3rd Edition, Academic Press, Canada, 2012",
          "David Williams, Essentials Biomaterials Science, Cambridge university press, 2013",
          "Lisa A Pruitt and A M Chakravartula, Mechanics of Biomaterials, Cambridge, 2011"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3141",
        "title": "BIOMATERIALS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["core", "lab"],
        "syllabus": [
          "Preparation of hydroxyapatite bio ceramic particles",
          "Characterization of hydroxyapatite particles by X-ray powder diffraction (XRD)",
          "Synthesis of ZnS nanoparticles by reverse micelle method",
          "Characterization of ZnS nanoparticles by UV Vis absorption spectroscopy",
          "Preparation of alginate micro beads and encapsulation and release study of food colour",
          "Characterization of Alginate beads by Fourier Transform Infrared Spectroscopy (FTIR)",
          "Thawing frozen cells and starting a new batch of culture",
          "Sub culturing of confluent cells: splitting, counting and seeding cells",
          "Freezing cells for long term storage in liquid nitrogen"
        ],
        "references": [
          "William D. Callister, Jr., David G. Rethwisch, Materials Science and Engineering: An Introduction, 9th Edition, Wiley, 2014",
          "Buddy D. Ratner, Allan S. Hoffman, Frederick J. Schoen and Jack E. Lemons, Biomaterial science- An introduction to Materials in medicine, 3rd edition, Academic press, 2012",
          "T. Pradeep, A Textbook of Nanoscience and Nanotechnology, McGraw Hill Education, 1st edition, 2017"
        ],
        "flags": []
      },
      {
        "sem": 6,
        "code": "BME 3142",
        "title": "BIOMEDICAL INSTRUMENTATION LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["lab"],
        "syllabus": [
          "Design and realize bioelectric amplifier, filters for biomedical applications, Pacemaker circuit",
          "Study the characteristics of thermal transducers- RTD, Thermocouple",
          "Optical sensors- LDR, Photodiode and Phototransistor",
          "Pressure transducers, Inductive and Capacitive transducers",
          "Bio-signal acquisition using Physiography",
          "Familiarization of Audiometer",
          "Defibrillator",
          "Recording of ECG using Electrocardiograph"
        ],
        "references": [
          "Ramakanth A Gayakwad, “OPAMPS and Linear Integrated Circuits”, Prentice Hall, 4Th Edition, 2015",
          "John G Webster, “Medical Instrumentation Applications and Design”, John Wiley and Sons, New York, 3rd Edition, 2011",
          "Richard Aston, “Principles of biomedical Instrumentation and measurement”, Merrill, New York, 1991"
        ],
        "flags": ["semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "HUM 3022",
        "title": "ESSENTIALS OF MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Definition of management and systems approach, Nature & scope",
          "The functions of managers",
          "Corporate social responsibility",
          "Planning: Types of plans, Steps in planning, Process of MBO, how to set objectives, Strategies, Policies & planning premises",
          "Strategic planning process and tools",
          "Nature & purpose of organising, Span of management, Factors determining the span, Basic departmentation, Line & staff concepts, Functional authority, Art of delegation, Decentralization of authority",
          "HR planning, Recruitment, Development and training",
          "Theories of motivation, Special motivational techniques",
          "Leadership- leadership behaviour & styles, Managerial grid",
          "Basic control process, Critical control points & standards, Budgets, Non-budgetary control devices",
          "Profit & loss control, Control through ROI, Direct, Preventive control",
          "Managerial practices in Japan & USA, Application of Theory Z",
          "The nature & purpose of international business & multinational corporations, Unified global theory of management",
          "Entrepreneurial traits, Creativity, Innovation management, Market analysis, Business plan concepts, Development of financial projections"
        ],
        "references": [
          "Harold Koontz & Heinz Weihrich (2012), “Essentials of Management”, McGraw Hill, New Delhi.",
          "Peter Drucker (1993), “Management: Tasks, Responsibilities and Practices”, Harper and Row, New York.",
          "Peter Drucker (2004),“The Practice of Management”, Harper and Row, New York."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3221",
        "title": "DIGITAL IMAGE PROCESSING",
        "credits": {
          "l": 4,
          "t": 0,
          "p": 0,
          "c": 4
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Review of signals, systems & transforms; 2D signals & systems, 2D DFT and its computation",
          "Image perception – the human vision system, psycho-visual experiments, monochrome vision model, temporal properties",
          "Image compression – the discrete cosine transforms (DCT), properties, computation, practical compression algorithm",
          "Image Enhancement: Point operations – Histogram modification, Histogram equalization; Spatial filtering: linear filters & the median filter",
          "Edge Detection, Hough transform – detection of straight lines and curves in images; Invariant descriptors: Fourier Descriptor, Moment-based invariants",
          "Morphological Image Processing techniques, Thresholding, Connected Component Labeling"
        ],
        "references": [
          "R.C. Gonzalez and R.E. Woods, Digital Image Processing, 4th Edition, Pearson Education Inc., 2017",
          "Jae S. Lim, Two-dimensional Signal and Image Processing, Prentice-Hall, Englewood Cliffs, New Jersey, 1990",
          "A.K. Jain, Fundamentals of Digital Image Processing, Prentice-Hall, 1989, Fourth Indian Reprint"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3241",
        "title": "DIGITAL SIGNAL PROCESSING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["lab"],
        "syllabus": [
          "Signal Processing in MATLAB",
          "Introduction",
          "Basic sequences and operations",
          "Discrete Time System and its properties",
          "Convolution",
          "Discrete Fourier Transform and its properties",
          "Simple filter design",
          "FIR and IIR filters - design and implementation"
        ],
        "references": [
          "Houcque, David. \"Introduction to Matlab for engineering students.\" Northwestern University 1 2005.",
          "Mohindru, P., & Mohindru, P., MATLAB and SIMULINK (A Basic Understanding for Engineers). Cambridge Scholars Publishing, 2020."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3242",
        "title": "DIGITAL IMAGE PROCESSING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["core", "lab"],
        "syllabus": [
          "Image Processing in Python",
          "Introduction",
          "Image processing - Display and Simple Manipulations",
          "Contrast Enhancement and Discrete Fourier Transform of an Image",
          "Image filtering - Spatial and Frequency domain filtering",
          "Discrete Cosine Transform of an Image - examples and exercises with CT/MRI data",
          "Geometrical Transformation of an Image - Applications",
          "Radon Transform"
        ],
        "references": [
          "Hans-Petter Halvorsen. Python for science and engineering. Hans-Petter Halvorsen – a Blog about Technology, 2019, https://www.halvorsen.blog/",
          "Sinan Kalkan, Onur Tolga Sehitoglu, and Gokturk Ucoluk. Programming with Python for Engineers. 2021, https://ceng240.github.io/",
          "Jan Erik Solem. Programming Computer Vision with Python: Tools and algorithms for analyzing images. O'Reilly Media, Inc., 2012."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3124",
        "title": "ARTIFICIAL NEURAL NETWORKS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "neuron models and basic learning rules",
          "Pattern and data",
          "biological foundations of neural network",
          "Components and topology of artificial neural network",
          "Activation functions",
          "computational properties of nodes",
          "learning methods",
          "Training and Testing",
          "Single layer networks",
          "Perceptron",
          "Feed forward neural networks",
          "Supervised Learning networks",
          "Multilayer neural networks",
          "Associative memory networks",
          "training algorithm for pattern association",
          "pattern correction",
          "pattern retrieval",
          "Feedback neural networks",
          "analysis of pattern clustering",
          "Recurrent neurodynamical systems",
          "Unsupervised learning network: Maxnet",
          "Kohonen Self-organizing feature Map",
          "Special networks",
          "Deep learning network: Introduction",
          "Functional units of ANN for object recognition",
          "Neural network for medical diagnosis: Bio-signal Analysis",
          "recognition of diagnostic information from brain MRI images",
          "ANN for digital pathology application"
        ],
        "references": [
          "Simon O. Haykin, “Neural Networks and Learning Machines”, 3rd Edition, Perason, Prentice Hall, New Delhi, 2019",
          "Sathish Kumar, “Neural Networks - A Classroom Approach”, McGraw Hill, 2nd Edition 2017",
          "S. N. Sivanandam, and S. N. Deepa, “Principles of Soft Computing”, Wiley India Pvt. Ltd., New Delhi, 2011",
          "B Yegnanarayana, Artificial Neural Networks, Prentice Hall India, New Delhi,2001",
          "Emmanuel C. Ifeachor, Piotr S Szczepaniak, Paulo J. G. Lisboa, “Artificial Neural Networks in Biomedicine”, Springer-Verlag London, 2000",
          "D L Hudson and M E Cohen, “Neural Networks and Artificial Intelligence for Biomedical Engineering”, IEEE Press Series on Biomedical Engineering, IEEE Press, IEEE Publications, U.S, 2000",
          "Utku Kose, Omer Deperlioglu, D. Jude Hemanth, Deep Learning for Biomedical Applications, ISBN 9780367422509, CRC Press, 2021",
          "E. Golden Julie, Y. Harold Robinson, S. M. Jaisakthi. Handbook of Deep Learning in Biomedical Engineering and Health Informatics, CRC Press,2022"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3125",
        "title": "BASICS OF CELL AND MOLECULAR BIOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Basic properties of cells",
          "Different classes of cells",
          "Prokaryotic and eukaryotic cells",
          "The chemical basis of life",
          "Nature of biological molecules",
          "Types of biological molecule",
          "Cellular metabolism",
          "Structure and function of the plasma membrane",
          "Interactions between cells and their environment",
          "Cytoplasmic membrane systems: structure, function, and membrane trafficking",
          "The cytoskeleton and cell motility",
          "The nature of the gene and the genome",
          "Gene expression: from transcription to translation",
          "The cell nucleus and the control of gene expression",
          "DNA replication and repair",
          "Cellular reproduction",
          "Cell signaling and signal transduction: communication between cells",
          "Cancer",
          "The immune response",
          "Techniques in cell and molecular biology"
        ],
        "references": [
          "Karp G. Cell and molecular biology: concepts and experiments. John Wiley & Sons; 2009 Oct 19.",
          "Alberts B, Bray D, Hopkin K, Johnson AD, Lewis J, Raff M, Roberts K, Walter P. Essential cell biology. Garland Science; 2015.",
          "Rastogi SC. Cell and molecular biology. New Age International; 2006.",
          "Chandar N, Viselli S. Cell and molecular biology. Lippincott Williams & Wilkins; 2012 Aug 14"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 3222",
        "title": "MACHINE LEARNING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Basic Concepts-Supervised Learning, Discriminative Algorithms",
          "Supervised learning setup, LMS, Linear Algebra, Logistic regression, Perceptron",
          "Exponential family, Generative learning algorithms, Gaussian discriminant analysis",
          "Naive Bayes approach, Support vector machines, Vectorization",
          "Practice ML advice: Bias/variance tradeoff, Model selection and feature selection, Evaluating and debugging learning algorithms, Practical advice on structuring an ML project, Convex Optimization",
          "Deep Learning: NN architecture, Forward/Back propagation, Vectorization, Other optimization tricks, Evaluation Metrics",
          "Unsupervised learning: Clustering, K-means, EM, Mixture of Gaussians, Factor analysis, PCA (Principal components analysis), ICA (Independent components analysis)",
          "Reinforcement learning and control: MDPs, Bellman equations, Value iteration and policy iteration, Linear quadratic regulation (LQR), LQG, Q-learning, Value function approximation"
        ],
        "references": [
          "Christopher Bishop, Pattern Recognition and Machine Learning (Information Science and Statistics), Springer; 1st Edition. 2006. Corr. 2nd Print, 2011.",
          "Stephen Marsland, Machine Learning: An Algorithmic Perspective, Chapman and Hall/CRC, 2nd Edition, 2014.",
          "Duda, Richard, Peter Hart, and David Stork. Pattern Classification. 2nd Edition, New York, NY: Wiley-Interscience, 2007."
        ],
        "flags": []
      },
      {
        "sem": 7,
        "code": "BME 3223",
        "title": "ELECTRICAL AND MAGNETIC MATERIALS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Atomic structure and interatomic bonding",
          "Metals",
          "Semiconductors",
          "Insulators",
          "Conductivity of metals and semiconductors - Drude model",
          "Dependence on temperature and composition",
          "Matthiessen's rule",
          "Insulating materials: Inorganic, organic, liquid and gaseous insulators",
          "Dielectrics: Introduction to Dielectric polarization and classification – Clausius-Mossotti relation",
          "Dielectric Breakdown: Mechanism of breakdown in gases, liquids and solids – basic theories including Townsend's criterion, Streamer mechanism, suspended particle theory, intrinsic breakdown, electro-mechanical breakdown",
          "Factors influencing Ageing of insulators",
          "Application of vacuum insulation",
          "Breakdown in high vacuum",
          "Ferroelectricity",
          "Piezoelectricity",
          "Magnetic Materials: Magnetization of matter",
          "Classification of magnetic materials - Curie-Weiss law",
          "Hard and soft magnetic materials",
          "Ferrites",
          "Optical Properties: Light Interactions with Solids",
          "Refraction",
          "Reflection",
          "Transmission",
          "Absorption",
          "Luminescence",
          "Lasers",
          "Photoconductivity"
        ],
        "references": [
          "William D. Callister, Jr., David G. Rethwisch, Materials Science and Engineering: An Introduction, 9th Edition, Wiley, 2014",
          "Dekker A.J., Solid state physics, Macmillan publishers India, 2012",
          "James F. Shackelford, Introduction to Materials Science for Engineers, 8th edition, Pearson, 2014"
        ],
        "flags": ["semester_mismatch", "department_context_mismatch"]
      },
      {
        "sem": 3,
        "code": "BME 4291",
        "title": "INDUSTRIAL TRAINING",
        "credits": null,
        "tags": ["core"],
        "syllabus": [
          "Undergo industrial training for a minimum period of 4 weeks",
          "Training may be taken in a phased manner during the vacation starting from the end of third semester",
          "Submit training report in the prescribed format to the department",
          "Make a presentation of the training report",
          "Report must include certificates issued by the industry"
        ],
        "references": [],
        "flags": ["missing_credits", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BME 4292",
        "title": "PROJECT WORK/PRACTICE SCHOOL",
        "credits": null,
        "tags": ["core", "lab"],
        "syllabus": [
          "Project work carried out in institution/industry/research laboratory or other competent institutions",
          "Duration of project work: minimum 16 weeks (extendable up to 24 weeks)",
          "Mid-semester evaluation after approximately 8 weeks",
          "Submission of interim project report during mid-semester evaluation",
          "Final evaluation and viva-voice after submission of final project report",
          "Student presentation on project work before department committee as part of evaluation"
        ],
        "references": [],
        "flags": ["missing_credits", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BME 4401",
        "title": "INTRODUCTION TO BIOMEDICAL NANOTECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction nanotechnology: Nanomaterials - classifications, synthesis methods, nanostructured system by self-assembly, biomimetic and biomolecular recognition assembly, surface functionalization of nanoparticles, nanocomposites",
          "Characterization tools for nanomaterials and Nano systems - structural and chemical characterization techniques",
          "Properties of nanomaterials: mechanical properties, optical properties, surface plasmon resonance, quantum size effects, introduction to nanoelectronics",
          "Nanotechnology for drug delivery",
          "Nanotechnology for diagnosis, prognosis, and disease status: biomedical imaging, biosensors and drug delivery",
          "Therapeutic nanotechnology",
          "Nanotechnology for implant materials and tissue engineering",
          "Cosmetics",
          "Nanotechnology safety concerns"
        ],
        "references": [],
        "flags": ["missing_references", "semester_inconsistency"]
      },
      {
        "sem": 3,
        "code": "BME 4291",
        "title": "INDUSTRIAL TRAINING",
        "credits": null,
        "tags": ["core"],
        "syllabus": [
          "Undergo industrial training for a minimum period of 4 weeks",
          "Submit training report in prescribed format to the department",
          "Present the training report",
          "Include certificates issued by the industry in the report"
        ],
        "references": [],
        "flags": ["missing_credits"]
      },
      {
        "sem": 3,
        "code": "BME 4292",
        "title": "PROJECT WORK/PRACTICE SCHOOL",
        "credits": null,
        "tags": ["lab"],
        "syllabus": [
          "Project work carried out in institution/industry/research laboratory or any other competent institutions",
          "Minimum duration of 16 weeks, extendable up to 24 weeks",
          "Mid-semester evaluation after about 8 weeks",
          "Submission of interim project report during mid-semester evaluation",
          "Final evaluation and viva-voice after submission of final project report in prescribed form",
          "Presentation before department committee as part of project evaluation"
        ],
        "references": [],
        "flags": ["missing_credits", "structure_mismatch"]
      },
      {
        "sem": 3,
        "code": "BME 4401",
        "title": "INTRODUCTION TO BIOMEDICAL NANOTECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction nanotechnology: Nanomaterials- classifications, synthesis methods, nanostructured system by self-assembly, biomimetic and biomolecular recognition assembly, surface functionalization of nanoparticles, nanocomposites",
          "Characterization tools for nanomaterials and Nano systems- structural and chemical characterization techniques",
          "Properties of nanomaterials: mechanical properties, optical properties, surface plasmon resonance, quantum size effects, introduction to nanoelectronics",
          "Nanotechnology for drug delivery, nanotechnology for diagnosis, prognosis, and disease status: biomedical imaging, biosensors and drug delivery",
          "Therapeutic nanotechnology, nanotechnology for implant materials and tissue engineering, cosmetics, nanotechnology safety concerns",
          "Self-Directed Learning: mechanical properties, optical properties, surface plasmon resonance, quantum size effects"
        ],
        "references": [
          "Guozhong Cao, Nanostructures and nanomaterials Synthesis, Imperial Press, 2011",
          "Neelina H. Malsch, Biomedical nanotechnology, CRC Press, 2005",
          "G.A. Ozin and A.C. Arsenault, Nanochemistry: A chemical approach to Nanomaterials, Royal Society of Chemistry, 2005",
          "Kenneth E. Gonsalves, Craig R. Halberstadt, Cato T. Laurencin, Lakshmi S. Nair, Mott, Biomedical Nanostructures,Weily-Blackwell, 1st edition, 2008",
          "Jun Li, Nianqiang Wu, Biosensors based on Nanomaterials and nanodevices, CRC Press, 1st edition, 2014",
          "T. Pradeep, A Textbook of Nanoscience and Nanotechnology, McGraw Hill Education, 1st edition, 2017",
          "Challa S. S. R. Kumar, Josef Horms, CsrolaLeuschner, Nanofabrication Towards Biomedical Application: Techniques, Tools, Applications and impact, Wiley- VCH, 1st edition, 2015"
        ],
        "flags": [
          "department_semester_mismatch",
          "course_code_suggests_higher_semester"
        ]
      },
      {
        "sem": 3,
        "code": "BME 4402",
        "title": "BIOMATERIAL CHARACTERIZATION TECHNIQUES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Physical and chemical characterization of Biomaterials: optical microscopy, UV-Vis spectroscopy, fluorescence spectroscopy, transmission electron microscope (TEM), scanning electron microscope (SEM), scanning tunneling microscope (STM), atomic force microscope (AFM), X-ray diffraction (XRD), Fourier-transform infrared spectroscopy (FT-IR), dynamic light scattering (DLS), contact angle, gas adsorption, mass spectroscopy, chromatography",
          "Thermal characterization of biomaterials: thermogravimetric analysis (TGA), differential thermal analysis (DTA), differential scanning calorimetry (DSC)",
          "Surface Characterization of Biomaterials: X-ray photoelectron spectroscopy (XPS), auger electron spectroscopy (AES), secondary ion mass spectroscopy (SIMS), light microscopy and confocal microscopy"
        ],
        "references": [
          "Amit Bandhyopadhya and Susmita Bose, Characterization of Biomaterials, Elsevier, 2013",
          "Douglas B. Murphy, Fundamentals of light microscopy and electronic imaging, Wiley-Liss, Inc. USA, 2001",
          "B.D. Cullity and S.R. Stock, Elements of X-ray diffraction, Prentice Hall, Inc. USA, 2001",
          "D.B. Williams and C. Barry Car ter, Transmission electron microscopy 4 volumes, Springer, USA, 1996",
          "Gerhard Huebschen Iris Altpeter, Ralf Tschuncky Hans-Georg Herrmann, Materials Characterization Using Nondestructive Evaluation (NDE) Methods, Elsevier, 2016",
          "M. Jaffe, W. Hammond, P. Tolias, T. Arinzeh, Characterization of Biomaterials, Elsevier, 2012",
          "Crankovic GM. ASM Handbook, Volume 10: Materials Characterization. ASM International; 1986"
        ],
        "flags": ["typo_in_title", "semester_inconsistent"]
      },
      {
        "sem": 4,
        "code": "BME 4403",
        "title": "BIO FABRICATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Biomaterials: polymers",
          "bio inks",
          "tissue-derived matrices",
          "tissue engineering and bio fabrication description of extracellular matrix",
          "bio printing",
          "inorganic powder printing",
          "stereo lithography",
          "selective laser sintering",
          "melt electro spinning writing",
          "self-healing hydrogel system",
          "polymers in 3D printing",
          "introduction to rheology",
          "3D printing history",
          "techniques",
          "applications",
          "CAD/CAM",
          "3D modelling",
          "Medical imaging to printing",
          "3D printing techniques: additive manufacturing",
          "3D printing in the clinic: devices and implants",
          "Cell printing",
          "Applications: cartilage",
          "liver",
          "cardiovascular system",
          "organ-on-a-chip",
          "in vitro models",
          "Nano/micro fabrication techniques: Photolithography",
          "Soft lithography- micro-stamping",
          "stencil patterning",
          "microfluidic patterning",
          "Electron beam lithography",
          "Focused ion beam Lithography",
          "Colloid mono layer Lithography",
          "Molecular self-assembly",
          "Electrically induced nano patterning"
        ],
        "references": [
          "Aleksandr Ovsianikov, James Yoo, Vladimir Mironov, 3D Printing and Bio fabrication, Springer, 2018, ISBN 978-3-319-45445-0",
          "Zhang et al., 3D Bioprinting and Nanotechnology in Tissue Engineering and Regenerative Medicine. 1st edition, ISBN 9780128005477",
          "Forgacs et al., Biofabrication - Micro- and Nano-fabrication, Printing, Patterning and Assemblies, 1st Edition, ISBN 9781455728527",
          "Marc J. Madou, Fundamentals of Microfabrication and Nanotechnology, 2011, 3rd edition, CRC Press, ISBN 0849331803",
          "Guozhong Cao, Nanostructures and Nanomaterials: Synthesis, Properties and Applications, 2nd edition ISBN 9789814324557"
        ],
        "flags": [
          "semester_discrepancy (department states THIRD SEMESTER but course code BME 4403 implies 4th semester)"
        ]
      },
      {
        "sem": 3,
        "code": "BME 4404",
        "title": "DRUG DELIVERY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Drug delivery system: overview, dosage form-tablet, capsule, parenteral etc. classification of drug delivery system",
          "Chemically controlled system, diffusion-controlled system",
          "Controlled release mechanism - Membrane reservoir system, Matrix system, swelling controlled release system, biodegradable controlled release system",
          "Fundamental aspects of drug delivery: introduction of pharmacokinetics and pharmacodynamics, diffusive transport, diffusion in heterogeneous system, passage of drug through membrane",
          "Drug release kinetics from different bio polymer matrices",
          "Pharmacokinetics: common routes of systemic drug administration, drug absorption, bio availability, determinants of bio availability - disintegration, dissolution, drug distribution, drug elimination",
          "Matrix based drug delivery system: Delivery materials, polymer-based matrices; hydrogels - drug carriers, transdermal and trans-mucosal drug delivery system",
          "Measuring in vitro diffusions, measuring controlled release kinetics, drug targeting approaches, bio compatibility aspects of matrices",
          "Immunity and immunological preparations: immunity, types, immunological preparations; bacterial vaccines, vaccines containing living viruses, vaccines containing toxoids",
          "Fundamentals of vaccine delivery"
        ],
        "references": [
          "B. Wang, T. J. Sahaan, R. A. Soltero, Drug Delivery: Principles and applications, John Wiley & Sons Inc., 2016.",
          "L Shargel, S Wu-Pong, A Yu, Applied Biopharmaceutics & Pharmacokinetics, 6th Edition, The McGraw Hill, 2005.",
          "S. Rosenbaum, Basic Pharmacokinetics and Pharmacokinetics, Wiley, 2011.",
          "Juergen Siepmann, Ronald A. Siegel, Michael J. Rathbone (Editors), Fundamentals and Applications of Controlled Release Drug Delivery, Springer, 2012.",
          "Eric P. Holowka, Sujata K. Bhatia, Drug Delivery-Materials Design and Clinical Perspective, Springer, 2014.",
          "David Williams, Essentials of Biomaterials Science, Cambridge University press, 2014."
        ],
        "flags": [
          "structure_mismatch: course_code_suggests_higher_semester_than_provided_department_context",
          "missing_department_specific_semester_mapping"
        ]
      },
      {
        "sem": 3,
        "code": "BME 4405",
        "title": "ARTIFICIAL INTELLIGENCE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Basics of Artificial Intelligence (AI), Healthcare IT and the Growing Need for AI Operations",
          "AI Healthcare Operations (Clinical): Clinical Impact of AIOps, Design and Innovation, AIOps for Healthcare Delivery, Clinical AI, AIOps. Deploying AI in practice",
          "Real world applications of AI in medicine, Automation, Workflow, Process, and Intelligence Design",
          "Security, Ethics of intelligence, Policy and law, confidentiality, privacy aspects of medical software development",
          "The future of AI, The Convergence of Healthcare AI Technology",
          "Case studies: AI for Electronic Health Records Data, AI and 2D Medical imaging data, 3D Medical imaging data, AI to wearable device data"
        ],
        "references": [
          "Robert Shimonski, AI in healthcare, Wiley, 2020",
          "Arjun Panesar, Machine learning & AI for healthcare, 1st Edition, Apress, 2019",
          "Ankur Saxena, Shivani Chandra, Artificial intelligence and machine learning in healthcare, 2021"
        ],
        "flags": ["semester_discrepancy"]
      },
      {
        "sem": 3,
        "code": "BME 4406",
        "title": "BIOMEDICAL SIGNAL PROCESSING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Review of Probability theory, random variables and stochastic processes",
          "Spectral estimation techniques",
          "Estimation of the autocorrelation and power spectrum density (PSD): Nonparametric methods of power spectrum estimation",
          "Cepstrum analysis: The cepstrum, power cepstrum, complex cepstrum",
          "Adaptive Filters: Weiner filter, Adaptive noise canceling",
          "Adaptive line enhancer principles using LMS and GAL algorithm",
          "Parametric methods of power spectrum estimation: AR modeling – The Yule-Walker method and least square method"
        ],
        "references": [
          "John G. Proakis and Dimitris G. Manolakis, “Digital Signal Processing: Principles, Algorithms, and Applications”, Pearson, 4th edition, 2007",
          "Simon Haykin, “Adaptive Filter Theory”, Pearson, 5th edition, 2013",
          "M. Akay, “Biomedical signal processing”, Academic press, 1994",
          "Rangaraj M Rangayyan, “Biomedical Signal Analysis”, John Wiley and Sons, Illustrated edition, 2015"
        ],
        "flags": ["semester_inferred_from_context"]
      },
      {
        "sem": 3,
        "code": "BME 4407",
        "title": "DECISION SUPPORT SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Computer-based Clinical Decision Support: Overview, Status, and Challenges",
          "Features of CDSS",
          "Mathematical Foundations of Decision Support Systems",
          "Data Mining and Clinical Decision Support Systems",
          "Usability and Clinical Decision Support",
          "Architectures for Clinical Decision Support",
          "Role of Quality Measurement and Reporting Feedback as a Driver for Care Improvement",
          "Decision support delivered using the outpatient electronic health record",
          "Knowledge for Clinical Decision Support: Statistical and Machine Learning Techniques",
          "Evidence-Based Medicine",
          "statistical methods in meta-analysis",
          "Meta-analysis of complex datasets",
          "Big Data and Population-Based Decision Support",
          "Clinical Decision Support for Personalized Medicine",
          "Decision Rules and Expressions",
          "Formal methods for modelling",
          "Best Practices for Implementation of Clinical Decision Support",
          "National Policies on the Use of Clinical Decision Support",
          "Ethical and Legal Issues in Decision Support",
          "Evaluation of Clinical Decision Support",
          "Adoption of Clinical Decision Support system",
          "Decision Support for Patients",
          "Diagnostic Decision Support Systems",
          "Applications"
        ],
        "references": [
          "Decision Making in Health and Medicine, Myriam Hunink and Paul Glasziou, 6th printing 2007; Publisher: Cambridge University Press",
          "Clinical Decision Support Systems: Theory and Practice, Berner, Eta S. (Ed.), 2nd ed., 2007, Publisher: Springer, Health Informatics Series",
          "Osheroff, Pifer, Teich, Sittig, Jenders, 2005; Publisher: Health Information and Management Systems Society (HIMSS)",
          "Robert Greenes, Clinical Decision Support, The Road to Broad Adoption, 2nd Edition - March 26, 2014, eBook ISBN: 9780128005422, Hardcover ISBN: 9780123984760, Elsevier"
        ],
        "flags": []
      },
      {
        "sem": 4,
        "code": "BME 4408",
        "title": "MEDICAL IMAGING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["elective", "theory"],
        "syllabus": [
          "Review of signals, systems & transforms",
          "2D signals & systems",
          "Medical Imaging: Imaging modalities and their applications",
          "Computed tomography (CT): mathematical basis, the Radon transform & the central slice theorem",
          "Image reconstruction from projections: the Direct Fourier Method, convolution back projection (CBP) algorithm, Algebraic Reconstruction Techniques (ART)",
          "reconstruction from fan-beam projections",
          "Extension to 3D – cone-beam CT, spiral CT",
          "Tomosynthesis",
          "X-rays: utility, generation and detection",
          "X-ray CT systems",
          "Emission CT: principles, Positron emission tomography (PET)",
          "attenuation correction in ECT",
          "Ultrasound in clinic: benefits/risks",
          "Basics of Ultrasound - review",
          "Ultrasound imaging",
          "Contrast enhanced ultrasound imaging",
          "Motion artifacts in ultrasound imaging",
          "Clutter filtering",
          "elastography, plane wave imaging",
          "Magnetic resonance imaging: Principles of data-generation, resolving the tissues, resolving the spatial locations, and extension to 2D",
          "Resolution & Field of View",
          "Data sampling and the concept of bandwidth"
        ],
        "references": [
          "R.C Gonzalez and R.E. Woods, Digital Image Processing, 4Th Edition, Pearson Education Inc., 2017.",
          "A.K. Jain, Fundamentals of Digital Image Processing, Prentice-Hall, 1989, Fourth Indian Reprint.",
          "A.C. Kak and M. Slaney, Principles of Computerized Tomographic Imaging, SIAM's Classics in Applied Mathematics, Philadelphia, SIAM, 2001.",
          "Kline Jacob, Handbook of Biomedical Engineering, Academic Press, 1988.",
          "Carol M. Rumack, Deborah Levine, Diagnostic Ultrasound, 5Th Edition, Elsevier, 2017.",
          "Thomas L. Szabo, Diagnostic Ultrasound Imaging: Inside Out, 2nd Edition, Elsevier, 2014.",
          "James A. Zagzebski, Essentials Of Ultrasound Physics, 2nd Edition, Mosby, 2010.",
          "Barbara S. Hertzberg, William D. Middleton, Ultrasound: The Requisites, EBook (Requisites in Radiology), 2015.",
          "HH Schild, “MRI made easy”, Schering AG, Berlin, 1990."
        ],
        "flags": ["semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "BME 4441",
        "title": "BIOSTATISTICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction",
          "Summarizing Quantitative Data",
          "Summarizing Categorical Data",
          "Prevalence",
          "Incidence",
          "Relative Risk",
          "Risk Difference",
          "Sampling Bias",
          "Confidence Intervals",
          "Study Design",
          "Probability & Screening",
          "Binomial Distributions",
          "Normal Distributions",
          "Sampling Distributions",
          "Hypothesis Test Introduction",
          "One-sample proportion",
          "Chi-square test",
          "t tests",
          "Continued MCW",
          "Power and Sample Size",
          "Correlation & Regression",
          "Multiple Regression",
          "Regression to the Mean MCW"
        ],
        "references": [
          "Sullivan, L.M., Essentials of biostatistics for the health sciences, 3rd Edition, Jones & Bartlett Learning, 2018",
          "Machin, Campbell and Walters, Medical Statistics, 4th ed., Wiley, 2007",
          "Motulsky, H., Intuitive Biostatistics: A nonmathematical guide to statistical thinking, 3rd Edition, Oxford University Press, New York, 2014",
          "Utts, J and Heckard, R., Mind on statistics, 5th Edition, Cengage Learning, USA"
        ],
        "flags": ["semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "BME 4442",
        "title": "BIOELECTRO MAGNETISM",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Fundamental physical knowledge and electrostatic and magnetic field equations",
          "Fundamentals of bio electromagnetism",
          "Vector Analysis",
          "Electrical Sources and Fields",
          "Introduction to Membrane Biophysics",
          "Action Potentials",
          "Volume Conductor Fields",
          "Bioelectric sources and conductive environment",
          "Electrodynamics of bioelectrical fields",
          "Concepts of bioelectrical and bio magnetic measurement",
          "Measurement methods",
          "Modelling and simulation techniques",
          "Bioelectric Sources and Conductors and their Modelling",
          "Anatomical and Physiological Basis of Bio electromagnetism",
          "Nerve and Muscle Cells",
          "Subthreshold Membrane Phenomena",
          "Active Behavior of the Membrane",
          "Synapses",
          "Receptor Cells",
          "Brain",
          "The Heart",
          "Volume Source and Volume Conductor",
          "Source-Field Models",
          "Bidomain Model of Multicellular Volume Conductors",
          "Electronic Neuron Models",
          "Theoretical Methods in Bioelectromagnetism",
          "Theoretical Methods for Analyzing Volume Sources and Volume Conductors",
          "Theory of Biomagnetic Measurements",
          "Electric and Magnetic Measurement of the Neural tissue and the Heart",
          "Electroencephalography",
          "Magnetoencephalography",
          "12-Lead ECG System",
          "Vector cardiography Lead Systems",
          "Other ECG Lead Systems",
          "The Basis of ECG Diagnosis",
          "Magnetocardiography"
        ],
        "references": [
          "Computational Cardiology: Modeling of Anatomy, Electrophysiology, And Mechanics by Frank Sachse. Springer-Verlag New York, Inc., Secaucus, NJ, USA",
          "Bioelectromagnetism by Jaakko Malmivuo and Robert Plonsey. http://www.bem.fi/book/",
          "Mathematical Physiology by James Keener and James Sneyd. Springer Verlag.",
          "Mathematically Modeling the Electrical Activity of the Heart: From Cell to Body Surface and Back by Andrew Pullan. World Scientific Publishing Company (September 30, 2005)"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4443",
        "title": "BIOMETRICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Basic image operations",
          "Interpolation",
          "Special filters",
          "enhancement filter",
          "Edge detection",
          "thresholding",
          "localization",
          "Introduction of biometric traits and its aim",
          "Biometric system",
          "authentication",
          "physiological and behavioral properties",
          "Identification and verification",
          "Threshold",
          "Score distribution",
          "FAR and FRR",
          "System design issues",
          "Expected overall error",
          "EER",
          "ROC curve",
          "DET curve",
          "FAR/FRR curve",
          "Existing Biometric Technologies: Fingerprints",
          "Face",
          "Iris",
          "Hand Geometry",
          "Ear",
          "Voice",
          "Retina",
          "Gait",
          "Introduction to physiological and behavioral biometrics in hospitals or care units",
          "Biometric authentication based on ECG",
          "EMG",
          "Phonocardiograph (PCG) signals",
          "Multimodal identification and Verification system",
          "normalization strategy",
          "Fusion methods",
          "Biometric system security",
          "Face and ECG Based Multimodal Biometric Authentication"
        ],
        "references": [
          "Girija Chetty and Jucheng Yang, Advanced Biometric Technologies, InTech, 2011",
          "Jain, A.K., Ross, A., Nandakumar, K. Introduction to Biometrics. Springer; 2011",
          "David Zhang, Fengxi Song, Zhizhen Liang, Yong Xu, Advanced Pattern Recognition Technologies with Applications to Biometrics (Premier Reference Source), Medical Information Science Reference; 1st edition, 2009",
          "Ruud M. Bolle, Sharath Pankanti, Nalini K. Ratha, Andrew W. Senior, Jonathan H. Connell Guide to Biometrics, By, Springer, 2009",
          "Duda, Richard, Peter Hart, and David Stork. Pattern Classification. 2nd Edition, New York, NY: Wiley-Interscience, 2007",
          "Rafael C. Gonzalez, Richard Eugene Woods, Digital Image Processing using MATLAB, 2nd Edition, Tata McGraw-Hill Education, 2010"
        ],
        "flags": ["semester_inferred_from_context"]
      },
      {
        "sem": 3,
        "code": "BME 4444",
        "title": "EMBEDDED SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Embedded systems, processor and memory organization",
          "Devices, Serial & Parallel buses for device networks",
          "Device drivers and interrupt servicing mechanisms",
          "Programming concepts, and embedded programming in C",
          "Real-Time Operating systems and Task Scheduling algorithms",
          "Hardware Software Co-simulation: Co-simulation approaches, Embedded System Development Life Cycle (EDLC)",
          "Representative Embedded systems"
        ],
        "references": [
          "Peckol James K, “Embedded Systems”John Wiley and Sons, New Delhi, 2013.",
          "Valvano Jonathan W, “Embedded Systems”, Jonathan W.V, U. K., 2014.",
          "Frank Vahid and Tony Givargis, “Embedded system Design – A Unified Hardware/Software Introduction”, Wiley India Pvt. Ltd, 2014.",
          "Tim Wilmshurst, “An Introduction to the design of Small-Scale Embedded Systems” Palgrave, New York, 2003.",
          "Shibu K.V, “Introduction to Embedded Systems”, TMH, New Delhi, 2010."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4445",
        "title": "FUZZY LOGIC SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["theory", "elective"],
        "syllabus": [
          "Introduction to Fuzzy Sets and Fuzzy Logic",
          "Membership functions",
          "Singleton and Non-Singleton Type-1 Fuzzy logic systems",
          "Type-2 Fuzzy Sets",
          "Type-2 Fuzzy Logic Systems"
        ],
        "references": [
          "Jerry M. Mendel, Uncertain Rule-based Fuzzy Logic System: Introduction and New Directions, Springer; 2nd Edition, 2017",
          "Timothy J. Ross, Fuzzy Logic with Engineering Applications, Wiley, 3rd Edition, 2011",
          "George J. Klir, Bo Yuan, Fuzzy Sets and Fuzzy Logic: Theory and Applications, Prentice Hall, Facsimile Edition, 1995"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4446",
        "title": "HEALTH CARE MANAGEMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction: ABC of Hospital Administration, Principles of Management",
          "Human Resources: Motivation, Time Management, Leadership and Supervision, Nursing Services, Effective Communication, Conflicts, Monitoring and Control, Public Relations, Medical Social Service department, Professional Hazards",
          "Clinical Services: Indoor Services, Outpatient Department, Casualty and Emergency Wing, Intensive Care areas, Operating room and post-operative units",
          "Support Services: Laboratories, Blood Bank, Radiology Services, Pharmacy, Central sterile supply department, Medical Record department, Materials Management, Housekeeping and maintenance, Linen and laundry, Dietary Services",
          "Hospital Information system and computerization",
          "Security and safety",
          "Finance and Budget, Costing",
          "Medical Ethics, Law and medical profession",
          "Hospital acquired infections, Waste disposal",
          "Quality assurance and medical audit",
          "Disaster Management"
        ],
        "references": [
          "Colonel (Retd) B.M.Sakharkar , Principles of Hospital Administration and Planning , Jaypee Brothers.",
          "C M Francis, Hospital Administration, Jaypee Brothers Edition 2, 1995.",
          "S L Goel, R Kumar, Hospital Administration and Management, Vol 1,2,3, Deep & Deep.",
          "Humble John W, Management By Objectives in Action, McGraw Hill, 1970."
        ],
        "flags": ["course_code_suggests_higher_semester"]
      },
      {
        "sem": 3,
        "code": "BME 4447",
        "title": "PATTERN RECOGNITION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Pattern Recognition (PR) system",
          "Application domains",
          "Feature, Feature space, Class, Feature vector, Classifier, Classification and approaches, Design cycle",
          "Linear Regression, Logistic Regression & General Linear Model",
          "Introduction to Statistical decision making",
          "Bayesian Decision Theory: continuous and discrete features, Multiple features, conditionally independent features, Maximum likelihood estimation, Decision boundaries, unequal costs of error, Estimation of error rates, the leaving one-out technique",
          "Non-Parametric Techniques: K-nearest neighbourhood estimation",
          "clustering: Hierarchical clustering, Agglomerative clustering algorithm, Single, Average and Complete linkage algorithms",
          "Partitional clustering, K means, Ward's algorithm, Problems",
          "Gaussian Mixture Models – with Expectation Maximization algorithm",
          "Principal Component Analysis",
          "Introduction to Neural Networks",
          "performance analysis of a classifier"
        ],
        "references": [
          "Earl Gose, Richard, Johnson Baugh and Steve Jost, “Pattern recognition and Image analysis”, Prentice Hall, New Delhi, 2002",
          "Schalkoff Robert J, “Pattern recognition”, John Wiley & Sons, New York, 1992",
          "Richhrad O Duda, Peter E. Hart, David G. Strok, “Pattern Classification”, 2nd Edition, Wiley, Singapore, 2005",
          "S. N. Sivanandam, S. Sumathi and S. N. Deepa, “Introduction to Neural Networks using MATLAB 6.0”, TATA McGRAW HILL, New Delhi, 2006",
          "S. N. Sivanandam, and S. N. Deepa, “Principles of Soft Computing”, 2nd Edition, Wiley India Pvt. Ltd, New Delhi, 2011",
          "Sara Moein, “Medical Diagnosis Using Artificial Neural Networks”, IGI Publications, USA,2014",
          "Volker Schmid Anke Meyer-BaeseSchmid Meyer-Baese “Pattern Recognition and Signal Analysis in Medical Imaging”, 2nd Edition, Academic Press, 2014"
        ],
        "flags": ["semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "BME 4448",
        "title": "PHYSIOLOGICAL CONTROL SYSTEM",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to physiological modeling: Introduction; Multi-scale organization of living organisms: cell to organ Homeostasis",
          "Examples of physiological control systems",
          "Review of linear systems concepts, Fourier series: Modeling signals using Fourier series, Deterministic and stochastic signals and systems",
          "Mathematical tools: Basic concepts of control systems; Open vs. closed loop Steady state and transient analysis of control systems",
          "Linear model's vs nonlinear models Distributed vs. lumped parameter models Compartment models",
          "Cardiovascular and Respiratory system: Circulatory system; Key events in the cardiac cycle; Blood pressure and flow; vascular impedance",
          "Lumped parameter models, windkessel model of circulation Cardiac mechanics",
          "Respiratory mechanics; lung models",
          "Nervous system: Anatomy and physiology of nerves; Action potentials; Hodgkin-Huxley model",
          "Musculoskeletal system: Muscle anatomy and physiology; How muscles contract; Hill model of muscle contraction; Muscle stretch reflex",
          "Eye Movement Model: Types of Eye movement; Eye movement system and Wetheimer's saccade eye model",
          "Robinson's Model; Oculomotor muscle model; Linear Reciprocal Innervations Oculomotor Model"
        ],
        "references": [
          "Michael C. K. Khoo, Physiological Control Systems: Analysis, Simulation and Estimation, Wiley IEEE Press, 1999",
          "John D. Enderle, “Model of Horizontal eye movements: Early models of saccades and smooth pursuit”, Morgan & Claypool Publishers, 2010"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4449",
        "title": "PROSTHETICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Familiarity with the operation/working principles of various prosthesis used in neural and urological applications",
          "Soft Tissue Replacements: Cardiac Anatomy and Pathophysiology, mechanical and bioprosthetic heart valves, Artificial heart and cardiac assist devices, vascular prosthesis: stent grafts",
          "Hard Tissue Replacements: Bone structure, cortical and cancellous bone, viscoelastic properties. Fracture and fixators, healing of bones. Joint replacements -Hip and knee implants, dental implants: introduction, artificial dental implants, implant fixations",
          "Neural Prostheses: Origins of the field of neural prostheses, Motor prosthesis: Neuromuscular Stimulation for Control of Limb Movement, Sensory prosthesis: Visual, auditory (cochlear implant) and tactile",
          "Artificial Kidney: Structure and function of the kidney, Kidney disease, Renal failure, Mass transfer in dialysis, Clearance, Permeability, Membranes, Hemofiltration",
          "Artificial Pancreas: Structure and function of pancreas. Endocrine pancreas & insulin secretion. Diabetes, insulin therapy, insulin administration systems, implantable insulin pumps (artificial pancreas)",
          "Orthopaedic and Urologic prosthesis"
        ],
        "references": [
          "Andrej Kral, Felix Aplin, Hannes Maier, 'Prostheses for The Brain', Academic Press, 2021",
          "Joseph D Bronzino, “The Biomedical Engineering Handbook”, Third Edition, 2006, CRC press, USA",
          "Gerald E. Miller, 'Artificial organs', Morgan & Claypool Publishers, 2006",
          "Finn WE, LoPresti PG, editors. Handbook of neuroprosthetic methods. CRC Press; Dec 16, 2002"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4450",
        "title": "REHABILITATION ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to rehabilitation engineering in general",
          "Need and importance of rehabilitation engineering",
          "Different categories of rehabilitation needed for society",
          "Understanding different stages through which rehabilitation is implemented",
          "Review of physical disabilities: definition and quantitative assessment",
          "Concept of compensation for disabilities and importance of assistive devices",
          "Popularly available assistive technology",
          "Quantification of disability, methods, and feasibility in rehabilitation",
          "Categories of assistive devices with emphasis on leg/hand disabilities",
          "Biological signals relevance in rehabilitation engineering",
          "Features of EMG and MMG signals",
          "Modeling tools and techniques in rehabilitation engineering",
          "Significance of modeling for disability assessment",
          "Popular models used for assessing disability",
          "Electronic hardware for assistive technology (microcontroller utility)",
          "Human locomotion characteristics and dynamics of human organs",
          "Application in assistive limb technology",
          "Case studies of developed assistive devices"
        ],
        "references": [
          "Joseph D Bronzino, THE Biomedical Engineering Handbook, VOL11, CRCPRESS, Edition 2, 2000",
          "John G. Webster, Albertm. Cook, Willis J Tompkins, GREGG C Vanderheiden, Electronic devices for Rehabilitation, Chapman and Hall Ltd, 1985",
          "John Enderle, Dusan Blanchard, Joseph Bronzino, Introduction to Biomedical Engineering, Academic press, 2000",
          "Arthur C Guyton, Textbook of Medical Physiology, Edition 9, 1996"
        ],
        "flags": [
          "semester_mismatch (course code suggests higher semester than department context)"
        ]
      },
      {
        "sem": 3,
        "code": "BME 4451",
        "title": "TELEMEDICINE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["theory"],
        "syllabus": [
          "History of Telemedicine, Block diagram of telemedicine system, origin and development of Telemedicine, Benefits and limitations of Telemedicine",
          "Data & Signal, transmission impairments & channel capacity, Guided & Unguided transmission media, transmission of digital signal and analog signal",
          "Analog modulation techniques: AM & FM, analog to digital conversions and digital modulation techniques like ASK, FSK, PSK and DPSK",
          "Multiplexing techniques: TDM & FDM, Multiple access techniques: TDMA, FDMA & CDMA",
          "Types of Network; Switching techniques: Circuit switching and Packet switching",
          "Types of wireless network like Bluetooth, Wi-Fi, Zig Bee, Satellite network etc.",
          "Data Security and Standards: Encryption, Cryptography, digital signature, biometric security",
          "Ethical and legal aspects of Telemedicine",
          "Applications of Telemedicine: Teleradiology, telepathology, teleoncology, and other applications including videoconferencing"
        ],
        "references": [
          "Behrouz A Forouzan,\"Data Communication and Networking\", McGraw Hill Education (India) Pvt. Ltd., 5th Edition, 2013.",
          "Shashi Bhushan Gogia, \"Fundamentals of telemedicine and telehealth\", Academic Press, ist Edition, 2019.",
          "Bernard Fong, A.C.M. Fong, C.K. Li, \"Telemedicine technologies: Information technologies in Medicine and telehealth\", John Wiley & Sons, UK, 2011.",
          "Olga Ferrer-Roca, M.Sosa Ludicissa, Handbook of Telemedicine, IOS Press 2002.",
          "Konstantina S.Nikita, Handbook of Biomedical Telemetry, John Wiley & Sons, 2014.",
          "A.C. Norris, Essentials of Telemedicine and Telecare, John Wiley & Sons, 2002.",
          "R S Khandpur, \"Telemedicine technology and applications\", PHI Learning Pvt. Ltd, New Delhi, 2017."
        ],
        "flags": [
          "semester_inferred_from_context",
          "tags_inferred_as_theory_only"
        ]
      },
      {
        "sem": 3,
        "code": "BME 4452",
        "title": "TISSUE ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction: Basic definition, Structural and organization of tissues: epithelial, connective tissues",
          "Sterilization Process: Introduction, different sterilization methods: physical, chemicals; applications",
          "Morphogenesis, Generation of Tissue in the Embryo: introduction, different germ layers, cardiac cell development, blood vessels development, skin tissue development; development of bone and cartilage, future development",
          "Cellular Signaling: introduction, cellular signaling in skin, bone cartilage biology; understanding and implementing principles of cell signaling in tissue engineering",
          "Stem Cell: introduction, types, self-renewal, differentiation, embryonic stem cell: isolation, properties; adult stem cells: isolation, properties, stem cell niche, future perspective",
          "Cell and Tissue Culture: introduction, cell harvest, selection, expansion, differentiation, co-culture, source, types of tissue culture (animal), cell lines, culture media, maintenance of cell in vitro",
          "Scaffolds: polymer, natural polymer for tissue engineering, degradable materials, various type of scaffold, cell–matrix interaction, ECM",
          "Methods to monitor tissue re-modeling",
          "Engineering tissues (like skin, cartilage, bone)"
        ],
        "references": [
          "Satya Prakash, D.S. Tim, Stem cell bioengineering and tissue engineering microenvironment, World Scientific, 2012",
          "Endarle, Blanchard & Bronzino, Introduction to Biomedical Engineering, Academic press, 1998",
          "C.W. Patrick Jr., A. G. Mikos, L.V. Mcintire, Frontiers in tissue engineering, Pergamon, Elsevier, 1998",
          "C.V. Blitterswijk, Tissue Engineering, Academic Press, 2008",
          "B.O. Palsson and S N Bhatia, Tissue Engineering, Pearson Prentice Hall, 2004",
          "David Williams, Essentials Biomaterials Science, Cambridge University Press, 2014",
          "Julia Polak,(Ed), Advances in Tissue Engineering, Imperial College Press, 2008"
        ],
        "flags": [
          "semester_mismatch (course code BME 4452 suggests 4th semester but department specifies 3rd semester)"
        ]
      },
      {
        "sem": 3,
        "code": "BME 4453",
        "title": "VIRTUAL REALITY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["elective", "theory"],
        "syllabus": [
          "Definition and goals of Extended Reality, historical perspective, different applications of VR (news, sports, entertainment, surgery, training etc.)",
          "Psychology of VR: Place illusion, plausibility illusion, embodiment illusion",
          "Graphics in VR: Transformations, 3D audio, Tracking in VR (Tilting/Yawing/SfM), general outline of content creation in VR",
          "Interaction in VR: Natural Interaction, Magic/Active/Passive Interaction, Teleportation in VR, Virtual Navigation, redirected walking, walk-in-place, Interacting with objects in VR, hyper-natural interaction, evaluation metrics, physics-based interaction, state machines",
          "User interfaces in VR: Abstract Interfaces, Diegetic/Non-diegetic interfaces, gestural interaction, issues in VR interaction",
          "User Interfaces in Unity3D: Unity gesture plugin, Bespoke VR",
          "Virtual Characters in VR, Body Animation in VR, Facial Animation, Social VR"
        ],
        "references": [
          "Grigore C. Burdea, Philippe Coiffet, Virtual Reality Technology, Wiley 2016",
          "Alan Craig, William Sherman and Jeffrey Will, Developing Virtual Reality Applications, Foundations of Effective Design, Morgan Kaufmann, 2009",
          "John Vince, “Virtual Reality Systems “, Pearson Education Asia, 2007"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4311",
        "title": "BIOMEDICAL INSTRUMENTATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Biomedical transducers: Classification and Selection",
          "Pressure Transducers: Resistive, capacitive, Inductive transducers & Piezo-electric, Photoelectric transducers & its types",
          "Thermal transducers & its types",
          "Electrodes & Amplifiers: Principles of working and their characteristics, Half- cell potential, Types of electrodes, Electrode-Electrolyte model, Amplifiers for biomedical instrumentation",
          "Physiological Signals & Measurements: Basics of ECG, EMG, EEG, PCG, blood pressure & blood flow and the instrumentation for measuring these signals",
          "Cardiac Pacemakers: Types of pacemakers, Modes of triggering, Pacemaker power supplies, pacemaker codes",
          "Defibrillators: AC and DC defibrillators, Types of electrodes and their features, cardioverters",
          "Lasers: Basic principles, types of lasers and their medical applications",
          "X-ray systems, Fluoroscopic system, principles of tomography",
          "Electrical Hazards & Safety: Safety code standards, Micro and Macro shock and its physiological effects, Methods of electrical safety"
        ],
        "references": [
          "John G Webster, “Medical Instrumentation Applications and Design”, John Wiley and Sons, New York, 3rd Edition, 2011",
          "R S Khandpur, “Handbook of Biomedical Instrumentation”, McGraw Hill, Delhi, 3rd Edition, 2014",
          "L A Geddes, L E Baker, “Principles of Applied Medical Instrumentation”, Wiley India, New Delhi, 3rd Edition, 2008",
          "Richard Aston, “Principles of biomedical Instrumentation and measurement”, Merrill, New York, 1991",
          "Joseph J Carr, John M Brown, “Introduction to Biomedical Equipment technology”, Prentice Hall, New Jersey, 4th Edition, 2003"
        ],
        "flags": ["semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "BME 4312",
        "title": "BIOMECHANICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Basic terminology",
          "Anatomical movement descriptors",
          "Skeletal considerations for movement: Composition & Structure of bone",
          "mechanical properties of bone",
          "bone fracture & failure mechanics",
          "Muscular considerations for movement: Skeletal muscle tissue properties",
          "function and structure",
          "Force generation in the muscle",
          "Role of muscle",
          "Force-velocity relationships in skeletal muscle",
          "Joint flexibility",
          "Fundamental concepts of gait",
          "Linear Kinematics: kinematic parameters",
          "projectile motion",
          "linear kinematics of walking and running",
          "Angular Kinematics: types of Angles",
          "lower extremity joint angles",
          "angular motion relationships",
          "relationship between linear and angular motion",
          "angle-angle diagrams",
          "Linear Kinetics: laws of motion",
          "types of forces",
          "representation of forces acting on a system",
          "Angular Kinetics: Newton's laws of motion (angular analogs)",
          "center of mass calculation",
          "rotation and leverage",
          "pulley system",
          "analysis using Newton's laws of motion",
          "Application of Aerodynamics in Sports: aerodynamic drag force - effects of drag on the body and objects in sport- activities",
          "aerodynamic lift force - lift force acting on shapes and surfaces",
          "effects of lift on projected objects",
          "the Magnus effect",
          "Application of Hydrodynamics in Aquatics: buoyancy and floatation",
          "floating ability of the human body",
          "types of floaters",
          "different floating positions of the human body",
          "resistive & propulsive forces in swimming skills",
          "Swimming efficiency and speed"
        ],
        "references": [
          "Joseph Hamill and Kathleen M. Knutzen, Biomechanical Basis of Human Movement, Lippincott Williams & Wilkins, Fourth Edition, 2014, Philadelphia, USA.",
          "Susan J. Hall, Basic Biomechanics, McGraw-Hill International Editions, Seventh Edition, 2014, Singapore.",
          "Peter M. McGinnis, Biomechanics of Sport and Exercise, Human Kinetics, Third Edition, 2013, USA.",
          "P. Grimshaw and A. Burden, Sport & Exercise Biomechanics, Taylor & Francis Group, First Edition, 2007, UK.",
          "Ellen Kreighbaum, Katharine M Barthels, Biomechanics-A Qualitative Approach for studying Human Movement, Allyn and Bacon Publishers, Fourth Edition, 1995, USA."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4313",
        "title": "REHABILITATION ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to rehabilitation engineering and assistive technology: principles, engineering concepts in sensory rehabilitation, motor rehabilitation and communication disorders",
          "Orthopedic prosthetics & orthosis in rehabilitation technology: fundamentals of design of upper and lower extremity prosthetic and orthotic devices, applications",
          "Mobility aids: mobility aids for the blind, discussion of design and function of robotic aids, wheel chairs",
          "Sensory augmentation & substitution: visual, auditory and tactile sensory augmentation & substitution",
          "Conversion aids for non-vocal physically impaired persons: characteristics and design considerations for conversion aids, biofeedback in communicative disorders, artificial larynx",
          "Principles and applications of electrical stimulation: artificial electrical stimulation of nerves and muscles, applications",
          "Conceptual frameworks, education and quality assurance"
        ],
        "references": [
          "Joseph D. Bronzino and Donald R. Peterson, “The Biomedical Engineering Handbook”, volume II, CRC press, fourth edition, 2015",
          "John G. Webster, Albert M. Cook, Willis J. Tompkins, Gregg C. Vanderheiden, “Electronic devices for Rehabilitation”, John Wiley & Sons Inc, second edition, 1989",
          "John Enderle and Joseph Bronzino, “Introduction to Biomedical Engineering”, academic press, third edition, 2011",
          "Rory A. Cooper, “An introduction to Rehabilitation Engineering”, Taylor and Francis Inc, first edition, 2007"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4314",
        "title": "INTRODUCTION OF MATERIALS IN MEDICINE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Structure, properties and performance of materials: nature of materials, molecular assembly; bulk properties; surface properties; elasticity and viscoelasticity",
          "Classes of materials used in medicine: versatility of materials, Polymers –synthetic, natural, Metal, Ceramics, Composites, Hydrogels, medical fibers, porous materials, biomimetic materials",
          "Characterization of materials-contact angle, spectroscopy",
          "Background concept of biological system: biological environment, biology in medicine, cells and surfaces, signaling pathways",
          "Host reaction to Materials: biological responses to materials, inflammation, foreign body response, device related infection",
          "Biological testing of Materials: testing materials, biocompatibility, blood-material interaction",
          "Application of materials in Medicine and functional tissue engineering: orthopedic, dental, ophthalmic, burn dressing, sutures, implants and inserts, tissue engineering templates"
        ],
        "references": [
          "Buddy D Ratner & Allen S Hoffman, Biomaterials Science, 3rd Edition, 2012, Academic Press, Canada",
          "David Williams, Essentials Biomaterials Science, 2014, Cambridge university press. ISBN:978052189908-6",
          "Mark Meyers and Krishnan Chawla, Mechanical Behaviour of Materials, 2nd Ed, Cambridge University Press, 2009 ISBN: 978-0-521-18620-9",
          "Lisa A. Pruitt and Ayyana M. Chakravartula, Mechanics of Biomaterials Fundamental Principles for Implant Design, Cambridge university Press 2011",
          "M. Jaffe, W. Hammond, P.Tolias and T. Arinzeh, Characterization of biomaterials, Woodhead Publishing Limited, 2013"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BME 4315",
        "title": "INTRODUCTION TO NANOMATERIALS & CHARACTERIZATION TECHNIQUES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction nanotechnology: Nanomaterials - classifications, synthesis methods, surface functionalization of nanoparticles, nanocomposites",
          "Properties of nanomaterials: mechanical properties, optical properties, magnetic properties",
          "Characterization tools for nanomaterials and nanosystems - structural and chemical characterization techniques",
          "Physical and chemical characterization of Nanomaterials: Transmission electron microscope (TEM), scanning electron microscope (SEM), scanning tunneling microscope (STM), atomic force microscope (AFM)",
          "X-ray diffraction (XRD), Fourier-transform infrared spectroscopy (FT-IR), dynamic light scattering (DLS), Mass spectroscopy, chromatography",
          "Thermal characterization of nanomaterials: Thermogravimetric analysis (TGA), differential thermal analysis (DTA), differential scanning calorimetry (DSC)",
          "Surface Characterization of nanomaterials: X-ray photoelectron spectroscopy (XPS), auger electron spectroscopy (AES), secondary ion mass spectroscopy (SIMS), Raman spectroscopy, electron energy loss spectroscopy (EELS), ultraviolet spectroscopy"
        ],
        "references": [
          "Guozhong Cao, Nanostructures and nanomaterials Synthesis, Imperial Press 2011",
          "G.A. Ozin and A.C. Arsenault, Nanochemistry: A chemical approach to Nanomaterials, Royal Society of Chemistry, 2005",
          "T. Pradeep, A Textbook of Nanoscience and Nanotechnology, McGraw Hill Education, 1st edition, 2017",
          "P. M. Ajayan, L. S. Schadler, P. V. Braun, Nanocomposite Science and Technology, Wiley-VCH; 1 edition"
        ],
        "flags": [
          "course_code_suggests_higher_semester_than_department_context",
          "possible_typos_in_title_or_content"
        ]
      },
      {
        "sem": 3,
        "code": "BME 4316",
        "title": "NANOMEDICINE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["theory"],
        "syllabus": [
          "fundamental concepts in nanotechnology",
          "fundamental concepts in cell, molecular and tissue biology",
          "nanoparticles and their synthesis",
          "nanotechnology platforms",
          "characterization of nanomaterials",
          "Nano pharmaceuticals",
          "Nano-biosensors and diagnostics",
          "role of nanotechnology in biological therapies",
          "Nano devices for medicine and surgery",
          "application in orthopaedics",
          "cardiology",
          "microbiology",
          "ophthalmology",
          "imaging",
          "role of nanotechnology in regenerative medicine and tissue engineering",
          "Nano-toxicity",
          "case studies in Nanomedicine"
        ],
        "references": [
          "Jain KK, Jain KK. The handbook of nanomedicine. NJ: Humana Press; 2008.",
          "Tibbals HF. Medical nanotechnology and nanomedicine. Crc Press; 2017.",
          "Torchilin V, Amiji MM, editors. Handbook of materials for Nano medicine. Pan Stanford Publishing; 2011.",
          "Prasad PN. Introduction to nanomedicine and Nano bioengineering. John Wiley & Sons; 2012 Jun 19."
        ],
        "flags": [
          "tags_inferred_without_explicit_classification",
          "potential_semester_mismatch_department_context_vs_course_level"
        ]
      },
      {
        "sem": 3,
        "code": "BIO 4401",
        "title": "Bioremediation",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4402",
        "title": "Biological Treatment of Wastewater",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4403",
        "title": "Biofuels Engineering",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4404",
        "title": "Solid Waste Management",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": [
          "missing_credits",
          "missing_syllabus",
          "missing_references",
          "ambiguous_title_or_structure"
        ]
      },
      {
        "sem": 3,
        "code": "BIO 4405",
        "title": "Biomaterials & Drug Delivery Engineering Principles",
        "credits": {
          "l": null,
          "t": null,
          "p": null,
          "c": null
        },
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": [
          "missing_credits",
          "missing_syllabus",
          "missing_references",
          "structure_mismatch"
        ]
      },
      {
        "sem": 3,
        "code": "BIO 4406",
        "title": "Biopharmaceutical Engineering",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4407",
        "title": "Biological Therapeutics",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4408",
        "title": "Molecular Modeling & Drug Design",
        "credits": null,
        "tags": ["elective"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4441",
        "title": "BIOPROCESS CONTROL",
        "credits": null,
        "tags": ["core", "theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4442",
        "title": "BIOPROCESS EQUIPMENT DESIGN",
        "credits": {
          "l": null,
          "t": null,
          "p": null,
          "c": null
        },
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4443",
        "title": "BIOPROCESS MODELLING AND SIMULATION IN BIOTECHNOLOGY",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": [
          "missing_credits",
          "missing_syllabus",
          "missing_references",
          "structure_mismatch"
        ]
      },
      {
        "sem": 3,
        "code": "BIO 4444",
        "title": "Biostatics and Design of Experiments",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4445",
        "title": "Computational Biology",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4446",
        "title": "Food process Engineering and Technology",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4447",
        "title": "Genomics and Proteomics",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4448",
        "title": "Health Diagnostics",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4449",
        "title": "Metabolic Engineering",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4450",
        "title": "Protein Engineering",
        "credits": null,
        "tags": ["elective"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4311",
        "title": "Introduction to Bioinformatics",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4312",
        "title": "Body, Mind, and Medicine",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": ["missing_credits", "missing_syllabus", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4313",
        "title": "Bioinspired Design for Engineers",
        "credits": null,
        "tags": ["theory"],
        "syllabus": [],
        "references": [],
        "flags": [
          "missing_credits",
          "missing_syllabus",
          "missing_references",
          "structure_mismatch"
        ]
      },
      {
        "sem": 3,
        "code": "MAT 2124",
        "title": "ENGINEERING MATHEMATICS III",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Periodic Functions, odd and even functions, Euler's formulae",
          "Half range expansions, Harmonic analysis",
          "Fourier integrals & transforms, Parseval's identity",
          "Functions of complex variable",
          "Analytic function, C-R equations, differentiation, Integration of complex function, Cauchy's integral formula",
          "Taylor's and Laurent Series, Singular points, Residues, Cauchy's residue theorem",
          "Conformal mappings, bilinear transformations",
          "Gradient, divergence and curl, their physical meaning and vector identities",
          "Line, surface and volume integrals",
          "Green's theorem, divergence and Stokes' theorem, applications",
          "Formation, solutions of equations involving derivatives with respect to one variable only",
          "Solutions by indicated transformations and separation of Variables",
          "Derivation of one dimensional wave equation (vibrating string) and its solution by using the method of separation of Variables",
          "D'Alembert's solution of wave equation",
          "Derivation of one dimensional heat equation using Gauss divergence theorem and solution of one dimensional heat equation",
          "Solution by separation of variables"
        ],
        "references": [
          "Eewin Kreyszig, Advanced Engineering Mathematics, (7e),1993, John Wiley & Sons, Inc.",
          "Murray R.Spiegel : Vector Analysis, (2e), 2009, Schaum Publishing Co.",
          "Grewal. B.S: Higher Engg. Mathematics, (43e), 2014, Khanna Publishers.",
          "Ramana B.V., Engineering Mathematics, (2e), 2007, Tata McGraw Hill Publishing Company limited."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2121",
        "title": "BIOCHEMISTRY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Biochemistry, Scope, and objectives",
          "Carbohydrates: Classification, general properties in reference to glucose, cyclic structure mutarotation, biological importance of monosaccharides, disaccharides and polysaccharides, interconversion of sugars",
          "Lipids: classification of lipids, simple lipids, compound lipids, derived lipids, miscellaneous - with examples. Types of fatty acids. Biosynthesis and degradation of fatty acids",
          "Proteins: classification, structure, and properties of amino acids, structure of proteins, secondary, tertiary, and quaternary structure, nature and function of enzymes, Km and Vmax. Interconversion of amino acids",
          "Nucleic acids: Structure of Nucleic acids – DNA, RNA, biosynthesis and degradation of purines and pyrimidines, inborn errors of metabolism and associated disorders"
        ],
        "references": [
          "Albert L Lehninger. Principles of Biochemistry. 8th edition W.H. Freeman, 2021",
          "Donald Voet. Biochemistry. John Wiley & Sons, 5th edition, 2018",
          "Stryer. Biochemistry. 9th edition, W.H.Freeman & Co Ltd, 2019"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2122",
        "title": "MICROBIOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Microbiology, Scope and objectives",
          "Microbial diversity and taxonomy: Prokaryotes and Eukaryotes, Types of Microorganisms, Bacteria, Viruses, Fungi, Protozoans & Helminthes",
          "Microbiological Techniques: Study of microscopes, Sterilization Techniques, Structure",
          "Functions and Replication of Microorganisms: Bacteria, Viruses, Fungi, Algae, Protozoans",
          "Medical Microbiology: Common diseases caused by microbes",
          "Microbial insecticides, enzymes: Bacillus thuringinesis, Sphaericus, Popilliae, Baculoviruses",
          "Food industry: Microbial spoilage of food and its control; food preservatives"
        ],
        "references": [
          "Michael Pelczar, Jr. Microbiology, 5th Edition, McGraw Hill Education, 2001",
          "Dorothy Wood, Joanne Willey, Kathleen Sandman. Prescott's Microbiology, 12th Edition, McGraw Hill Education, 2022"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2123",
        "title": "CELL AND MOLECULAR BIOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to cells: Cell organelles, Membrane structure, Visualizing cells by fluorescence microscopy",
          "Cytoskeleton: Structure of cytoskeletal filaments, Assembly of tubulin and actin subunits to create polar filaments",
          "Regulation of cytoskeletal filaments",
          "Molecular motors",
          "Cell behavior in relation to cytoskeleton",
          "Central Dogma",
          "Control of gene expression: DNA-binding motifs of gene regulatory proteins",
          "Molecular genetic mechanisms that create specialized cell types",
          "Mechanisms and principles of cell communication",
          "Cell cycle and its regulation: Brief introduction to cell cycle",
          "Cell cycle control system",
          "Apoptosis",
          "Cancer",
          "Specialized tissues, stem cells and tissue renewal: Epidermis and its renewal by stem cells",
          "Blood vessels, lymphatics and endothelial cells",
          "Renewal by multipotent stem cells",
          "Blood cell formation",
          "Genesis, modulation, and regeneration of skeletal muscle"
        ],
        "references": [
          "Bruce Alberts, Alexander Johnson, Julian Lewis, Martin Raff, Keith Roberts, Peter Walter (Eds). Molecular Biology of the cell. (5e), Garland Science, 2008",
          "Harvey Lodish, Arnold Ber, Chris A. Kaiser, Monty Krieger, Anthony Bretscher, Hidde Ploegh, Angelika Amon, Kelsey C. Martin. Molecular cell biology. (8e), Scientific American Books, W. H. Freeman, New York, 2016"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2124",
        "title": "FLUID FLOW OPERATIONS",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Review of fluid statics, fluid dynamics",
          "Types of flow; Newtonian and non-Newtonian fluids",
          "Shear stress; Viscosity; Classification of fluids",
          "Basic equations of fluid flow – continuity equation, Bernoulli's equation",
          "Flow rate and velocity measurements- Orifice, Venturimeter and Pitot tube",
          "Reynolds number and friction factor, Hagen Poiseuille equation",
          "Flow through a bed of solids – Ergun, Kozeny Carmen and Blake Plumer equation",
          "Agitation and mixing of liquids"
        ],
        "references": [
          "McCabe & Smith. 2017. Unit Operations of Chemical Engineering. 7th Edition. McGraw Hill",
          "Yunus A Cengel, John M Cimbala. 2018. Fluid Mechanics- Fundamentals and applications, 4th Edition. McGraw Hill.",
          "Christie John Geankoplis. 2015. Transport Processes and Separation Process Principles (Includes Unit Operations) 4th Edition. Pearson.",
          "Badger and Banchero. 1995. Introduction to Chemical engineering. McGraw Hill."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2125",
        "title": "BIOPROCESS CALCULATIONS",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Bioprocess Development: An Interdisciplinary Challenge",
          "Biotechnology and Bioprocess Engineering",
          "Introduction to Engineering Calculations",
          "Physical Variables, Dimensions and Units",
          "Unit conversion",
          "Presentation and Analysis of Data",
          "plotting graphs using excel",
          "Steady state material balances",
          "Law of Conservation of Mass",
          "Material Balances with Recycle, By-Pass and Purge Streams",
          "Stoichiometry of microbial growth and product formation",
          "Basic Energy Concepts",
          "Intensive and Extensive Properties",
          "General Energy-Balance Equations",
          "Procedure For Energy-Balance Calculations Without Reaction",
          "Energy-Balance Equation For Cell Culture"
        ],
        "references": [
          "Pauline Doran. 1995. Bioprocess Engineering Principles. Academic Press.",
          "David M. Himmelblau 1989 Basic Principles and Calculations in Chemical Engineering. Prentice Hall of India (P) Ltd."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2141",
        "title": "BIOCHEMISTRY LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["lab"],
        "syllabus": [
          "Qualitative and quantitative analysis of biomolecules (carbohydrates, proteins, lipids, nucleic acids)",
          "Estimation of carbohydrates by Osazone test",
          "Reducing sugars analysis using Dinitrosalicylic acid (DNS) method",
          "Glucose estimation by DNS method and enzymatic (GOD/POD) method",
          "Starch estimation by Iodine method",
          "Specific activity of amylase",
          "Protein estimation by Lowry's and Bradford's methods",
          "Amino acids estimation by Sorenson's titrimetric method",
          "Cholesterol estimation by Zak's method",
          "Spectrophotometric detection of DNA/RNA"
        ],
        "references": [
          "David T Plummer Introduction to Practical Biochemistry. Mc Graw Hill Publication 2017",
          "Keith Wilson and Walker Principles and Techniques of Practical Biochemistry. Cambridge University Press 2000"
        ],
        "flags": ["structure_mismatch"]
      },
      {
        "sem": 4,
        "code": "BIO 2142",
        "title": "MICROBIOLOGY LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 6,
          "c": 2
        },
        "tags": ["lab", "core"],
        "syllabus": [
          "Preparation of broth and agar media for the growth of bacterial species",
          "Pure culture techniques (streak, pour and spread) to isolate and sub-culture a specimen obtained from natural sources",
          "Staining and viewing different types of microbes using a compound microscope",
          "Performance of biochemical tests to identify and differentiate between certain microbial classes",
          "Biochemical test to check the extent of contamination of a milk sample"
        ],
        "references": [
          "James G. Cappuccino, Chad Welsh, Microbiology A Laboratory Manual, 11th Global Edition, Pearson, 2017",
          "Ronald M. Atlas. Handbook of Microbiological Media, 4th Edition, CRC Press, 2010"
        ],
        "flags": ["department_semester_mismatch"]
      },
      {
        "sem": 3,
        "code": "MAT 2224",
        "title": "ENGINEERING MATHEMATICS IV",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Formation of Linear Programming problem, Graphical method, Simplex method, Penalty cost and two-phase methods",
          "Finite sample spaces, conditional probability and independence, Bayes' theorem",
          "One dimensional random variable, mean, variance, Chebyshev's inequality",
          "Two and higher dimensional random variables, covariance, correlation coefficient, regression, least squares principles of curve fitting",
          "Binomial, Poisson, uniform, normal, gamma, Chi-square and exponential",
          "Finite difference expressions for first and second order derivatives (ordinary and partial). Solution of BVP's in ODE",
          "Classification of second order linear partial differential equations",
          "Numerical solutions of two-dimensional Laplace and Poisson equations by standard five-point formula",
          "Solution of one-dimensional heat and wave equations by explicit methods. Crank-Nicolson method",
          "Finite element method, Introduction, simple applications",
          "Difference equations representing physical systems, the z transforms, properties of z transforms, initial and final value theorems, solution of difference equations by the method of z transforms, convolution theorem"
        ],
        "references": [
          "Eewin Kreyszig, Advanced Engineering Mathematics, (7e), 1993, John Wiley & Sons, Inc.",
          "Meyer P.L., Introduction to probability and Statistical applications, (2e), 1970, American Publishing Co.",
          "Hamdy A Taha - Operation research, (7e), 2002, Pearson Education, Inc.",
          "Grewal B.S - Higher Engineering Mathematics, (43e), 2014, Khanna Publishers",
          "Sastry S.S - Introductory methods for Numerical Analysis, (5e), 2012, PHI Learning Private Limited"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2221",
        "title": "CHEMICAL AND BIOCHEMICAL ENGINEERING THERMODYNAMICS",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction – Scope and definition",
          "First law of Thermodynamics, Joule and Joule-Thomson Coefficient",
          "Definition of enthalpy, different thermodynamic processes",
          "Second law of thermodynamics – Statements of second law, Carnot's engine, entropy, entropy change of ideal gas",
          "Thermodynamic properties of fluid – Property relations for homogenous phases",
          "Solution thermodynamics – Fundamental property relation, Chemical potential and Phase Equilibria, Partial molal properties",
          "Ideal gas mixtures, Fugacity, Activity, residual and excess properties",
          "Single component two phase system, two component phase equilibrium",
          "Chemical reaction equilibrium – Reaction Co-ordinate, Standard Gibb's Energy change and Equilibrium constant",
          "Colligative Properties of solutions: freezing point depression, boiling point elevation, Vapor pressure lowering, osmotic pressure",
          "Thermodynamics of Biochemical reactions – Free energy calculations"
        ],
        "references": [
          "J. M. Smith, H.C. Van Ness and M.M. Abbott. Introduction to Chemical Engineering Thermodynamics, McGraw Hill International (7e) 2010",
          "Silbey, Alberty, Bawendi. Physical Chemistry, Wiley India (4e), 2004",
          "Donald T. Haynie. Biological Thermodynamics, Cambridge University Press, 2001"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2222",
        "title": "DOWNSTREAM PROCESSES-I",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Fundamentals of downstream processing",
          "High-value & Low-value bioproducts",
          "Cell Disruption & Types",
          "Flocculation",
          "Sedimentation",
          "Centrifugation & Types",
          "Filtration",
          "Membrane-based separation",
          "Ultrafiltration",
          "Reverse Osmosis",
          "Precipitation with Salts",
          "Organic solvents",
          "Fundamentals of Extraction",
          "Types",
          "Reverse Micellar",
          "Super-critical fluid Extraction"
        ],
        "references": [
          "B. Sivasankar. Bioseperations: Principles and Techniques. PHI Learning Pvt. Ltd., 2006",
          "Raja Ghosh, Principles of Bioseparations Engineering. World Scientific Publishing Company., 2006.",
          "Belter P.A., Cussler E. and Wei Shan Hu. Bioseparation – Downstream processing for Biotechnology. Wiley Interscience Pub, 1988."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2223",
        "title": "GENETIC ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Structure and Organization of Nucleic Acids",
          "DNA Repair, Mutagenesis and Mutations",
          "Basics of Recombinant DNA Technology",
          "Nucleic Acid Hybridization and DNA Libraries",
          "Molecular Analysis and Amplification Methods",
          "Applications of Recombinant DNA Technology"
        ],
        "references": [
          "David Friefelder. Molecular Biology. Jones and Bartlett Publishers Inc., 1987",
          "J ocelyn E. Krebs, Elliott S. Goldstein and Stephen T. Kilpatrick. Lewin's Genes XII. Jones and Bartlett Publishers Inc., 2017",
          "James D. Watson, Michael Gilman, Jan A. Witkowski, Mark Zoller. Recombinant DNA. W. H. Freeman, 1992",
          "Sandy B. Primrose, Richard M. Twyman and Robert W. Old. Principles of Gene Manipulation. Wiley-Blackwell Publishers, 2002",
          "Desmond S.T. Nicholl. Introduction to Genetic Engineering. Cambridge University Press, 2012",
          "T. A. Brown. Gene Cloning and DNA Analysis: An Introduction. Wiley-Blackwell, 2010"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2224",
        "title": "PRINCIPLES OF HEAT AND MASS TRANSFER",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Various modes of heat transfer",
          "Conduction – Fourier's law",
          "Convection – Natural and forced convection Co-current and countercurrent types of flow",
          "LMTD, overall coefficient determination of film coefficients",
          "Heat transfer with phase change",
          "Radiation",
          "Diffusion, Mass transfer and its significance",
          "Fick's law of diffusion and Concept of mass transfer coefficients",
          "two film theory and mass transfer resistance",
          "dimensionless numbers",
          "Stagewise contacting of phases- single, cross current and countercurrent",
          "Gas absorption",
          "Vapor Liquid Equilibrium (VLE), Flash distillation"
        ],
        "references": [
          "Pauline M. Doran, “Bioprocess Engineering Principles”, Academic Press, 1995",
          "Robert E. Treybal, “Mass Transfer Operations”, McGraw-Hill, 1980",
          "Mc Cabe, Smith and Peter Harriott, Unit Operation of Chemical Engineering, McGraw Hill Publisher, 7th Edition, 2017"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2225",
        "title": "IMMUNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Immunotechnology, Scope and objectives",
          "The Immune System Innate: Introduction to Innate Lymphatic circulation",
          "Inflammation",
          "Complement System",
          "The Immune System Adaptive: Adaptive Antigen presenting cells",
          "Langerhans cells- their origin",
          "B-cell Immunity- classes and subclasses",
          "Genetic control of antibody types",
          "Immune diseases and detection methods",
          "Autoimmunity",
          "Infections",
          "FACS",
          "western blotting",
          "Immunofluorescence",
          "RIA",
          "ELISA",
          "Chemiluminescence"
        ],
        "references": [
          "Charles A. Janeway, Paul Travers, Mark Walport, Mark Shlomchik. Immunobiology: The Immune System in Health & Disease. Sixth Edition, 2005",
          "Roitt I. Essential Immunology. Blackwell Scientific Publications, 1991",
          "Richard Goldsby, Thomas J. Kindt, Barbara A. Osborne. Kuby Immunology. 2006"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 2241",
        "title": "UNIT OPERATIONS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 6,
          "c": 2
        },
        "tags": ["core", "lab"],
        "syllabus": [
          "Fluid flow experiments based on flow measurement, flow dynamics in pipes and fittings, and particle dynamics under fluid flow",
          "Heat transfer experiments to estimate heat transfer coefficients and thermal conductivity of metals and insulators"
        ],
        "references": [
          "Pauline M. Doran. Bioprocess Engineering Principles, Academic Press, 1995",
          "McCabe & Smith. Unit Operations of Chemical Engineering. McGraw Hill, 1993"
        ],
        "flags": []
      },
      {
        "sem": 5,
        "code": "BIO 2242",
        "title": "MOLECULAR BIOLOGY AND GENETIC ENGINEERING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 6,
          "c": 2
        },
        "tags": ["core", "lab"],
        "syllabus": [],
        "references": [
          "Sandy B. Primrose, Richard M. Twyman and Robert W. Old. Principles of Gene Manipulation, Wiley-Blackwell Publishers, 2002",
          "Benjamin Lewin. Genes VII. Oxford University Press, 2003"
        ],
        "flags": ["semester_mismatch", "credits_mismatch", "missing_syllabus"]
      },
      {
        "sem": 3,
        "code": "HUM 3021",
        "title": "ENGINEERING ECONOMICS AND FINANCIAL MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Time value of money, Interest factors for discrete compounding, Nominal & effective interest rates, Present and future worth of Single, Uniform, and Gradient cash flow. Related problems and case studies",
          "Bases for comparison of alternatives, Present worth amount, Capitalized equivalent amount, Annual equivalent amount, Future worth amount, Capital recovery with return, Rate of return method, Incremental approach for economic analysis of alternatives, Replacement analysis",
          "Break even analysis for single product and multi product firms, Break even analysis for evaluation of investment alternatives",
          "Physical & functional depreciation, Straight line depreciation, declining and double declining balance method of depreciation, Sum-of-the-Years Digits, Sinking Fund and Service Output Methods, Case Study",
          "Balance sheet and profit & loss statement. Meaning & Contents. Ratio analysis, financial ratios such as liquidity ratios, Leverage ratios, Turn over ratios, and profitability ratios, Drawbacks",
          "Safety and Risk, Assessment of Risk and safety, Case study, Risk Benefit Analysis and Reducing Risk"
        ],
        "references": [
          "Chan S. Park, \"Contemporary Engineering Economics\", Pearson Prentice Hall (2007)",
          "Thuesen G. J, “Engineering Economics”, Prentice Hall of India, New Delhi (2005)",
          "Blank Leland T. and Tarquin Anthony J., “Engineering Economy”, McGraw Hill, Delhi (2002)",
          "Prasanna Chandra, “Fundamentals of Financial Management”, Tata McGraw Hill, Delhi (2006)"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 3121",
        "title": "BIOINFORMATICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Bioinformatics overview",
          "Computational biology and bioinformatics",
          "The digital code of life",
          "Introduction to biological sequence databases",
          "The evolutionary basis of sequence alignment",
          "Detecting ORFs",
          "protein Vs nucletotide sequence alignment",
          "Global and Local alignments",
          "Substitution Matrices",
          "Gaps and Gap penalties",
          "Dynamic programming algorithm",
          "Statistical and Biological significance",
          "Introduction to computational biology",
          "Multiple Sequence Alignment",
          "sequence assembly: Overlap-Layout-Consensus approach",
          "Repetitive elements, assembly issues",
          "PCR Primer Design",
          "Gene finding",
          "Graph theory; chemical graphs and amino acid comparisons",
          "Hierarchial levels of macromolecules",
          "Special structures of nucleic acids, Motifs and domains",
          "symmetry of proteins",
          "HP-lattice model",
          "Secondary structure",
          "Molecular visualization",
          "Protein structure-function relationships",
          "Protein modeling",
          "Structure validation",
          "Evolution; Morphology based cladogram",
          "Building Phylogenetic Trees",
          "Phylogenetic Networks",
          "Bioinformatics: future aspects"
        ],
        "references": [
          "David W Mount. 2004. BIOINFORMATICS: Sequence and Genome Analysis. Cold Spring Harbor Laboratory Press",
          "Andreas D Baxevanis, Gary D. Bader, David S. Wishart. 4th Edn, 2020. BIOINFORMATICS. Wiley Interscience."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 3122",
        "title": "BIOPROCESS ENGINEERING",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Enzymes and Enzyme catalyzed reactions: Nature and function of enzymes, Michaelis-Menten Equation – derivations, types of enzyme inhibition, kinetics",
          "Media Design and Sterilization: Fermentation processes, Medium requirements for fermentation processes - examples of simple and complex media, Batch and continuous heat sterilization",
          "Transport Phenomena in Bioreactors: Immobilization methods, Immobilized enzyme/cell kinetics: effectiveness factor derivations; Oxygen transfer in submerged fermentation processes: OTR, OUR calculations, kLa estimations",
          "Kinetics of Microbial Growth and Product Formation: Microbial cell kinetics, Monod model; Growth associated and non-growth associated product formation kinetics"
        ],
        "references": [
          "Michael L Shuler and Fikret Kargi. 2008. Bioprocess Engineering: Basic Concepts. Prentice-Hall of India Pvt Ltd.",
          "Pauline M. Doran. 2012. Bioprocess Engineering Principles. 2nd Edition. Academic Press.",
          "PF Stanbury, S. Hall, A. Whitaker. 2017. Principles of Fermentation Technology. 3rd Edition, Elsevier Science Publishers.",
          "Levenspiel, O. 2006. Chemical Reaction Engineering. 3rd Edition. John Wiley."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 3123",
        "title": "BIOREACTION ENGINEERING",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Reaction Kinetics: Rate equation, elementary, non-elementary reactions and kinetic modeling, Analysis of experimental batch reactor data- integral and differential analysis",
          "Ideal Reactors: Design for homogeneous reaction system-batch, stirred tank and plug flow reactors, Multiple reactor system-size comparison, recycle reactor",
          "Bioreactor Design and Analysis: Batch reactor performance with Monod cell growth kinetics, Chemostat performance analysis with Monod kinetics, Fed-batch reactor",
          "Non-ideal reactors: Residence time distribution (RTD), E & F-curves, RTD for ideal CSTR and PFR, Macro and Micro fluids, Conversion in non-ideal flow reactors"
        ],
        "references": [
          "Octave Levenspiel. Chemical Reaction Engineering. John Wiley & Sons, 3rd edition,2003",
          "Harvey W.Blanch and Douglas S. Clark. Biochemical Engineering CRC Press, 1997",
          "Michael L Shuler and Fikret Kargi. Bioprocess Engineering: Basic Concepts. Prentice-Hall of India Pvt Ltd.2008"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 3124",
        "title": "DOWNSTREAM PROCESSING-II",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Theories of adsorption – Adsorption isotherms and calculations, and models, adsorption in fixed beds, Pressure Swing Adsorption (PSA)",
          "Chromatography – principles of chromatographic separation and Plate theory, HPLC and GC, Various types of Chromatographic practices, Retention time, Capacity, band broadening, Size exclusion, Ion Exchange and Affinity chromatography",
          "Electrophoresis",
          "Crystallization, Supersaturation, Yield Calculation, Meir's and Oswald's Theorems",
          "Drying-theory, Equilibrium and batch drying curve, calculations"
        ],
        "references": [
          "Roger Harrison, Paul Todd, Scott Rudge and Demetri Petrides, Bioseparations Science and Engineering, Oxford University Press, 87 2nd Edition, 2003",
          "Belter P.A., Cussler E. and Wei Shan Hu. Bioseparation – Downstream processing for biotechnology, Wiley Interscience Pub, 1988.",
          "Asenjo J. and Dekker M, Separation Processes in Biotechnology, CRC Press, 2020.",
          "McCabe & Smith, Unit Operations of Chemical Engineering, McGraw Hill Inc, 7th Edition , 2017",
          "R.E. Treybal, Mass transfer, McGraw Hill, 1981"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 3141",
        "title": "BIOINFORMATICS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["lab"],
        "syllabus": [
          "sequence retrieval",
          "alignment and analysis (similarity search including pairwise and multiple alignment)",
          "basics of PERL programming",
          "primer design",
          "molecular phylogeny with algorithms (NJ, UPGMA, FM & ME)",
          "secondary structure prediction",
          "structure visualization and analysis",
          "structure alignments to explore homology and distant relationships",
          "protein homology-based modeling",
          "structure validations"
        ],
        "references": [
          "David W Mount. 2004. BIOINFORMATICS: Sequence and Genome Analysis. Cold Spring Harbor Laboratory Press",
          "Andreas D Baxevanis, Gary D. Bader, David S. Wishart. 4th Edn, 2020. BIOINFORMATICS. Wiley Interscience"
        ],
        "flags": ["credits_mismatch"]
      },
      {
        "sem": 6,
        "code": "BIO 3142",
        "title": "DOWNSTREAM PROCESSING AND BIOPROCESS ENGINEERING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 6,
          "c": 2
        },
        "tags": ["lab"],
        "syllabus": [
          "aqueous two phase based separation",
          "extraction of intracellular proteins",
          "precipitation of proteins",
          "ultrafiltration",
          "separation of solids from slurry using leaf filter and sedimentation",
          "estimation of enzyme kinetics, optimum temperature, pH and evaluation of the type of inhibition during enzyme catalyzed reactions"
        ],
        "references": [
          "Cussler, E. L., et al. Bioseparations : downstream processing for biotechnology. United Kingdom, Wiley, 1988.",
          "Asenjo, Juan A.. Separation Processes in Biotechnology. United States, CRC Press, 2020.",
          "Michael L Shuler and FikretKargi. Bioprocess Engineering: Basic Concepts. Prentice-Hall of India Pvt Ltd 2008."
        ],
        "flags": ["semester_mismatch", "credits_mismatch"]
      },
      {
        "sem": 3,
        "code": "HUM 3022",
        "title": "ESSENTIALS OF MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Definition of management and systems approach, Nature & scope",
          "The Functions of managers, Principles of Management",
          "Planning: Types of plans, steps in planning, Process of MBO, how to set objectives, strategies, policies and planning premises, Strategic planning process and tools",
          "Nature and purpose of organizing, Span of management, factors determining the span, Basic departmentation, Line and staff concepts, Functional authority, Art of delegation, Decentralization of authority",
          "HR theories of planning, Recruitment, Development and training",
          "Theories of motivation, Special motivational techniques",
          "Leadership – leadership behavior & styles, Managerial grid",
          "Basic Control Process, Critical Control Points & Standards, Budgets, Non-budgetary control devices, Profit and Loss control, Control through ROI, Direct, Preventive control",
          "PROFESSIONAL ETHICS: Senses of Engineering Ethics, Variety of moral issues, Types of inquiry, Moral dilemmas, Moral Autonomy, Kohlberg's theory, Gilligan's theory, Consensus and Controversy, Models of professional roles, Theories about right action, Self-interest, Customs and Religion, Uses of Ethical Theories",
          "GLOBAL ISSUES: Managerial practices in Japan and USA & application of Theory Z, The nature and purpose of international business & multinational corporations, unified global theory of management, Entrepreneurship and writing business plans, Multinational Corporations, Environmental Ethics, Computer Ethics, Weapons Development, Engineers as Managers, Consulting Engineers, Engineers as Expert Witnesses and Advisers, Moral Leadership, Code of Conduct, Corporate Social Responsibility"
        ],
        "references": [
          "Harold Koontz & Heinz Weihrich, Essentials of Management, McGraw Hill, New Delhi(2020)",
          "Peter Drucker, The practice of management, Harper and Row, New York(2004)",
          "Vasant Desai, Dynamics of entrepreneurial development & management, Himalaya Publishing House(2007)",
          "Poornima M Charantimath, Entrepreneurship Development, Pearson Education (2006)"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 3221",
        "title": "ANIMAL AND PLANT BIOTECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [],
        "references": [
          "Dixon R.A. and Gonzales. Plant Cell Culture: A Practical Approach, IRL Press. 1995",
          "Lindsey K. and Jones M.G.K. Plant Biotechnology in Agriculture, Prentice Hall, 1990",
          "Singh K. Intellectual property rights on biotechnology, BCIL, New Delhi, 2001",
          "M.Butler -Animal Cell Culture and Technology' Second Edition (2004) BIOS Scientific Publisher, New York.",
          "R Ian Freshney Culture of animal cells: A manual of Basic techniques and Specialized applications, Wiley Blackwell Press"
        ],
        "flags": ["missing_syllabus"]
      },
      {
        "sem": 3,
        "code": "BIO 3222",
        "title": "BIOETHICS AND INTELLECTUAL PROPERTY RIGHTS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Biotechnology and Bioethics",
          "Hazardous materials",
          "Handling and disposal",
          "Good laboratory practice",
          "Regulatory guidelines for biotechnology research",
          "Ethical concerns and issues in biological research",
          "Intellectual Property Rights",
          "Various types",
          "Protecting IPR",
          "Patent",
          "Types",
          "Patent system in India and United States of America",
          "Filing of patent application",
          "Patenting in biotechnology and biopharma",
          "Patenting life forms",
          "Copyright",
          "Trademark",
          "Trade secrets",
          "Geographical Indications",
          "Protection of traditional knowledge"
        ],
        "references": [
          "Ashok K. M., & Mohd I. A., (2008). Intellectual property rights, 1st ed., Serials Publications New Delhi.",
          "Campbell A. V., (2013). Biothics: The Basics, Routledge (Taylor and Francis group). London and New York",
          "Padma Nambisan (2017). An Introduction to Ethical, Safety and Intellectual Property Rights Issues in Biotechnology. Academic Press, London",
          "Richard Stim A., (2014). Patent, Copyright and Trademark: An Intellectual property desk reference. 13th ed. Sheridan, USA",
          "Vallero D. A., (2007). Biomedical ethics for Engineers. Academic Press, London"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 3241",
        "title": "BIOREACTION ENGINEERING AND CELL CULTURE LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 6,
          "c": 2
        },
        "tags": ["lab"],
        "syllabus": [
          "Growth kinetics of bacterial species in shake flask and fed-batch cultures with various carbon sources",
          "Performance evaluation of bioreactors: stirred tank reactor (STR), fluidized bed reactor (FBR), and packed bed reactor (PBR) with immobilized enzymes",
          "Culture media preparation and growth of animal and plant cells"
        ],
        "references": [
          "Octave Levenspiel. Chemical Reaction Engineering. John Wiley & Sons, (3e), 2003",
          "Harvey W. Blanch and Douglas S. Clark. Biochemical Engineering, CRC Press, 1997",
          "John Villadsen. Bioreaction Engineering Principles. (3e), springer publishers 2011",
          "Dixon R.A. and Gonzales. Plant Cell Culture: A Practical Approach, IRL Press. 1995",
          "Lindsey K. and Jones M.G.K. Plant Biotechnology in Agriculture, Prentice Hall, 1990"
        ],
        "flags": ["structure_mismatch"]
      },
      {
        "sem": 3,
        "code": "BIO 3242",
        "title": "MODELING AND SIMULATION LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": ["lab"],
        "syllabus": [
          "Controllers (P, PI, PD & PID)",
          "Advanced control system",
          "Control valves",
          "First order system",
          "Second order system (inherent/multi capacity processes) with different inputs"
        ],
        "references": [
          "Gonzales, R. A., and Dixon, R. A.. Plant Cell Culture: A Practical Approach. United States, Oxford University Press, 2004.",
          "Lindsey, K.. Plant Biotechnology in Agriculture. N.p., Richard Dennis Publications, 1991.",
          "Shuler, Michael L., and Kargi, Fikret. Bioprocess Engineering: Basic Concepts. India, Pearson., 2015."
        ],
        "flags": ["department_mismatch", "semester_discrepancy"]
      },
      {
        "sem": 3,
        "code": "BIO 4291",
        "title": "INDUSTRIAL TRAINING",
        "credits": null,
        "tags": ["core"],
        "syllabus": [
          "Undergo industrial training for a minimum period of 4 weeks",
          "Training may be taken in a phased manner during the vacation starting from the end of third semester",
          "Submit a training report in the prescribed format to the department",
          "Make a presentation of the training report",
          "Include certificates issued by the industry in the report"
        ],
        "references": [],
        "flags": ["missing_credits"]
      },
      {
        "sem": 3,
        "code": "BIO 4292",
        "title": "PROJECT WORK/PRACTICE SCHOOL",
        "credits": null,
        "tags": ["lab"],
        "syllabus": [
          "Project work carried out in institution/industry/research laboratory or any other competent institution",
          "Minimum duration of 16 weeks (extendable to 24 weeks)",
          "Mid-semester evaluation after about 8 weeks",
          "Submission of interim project report during mid-semester evaluation",
          "Final evaluation and viva-voice after submission of final project report",
          "Presentation on the work carried out before the department committee"
        ],
        "references": [],
        "flags": ["missing_credits", "missing_references"]
      },
      {
        "sem": 3,
        "code": "BIO 4401",
        "title": "BIOREMEDIATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction: Advantages & disadvantages of bioremediation",
          "Microbial ecology and metabolism: Factors influencing Growth and Biodegradation, Modelling Growth & Biodegradation, Redox reactions, Metabolism of Organic & Inorganics, Phototrophic Metabolism, Cometabolism",
          "Mechanisms of Biodegradation: Biodegradation of Hydrocarbons, Halogenated Aliphatics & Aromatics",
          "Bioremediation processes: In situ Remediation of Aquifers & Soils, Solid Phase Bioremediation – Land Treatment & Composting, Slurry-Phase & Vapor phase Bioremediation – Biofilters & Biotrickling filters",
          "Biotreatment of Metals: Microbial Transformation of Metals; Bioleaching",
          "Phytoremediation: Phytoremediation of organics, metals & inorganics, Phytoextraction, Rhizofiltration, Phytostabilization"
        ],
        "references": [
          "Martin Alexander, “Biodegradation and Bioremediation”, Academic press. 1999",
          "John. T. Cookson, Jr., “Bioremediation engineering; design and application” McGraw Hill, Inc. 1995",
          "Eweis, Ergas, Chang and Schroeder. “Bioremediation Principles” McGraw-Hill Series in Water Resources and Environmental Engineering, 1998"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4402",
        "title": "BIOLOGICAL TREATMENT OF WASTE WATER",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Need for wastewater treatment",
          "Characterization of wastewater- Biological- BOD, COD, TOC, MPN, and Bacterial count",
          "BOD kinetic parameter fitting by Least square, Fujimoto, Daily difference, Thomas and Moments-Methods",
          "Physical characterization such as solids, Turbidity, and Chemical characterizations",
          "Bacterial metabolism in treatment",
          "Decomposition of organic compounds in Ecosystem, Biology",
          "Mass energy balance for Aerobic respiration, and Anaerobic respiration",
          "General considerations for Aerobic Vs. Anaerobic treatment",
          "Kinetic aspects",
          "Hydrolysis of cellulose-biological aspects",
          "Anaerobic degradation of lignocellulose and cellulose, proteins, fats",
          "Various types of anaerobic treatment reactors-UASB and its variations",
          "Calculation of biogas by Buswell equation",
          "Nitrification and denitrification processes",
          "Anammox process",
          "Biological Phosphorus removal processes"
        ],
        "references": [
          "Metcalf and Eddy. Wastewater Engineering - Treatment, Disposal and Reuse. Tata McGraw Hill Publishing Co. Ltd, 1991",
          "Rao C.S. Environmental Pollution Control Engg. New Age International (P) Ltd. Publishers, 1991",
          "Jordening H.J. and Winter J. Environmental Biotechnology: Concepts and Applications. Wiley-VCH Verlag GmbH & Co., 2005"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4403",
        "title": "BIOFUELS ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Various feedstock for different kinds of Biofuels",
          "Biochemical pathways",
          "Life Cycle Analysis (LCA) of various biofuels",
          "Various process technologies for bioethanol production",
          "Microorganism selection",
          "Comparison of various bioethanol processes",
          "Biodiesel from Seeds and Waste cooking oils",
          "Acid base, enzyme catalyzed transesterification process",
          "Biodiesel from Microalgae and various contemporary technologies and their comparisons",
          "Hydrogen production by enzymes and various microorganisms",
          "Inhibition effects of Hydrogen production",
          "Biogas production from various sources and process technologies"
        ],
        "references": [
          "Caye M. Drapcho, Nghiem PhuNhuan and Terry H. Walker, “Biofuels Engineering Process Technology”, Mc Graw Hill Publishers, New York, 2008",
          "Jonathan R.Meilenz (Ed.), “Biofuels – Methods and Protocols (Methods in Molecular Biology Series)”, Humana Press, New York, 2009",
          "Lisbeth Olsson (Ed.). “Biofuels (Advances in Biochemical Engineering/Biotechnology Series)”, Springer-Verlag Publishers, Berlin, 2007"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4404",
        "title": "SOLID WASTE MANAGEMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to solid waste management: Waste generation in technological society, integrated solid waste management",
          "Types and Composition of solid wastes",
          "Physical, chemical and biological properties of MSW",
          "Properties and classification of Hazardous wastes",
          "transformations of Hazardous waste constituents found in MSW",
          "Collection of solid waste",
          "Separation and Processing and Transformation of solid waste",
          "Transfer and Transport",
          "Disposal of solid wastes and residual matter",
          "Biological and chemical conversion technologies: Solid waste management and planning issues",
          "Implementation of solid waste management options; planning, siting and permitting of waste management facilities"
        ],
        "references": [
          "Theisen, Hilary, et al. Integrated Solid Waste Management: Engineering Principles and Management Issues. India, McGraw-Hill Education (India) Private Limited, 2014",
          "William D Robinson, The solid waste handbook: A practical guide, John Willy & sons, 1986"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4405",
        "title": "BIOMATERIALS AND DRUG DELIVERY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Properties of materials & classes of materials used in Medicine",
          "Host reaction to biomaterials and their evaluation",
          "Testing biomaterials",
          "Degradation of materials in the biological environment",
          "Application of materials in medicine & dentistry",
          "Implants & devices",
          "Basics of artificial organs",
          "Introduction to drug administration and drug effectiveness",
          "Diffusion and drug dispersion",
          "Diffusion in biological systems",
          "Drug permeation through biological barriers",
          "Drug transport by fluid motion",
          "Pharmacokinetics of drug distribution",
          "Drug delivery systems: drug modification",
          "Controlled drug delivery systems",
          "Some case studies in drug delivery"
        ],
        "references": [
          "Drug Delivery, W. Mark Saltzman, Oxford University Press, 2001",
          "Pharmaceutical Biotechnology, Gary Walsh, Wiley Publication",
          "Buddy Ratner, Allan Hoffman, Frederick Schoen, Jack Lemon. Biomaterial Science: An introduction to materials in medicine, Academic press, Elsevier publication, (3e), 2012",
          "Joon Park, Lakes R.S. Biomaterials: An Introduction, Springer publication, (3e), 2007",
          "Pharmaceutical Biotechnology, K. Sambhamurthy and AshutoshKar, Newage International Pvt Ltd Publisher, 2016"
        ],
        "flags": ["structure_mismatch"]
      },
      {
        "sem": 3,
        "code": "BIO 4406",
        "title": "BIOPHARMACEUTICAL ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction – Development of drugs and pharmaceutical industry",
          "Organic therapeutic agents. Drug Metabolism and Pharmaco-Kinetics – physico chemical principles, radioactivity, action of drug on human bodies",
          "Important Unit Processes and their applications",
          "Manufacturing Principles of different type of tablets",
          "Analytical methods and test for various drugs and pharmaceuticals, packaging techniques – quality control",
          "Health Biotechnology - health care products, edible vaccines, nutrition value of foods",
          "Health bioinformatics - microbes and human health, biotechnology kits to monitor day to day human health"
        ],
        "references": [
          "Heinrich Klefenz. Industrial pharmaceutical biotechnology, Wiley-VCH, 2002",
          "Susanna Wu-Pong, Yongyut Rojanasakul, and Joseph Robinson. Biopharmaceutical drug and design and development. Humana Press, 2010"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4407",
        "title": "BIOLOGICAL THERAPEUTICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "History of vaccine and immunotherapy development",
          "Antibody based therapeutics",
          "Chimeric antigen receptor engineering and clinical studies",
          "Introduction of molecular biology and history",
          "Oligonucleotide therapy (siRNA, miRNA, shRNA, antisense RNA)",
          "Development of gene transfer tools – viral and non-viral vectors",
          "Gene therapy for genetic diseases, infectious diseases",
          "Gene therapy clinical trials",
          "Basic concept of cancer treatment and immune response",
          "Cancer vaccines and preclinical studies",
          "Immune checkpoint regulation and cancer treatment",
          "Gene therapy for cancer",
          "Introduction to Stem Cells",
          "Stem cell-based therapies",
          "Ethical considerations"
        ],
        "references": [
          "Friedman T. 1999. The Development of Human Gene Therapy. Cold Spring Harbor, NY: Cold Spring Harbor Lab. Press.",
          "Knipe DM, Howley PM, eds. 2001. Fields Virology. Philadelphia, PA: Lippincott Williams & Wilkins.",
          "Hackett NR, Crystal RG. 2000. Adenovirus vectors for gene therapy. In Gene Therapy, ed. NS Templeton, DD Lasic, pp.17-39. New York: Marcel Dekker",
          "Lanza, R., Gearhart, J., Hogan, B., Melton, D., Pedersen, R., Thomas, E.D. and Thomson, J.A. eds., 2005. Essentials of stem cell biology. Elsevier.",
          "Owen, J.A., Punt, J., and Stranford, S.A., 2013. Kuby immunology p. 574. New York, NY, USA:: WH Freeman."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4408",
        "title": "MOLECULAR MODELING AND DRUG DESIGN",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["elective", "theory"],
        "syllabus": [
          "General concepts of Pharmacology – Bioavailability, Pharmacokinetic and pharmacodynamics",
          "Drug Design – Computational Drug Discovery, Binding interactions, Lipinski's rule of five (RO5), SMILES, Molecular Descriptors – chemical, topological and geometrical descriptors",
          "Molecular Modeling –1D, 2D and 3D analyses",
          "Computer Simulation Methods – Molecular Dynamics methods, Binding affinity calculations & conformational analysis, QSAR",
          "Design New Molecules – De novo ligand design, Similarity search - Virtual screening, Molecular docking – SNPs and Pharmacogenomics, Toxicology, Clinical trials, Regulatory affairs & Patenting"
        ],
        "references": [
          "Leach A.R. Molecular Modelling Principles and Applications. Longman, 2001",
          "Haile J.M. Molecular Dynamics Simulation Elementary Methods. J. Wiley and Sons, 1997",
          "Patrick, Graham L..An Introduction to Medicinal Chemistry. United Kingdom, OUP Oxford, 2013"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4441",
        "title": "BIOPROCESS CONTROL",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Measurement and signal transmission of process parameters – Flow, Pressure, Temperature, Level, pH, DO, density and viscosity",
          "Mathematical modeling of chemical and bioprocesses",
          "Introduction to Laplace Transforms, Development of Transfer functions. Dynamic behavior of first and second order processes",
          "Introduction to feedback controllers, feedforward and ratio controller, final control elements and controller tuning",
          "Block diagram representation, Stability of closed loop control systems -Routh stability criterion, Root locus diagrams"
        ],
        "references": [
          "Seborg D. E., Edgar T.F. and Mellichamp D.A. Process Dynamics and control, John Willey & Sons, 2004",
          "Stephanopoulos G. Chemical Process Control: An Introduction to Theory and Practice. Prentice Hall International, 1983",
          "Riggs J.B. and Nazmul Karim M.Chemical and bioprocess control. Ferret Publisher, 2008"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4442",
        "title": "BIOPROCESS EQUIPMENT DESIGN",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Design of pressure vessels: Codes and standards, Design factors, Classification of pressure vessels; design considerations; design of vessels under internal and external pressure",
          "Design of fermenters: Mixing in Fermenters, Power Requirements for Newtonian, Non-Newtonian broths and Gassed Fluids. Design criteria for batch fermenter, and chemostat. Scale-up of fermenters",
          "Heat Exchanger Design: Type of heat exchangers, energy balances in heat exchanger, Heat transfer in fermenters, and process design of shell and tube heat exchangers"
        ],
        "references": [
          "Richardson, and Sinott R.K. Chemical Engineering Vol. 6, J.F. Pergamon Press, 2005",
          "Joshi M.V. Process Equipment Design, McMillan India, 2005",
          "PF Stanbury, S. Hall, A. Whitaker. 2017. Principles of Fermentation Technology. 3rd Edition, Elsevier Science Publishers.",
          "Bjorn K. Lydersen, Nancy A D'elia and Kim L. Nelson. Bioprocess Engineering-Systems, Equipment and Facilities, A Wiley Interscience Publication, 1994",
          "Unfired Pressure Vessel Code BIS 2825",
          "Code for Shell & Tube heat exchangers BIS 4503",
          "Chemical Engineer's Handbook by Perry"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4443",
        "title": "BIOPROCESS MODELLING AND SIMULATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Definition of modeling and simulations detailed applications and limitations",
          "Classification of models and how to build model",
          "Principles of formulation of models",
          "Fundamentals Laws; Energy equations",
          "Exercises in formulation of lumped and distributed parameter models",
          "Examples involving algebraic equations, ordinary differential equations, and integral equations",
          "Formulation of batch distillation problem with ideal solution law",
          "Draining time for different types of tanks – Formulation and solution",
          "Batch, Semi-batch and continuous bioreactor formulation of models",
          "Structured and unstructured models; Segregated and non-segregated models",
          "Numerical problems",
          "Numerical techniques for the solution of bioprocess models – Gauss-Jacobi and special methods, Method of bisection, Regular-false, Wegstein method, Newton – Raphson method, 4th order Range-Kutta method",
          "Examples in Bioprocesses system"
        ],
        "references": [
          "Himmelblau, David Mautner. Process Analysis and Simulation. United States, University of Texas at Austin, 1975.",
          "Ramirez, W. Fred. Computational Methods for Process Simulation. United Kingdom, Elsevier Science, 1997.",
          "Mathews, John H., and Fink, Kurtis K.. Numerical Methods Using Matlab. United Kingdom, Pearson Education, Limited, 2010.",
          "Bequette, B. Wayne. Process Control: Modeling, Design, and Simulation. India, Prentice Hall PTR, 2003."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4444",
        "title": "BIOSTATISTICS AND DESIGN OF EXPERIMENTS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to statistics: Descriptive and inferential statistics. Measures of central tendency",
          "Measures of spread. Probability distributions, Hypothesis testing",
          "Linear & quadratic models, regression coefficients, estimation using least squares method",
          "Introduction to statistical design: Introduction to factorial designs, 2k factorial design, main effects, interaction effects",
          "Screening designs: Fractional factorial designs, Plackett-Burmann screening designs. Model reduction, model assumption checking, residual plots",
          "Optimization designs: Response surface methodology – concepts & methods, central composite designs and Box-Behnken design"
        ],
        "references": [
          "Montgomery Douglas C. Design and analysis of experiments, John Wiley, 2013",
          "Lawson John & Erjavec John. Modern Statistics for Engineering and Quality Improvement, Thomson, 2001",
          "Panda T., Theodore T. and Kumar R.A. Statistical Optimization of Biological Systems. CRC Press, 2015",
          "Rosner B. Fundamentals of Biostatistics, (5e), Duxbury Thomson Learning, 2000"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4445",
        "title": "COMPUTATIONAL BIOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Algorithms and complexity",
          "Algorithm Design Techniques",
          "Data Storage",
          "Relational Databases",
          "Biological Data Types",
          "Biological Data Mining",
          "Machine learning Methods",
          "Biological data mining tools",
          "Hidden Markov Models",
          "Artificial Neural Networks",
          "Clustering",
          "Nucleotide and Protein Sequence Analysis",
          "Dynamic Programming Algorithm",
          "Multiple Sequence Alignment Algorithms",
          "Phylogenetic Algorithms",
          "Gene Expression Analysis",
          "Heuristic Algorithms",
          "Identification of Functional Sites in Sequences",
          "Pattern Matching",
          "Gene and Domain Prediction",
          "Restriction Mapping",
          "Genome Rearrangement",
          "Genome Assembly",
          "Protein secondary structure prediction methods and algorithms",
          "RNA structure",
          "RNA secondary structure prediction",
          "Structure File Formats",
          "Structure Similarity Search",
          "Basis of Structural Alignment",
          "Set & Graph theory",
          "Graph Algorithms",
          "Chemical Graphs",
          "Protein Graphs and Networks"
        ],
        "references": [
          "Neil Jones & Pavel Pevzner, “Introduction to Bioinformatics Algorithms”, MIT Press, 2004.",
          "Heitor Silvério Lopes & Leonardo Magalhães Cruz, “Computational Biology and Applied Bioinformatics”, InTech, 2011.",
          "Dongqing Wei, Qin Xu, Tangzhen Zhao, Hao Dai, Bryan Bergeron, “Advance in Structural Bioinformatics”, Springer, 2014.",
          "David W Mount, “BIOINFORMATICS: Sequence and Genome Analysis”, Cold Spring Harbor, 2001."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4446",
        "title": "FOOD PROCESS ENGINEERING AND TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Food Processing: Biotechnology in relation to the food industry; nutritive value of food; types of microorganisms associated with food - their sources, types and behavior",
          "Food Spoilage & Preservation: Microbial Spoilage of Vegetables, Fruits, Fresh and Processed Meats, Poultry and Seafood",
          "Food Preservation: Food Preservation Using Irradiation, Food Preservation with Low Temperatures, Food Preservation with High Temperatures, Preservation of Foods by Drying",
          "Biotechnology in Food Industry: Characteristics of Food Industry. Food manufacturing & processing, common additives, bioorganic additives, spoilage, prevention of spoilage, storage and preservation through biotechnological means",
          "Food Industry: Basal metabolic rate, influences on nutritional status, dietary strategies for individuals, diet for specific groups, Market Place, ecologically sustainable production, risks and benefits of biotechnology to food industry",
          "Unit Operations in Food Processing: Unit operations applied to the food processing industry – Fluid flow applications, Heat transfer applications, Centrifugation, Filtration, Extraction, Membrane separations, Evaporation, Distillation, Absorption, Size reduction, Mixing, Drying, and Crystallization"
        ],
        "references": [
          "Roger, A., Gordon, B. and John, T. 1989. Food Biotechnology. Cambridge University Press",
          "Golden, David A., et al. Modern food microbiology. India, Springer, 2005.",
          "W Lindsay. 1988. Biotechnology – Challenges for the flavor and food industry. Elsevier Applied Science.",
          "Earle, R. L. Unit Operations in Food Processing. United Kingdom, Elsevier Science, 2013."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4447",
        "title": "GENOMICS AND PROTEOMICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Genomics and proteomics as newer fields in modern biology",
          "Organization of genes and genomes, genome mapping, sequencing, and annotation",
          "Protein expression, post-translational modifications, and protein–protein interactions",
          "High-throughput techniques used in genomics and proteomics",
          "Applications of genomic and proteomic techniques in various biological fields"
        ],
        "references": [
          "Benjamin Lewis. 2003. Genes VIII. Oxford University Press.",
          "Smith D. W. 1994. Biocomputing Informatics and the Genome Projects. Academic Press.",
          "Jonathan Pevsner. 2015. Bioinformatics and Functional Genomics. Wiley Blackwell",
          "Daniel Liebler. 2002. Introduction to Proteomics. Humana Press"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4448",
        "title": "HEALTH DIAGNOSTICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Health diagnostics, Importance, and applications",
          "Infectious diseases",
          "Parasitic diseases",
          "Viral diseases",
          "Genetic disorders",
          "Neurological diseases",
          "Immune disorders",
          "Genes & Disease",
          "Antimicrobial resistance",
          "New technologies in Diagnostics",
          "DNA based diagnostics methods",
          "Biochemical diagnostics methods",
          "Cell-based diagnostics methods",
          "Antibody markers",
          "CD Markers",
          "FACS",
          "HLA typing",
          "Bioassays",
          "Immunodiagnostics methods",
          "Antigen-Antibody Reactions",
          "Conjugation Techniques",
          "Antibody Production",
          "Case studies related to bacterial, viral and parasitic infections",
          "Diagnosis of infectious diseases",
          "Respiratory diseases",
          "Viral disease",
          "Bacterial diseases",
          "Enteric diseases",
          "Parasitic diseases",
          "Mycobacterium diseases",
          "Phage display",
          "Immunoassays",
          "FACS"
        ],
        "references": [
          "Patrinos, G. P., Ansorge, W. J. and Danielson, P.B. (2016). Molecular Diagnostics. Academy Press.",
          "Burtis, C. A., & Bruns, D. E. (2014). Tietz Fundamentals of Clinical Chemistry and Molecular Diagnostics. Elsevier Health Sciences.",
          "Tille, P. (2015). Bailey & Scott's Diagnostic Microbiology. Elsevier Health Sciences.",
          "McPherson, R. A., & Pincus, M. R. (2021). Henry's Clinical Diagnosis and Management by Laboratory Methods (E-book). Elsevier Health Sciences.",
          "Turgeon, M. L. (2018). Linne & Ringsrud's Clinical Laboratory Science (E-Book): Concepts, Procedures, and Clinical Applications. Elsevier Health Sciences."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4449",
        "title": "METABOLIC ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction – Jacob Monod model, catabolite regulation, glucose effect, cAMP deficiency, feedback regulation",
          "Synthesis of Primary Metabolites – Alteration of feedback regulation, limiting accumulation of end products, metabolites",
          "Biosynthesis of Secondary Metabolites – Precursor effects, prophophase, idiophase relationship, enzyme induction & producers of secondary metabolites",
          "Bioconversions – Advantages, specificity, yields, co-metabolism, avoidance of product inhibition, mixed or sequential bioconversions, conversion of insoluble substances",
          "Regulation of Enzyme Production – Strain selection, improving fermentation, recognizing growth cycle peak, catabolite repression, mutants resistant to repression"
        ],
        "references": [
          "Gregory Stephanopoulos, Aristos Aristidou, Jens Nielsen. Metabolic engineering. Academic Press Inc.1998",
          "Stanbury, Peter F, et al. Principles of Fermentation Technology. Germany, Elsevier Science, 2016"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4450",
        "title": "PROTEIN ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["elective", "theory"],
        "syllabus": [
          "Basic structural principles of protein",
          "Protein structure and function",
          "Protein prediction",
          "Target molecules for protein engineering",
          "De novo protein design",
          "Protein folding and flexibility",
          "Kinetic factors",
          "Folding pathways",
          "Chaperonins",
          "GroEL-GroES assisted folding",
          "Protein conformational changes",
          "Protein kinase",
          "Serpin",
          "Calmodulin",
          "Serine protease",
          "Protein analysis and characterization",
          "Computational methods",
          "Applications",
          "Incorporation of unnatural amino acids into proteins",
          "Engineering stable proteins",
          "Phage display",
          "Directed evolution",
          "Targeted mutagenesis",
          "Rational protein design",
          "Role of protein engineering in vaccine development",
          "Humanized antibodies"
        ],
        "references": [
          "Branden C, Tooze R. 1993. Introduction of Protein structure. Garland.",
          "Stefan L, Uwe TB. 2012. Protein Engineering Handbook 2nd edition. Wiley-VCH",
          "Huimin Z, Sang YL, Jens N, Gregory S. 2021. Protein Engineering: Tools and Applications. Wiley-VHC",
          "Wong TS, Tee KL. 2020. A practical guide for protein engineering. 1st Edition. Springer cham."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4311",
        "title": "INTRODUCTION TO BIOINFORMATICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Introduction to Bioinformatics",
          "Central dogma of biology",
          "Digital code of life",
          "Biological database searching and analysis",
          "Data sources connected through internet access",
          "Biomedical literature search",
          "Information retrieval and interpretation",
          "Sequence analysis methods",
          "Phylogenetic analysis",
          "Protein secondary structure prediction",
          "3D structures visualization",
          "Modeling",
          "Genome annotation",
          "Genome compression methods"
        ],
        "references": [
          "Lesk, Arthur M.. Introduction to Bioinformatics. United Kingdom, Oxford University Press, 2019.",
          "Ouellette, B. F. Francis, and Baxevanis, Andreas D.. Bioinformatics: a practical guide to the analysis of genes and proteins, 3rd ed. India, Wiley India Pvt. Limited, 2009.",
          "Brown, Stuart M.. Bioinformatics: A Biologist's Guide to Biocomputing and the Internet. United States, Eaton, 2000."
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4312",
        "title": "BODY, MIND AND MEDICINE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["core", "theory"],
        "syllabus": [
          "Explanation of human body and its evaluation to the present form",
          "How different cultures interpreted human body: energy centers, energy chakras",
          "Explanation of mind and different aspects of it: subconscious, conscious mind and their effect during different stages of human growth",
          "How it has reached the present form",
          "Interaction of mind and body and its effect on human development and growth",
          "Different interpretation of human body by allopathy medicine, Ayurveda medicine and Chinese medicine"
        ],
        "references": [
          "Amit Goswami, The quantum doctor, Jaico Publishing House, 2011",
          "Bruce H. Lipton, The Biology of Belief: Unleashing the Power of Consciousness, Matter and Miracles, ReadHowYouWant.com, 2010",
          "Firstenberg A, The invisible Rainbow: The history of electricity and life, Chelsea Green Publishing, 2020"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "BIO 4313",
        "title": "BIOINSPIRED DESIGN FOR ENGINEERS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": ["theory"],
        "syllabus": [
          "Basic biological principles, design and working relationship in biological systems, Bioinspiration engineering, methodology and approach for Bioinspiration and biomimetics",
          "Adhesion in biological systems, natural super-hydrophobic and hydrophilic substances, understanding chemical and physical processes in biological systems and its application in bioinspired engineering",
          "Morphing and actuation in plants; lubrication and movement in biological systems, multimodal locomotion, propulsion features of biological systems, design of flying objects in biology and its application in aeronautical designs",
          "Navigation, communication, automation, shock absorption and mechanics of biological systems and its application in designs of engineering, mathematical modelling in plants and animals, Future trends in bioinspiration engineering"
        ],
        "references": [
          "Ashok K Goel, Daniel A McAdams and Robert B. Stone 2014. Biologically Inspired Design Computational Methods and Tools, Springer-Verlag London",
          "Hashemi Farzaneh, Helena, Lindemann, Udo 2019. A practical guide to bioinspired design. Springer",
          "Christopher Jenkins, 2011. Bio-Inspired Engineering Momentum press, New York",
          "Brebbia CS, 2010. Design and Nature V. Comparing design in nature with science and engineering. WIT Press, UK"
        ],
        "flags": ["tags_inferred_as_theory", "core_elective_status_uncertain"]
      }
    ]
  }
}
