{
  "department": {
    "name": "Department of Mechanical & Industrial Engineering",
    "courses": [
      {
        "sem": null,
        "code": "MAT 2121",
        "title": "ENGINEERING MATHEMATICS - III",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Gradient, divergence and curl",
          "Line, surface and volume integrals",
          "Green's, divergence and Stoke's theorems",
          "Fourier series of periodic functions",
          "Half range expansions",
          "Harmonic analysis",
          "Fourier integrals",
          "Sine and cosine integrals, Fourier transform, Sine and cosine transforms",
          "Partial differential equation- Basic concepts, solutions of equations involving derivatives with respect to one variable only",
          "Solutions by indicated transformations and separation of variables",
          "One-dimensional wave equation, one dimensional heat equation and their solutions",
          "Numerical solutions of boundary valued problems",
          "Laplace and Poisson equations and heat and wave equations by explicit methods"
        ],
        "references": [
          "Erwin Kreyszig: Advanced Engineering Mathematics, 5th edn. 1985 Wiley Eastern",
          "S. S. Sastry: Introductory Methods of Numerical Analysis 2nd edn.1990, Prentice Hall",
          "B. S. Grewal: Higher Engg. Mathematics, 1989 Khanna Publishers",
          "Murray R. Spiegel: Vector Analysis, edn.1959, Schaum Publishing Co."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2121",
        "title": "THEORY OF MACHINES",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Basic concepts: Mechanism and machine, Kinematic pair, link, chain, and inversions, constrained and unconstrained motion, four-bar mechanism, single and double slider crank mechanisms with inversions",
          "Velocity and Acceleration: velocity in mechanisms by relative velocity method, vector method, and instantaneous center method, acceleration in the mechanism by relative acceleration method",
          "Toothed gearing: Law of gearing, Spur Gears - Terminology, cycloidal and involute teeth, the minimum number of teeth on the pinion to avoid interference, Terminology of helical and bevel gears, epicyclic gear trains",
          "Cams: Types of Cams and followers, design of Cam profiles",
          "Static force analysis: Conditions for static equilibrium of a member under the action of forces, analysis of slider-crank mechanism, four-bar mechanism",
          "Balancing of machinery: Balancing of rotating masses, balancing of reciprocating masses, balancing of multi-cylinder in-line engines and V-engines",
          "Gyroscopic forces: Gyroscopic effect on the movements of an aircraft, ship, and automobiles"
        ],
        "references": [
          "Rattan S. S, Theory of Machines, Tata Mc-Graw Hill Publishers Pvt. Ltd, New-Delhi, 2019",
          "Uicker J. J, Pennock G. R. and Shigley, J. E., Theory of Machines and Mechanisms, Oxford University press, 2014",
          "Ballaney P. L., Theory of Machines, Khanna Publishers, New Delhi, 2015",
          "Singh, V. P., Theory of Machines, Dhanpat Rai Publishing Company Ltd., 2004",
          "Rao J. S. and Dukkipati R. V., Mechanism and Machine Theory, Wiley Eastern Ltd. Delhi, 1992",
          "Mata, Antonio Simón, Alex BatallerTorras, Juan Antonio Cabrera Carrillo, Francisco EzquerroJuanco, Antonio Jesús Guerra Fernández, Fernando Nadal Martínez, and Antonio Ortiz Fernández. Fundamentals of machine theory and mechanisms. Vol. 40. Cham: Springer, 2016"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2122",
        "title": "MANUFACTURING PROCESSES - I",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Types of moulding, Moulding materials, Sand Testing",
          "Various Casting techniques",
          "Classification of welding processes and its operational features",
          "Sheet metal forming operations",
          "High Energy rate forming processes",
          "Theory of metal cutting, Machinability parameters, Tool life and wear",
          "Merchant's analysis, Taylor's equation",
          "Cutting force and tool life calculation",
          "Lathe features, types, accessories and attachments, lathe operations, calculations of thread cutting and machining time",
          "Types of Drilling machines, twist drill nomenclature and computation of drilling time",
          "Types of milling machines, attachments, milling operations, types of milling cutters, Indexing methods",
          "Grinding wheel – Abrasive particles, Bonding materials, Designation, Constructional features and principles of cylindrical, surface and centreless grinding machines"
        ],
        "references": [
          "Rajput R. K., A Text book of Manufacturing Technology, Laxmi Publications Private Limited, 2011.",
          "Khanna O.P., A text book of Production Technology (Vol1&2), Dhanpat Rai Publications, 2011.",
          "Rao P. N., Manufacturing Technology, Tata McGraw-Hill Publishing Company Limited, 2006.",
          "Serope Kalpakejian and Steven Schmid R, Manufacturing Engineering and Technology, Pearson Education, 2005.",
          "Paul DeGarmo E., Black J. T. and Ronald Kohser A, Materials and Process in Manufacturing, John Wiley and Sons, 2004.",
          "Lal M. and Khanna O. P., Foundry Technology, Dhanpat Rai and Sons, 1991.",
          "Jain R. K., Production Technology, Khanna Publishers, 2001.",
          "P. C. Sharma, A Textbook of Production Technology, S. Chand Publishing, 2007."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2123",
        "title": "FLUID MECHANICS",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Properties of fluids – definition of various hydrodynamic parameters, fluid continuum, different types of fluids",
          "Fluid statics – Pressure and its measurement, hydrostatic pressure forces on flat and curved surfaces, buoyancy and its stability",
          "Kinematics of fluid flow – methods of fluid flow description, velocity and acceleration vectors, dimensions of fluid flow; path line, stream line, streak line and stream tube; rotational and irrotational flow; velocity potential function and stream function; translation, rotation and deformation of a fluid element",
          "Dynamics of fluid flow – continuity equation, Euler's equation, Reynold's transport theorem, energy of a flowing fluid - Euler's equation of motion along a stream line, Bernoulli's equation; Impulse momentum equation; Navier-Stokes equation",
          "Dimensional analysis - Rayleigh's method and Buckingham's Pi-theorem, similitude, types of similarity, significance of dimensionless numbers",
          "Internal fluid Flow - Couette flow, Hagen Poiseuille's flow, Reynolds experiment, Darcy equation, friction factor, pipe roughness, Moody's Chart, Major loss and Minor losses in pipe flow, Siphon, Venturimeter, Orifice meter and Pitot tube",
          "External fluid flow – boundary layer theory, displacement thickness, Von-Karman momentum integral equation; flow past submerged bodies, streamlined body, Bluff body"
        ],
        "references": [
          "Cengel Yunus A., and Cimbala John M., Fluid Mechanics- Fundamentals & Applications, 4th ed., McGraw Hill publications, 2018.",
          "Frank M. White, Fluid Mechanics, 7th ed., McGraw-Hill, 2011.",
          "Som S. K., Gautam Biswas, and Chakraborty S., Introduction to Fluid Mechanics and Fluid Machines, 3rd ed., Tata McGraw Hill publications, 2012.",
          "Bruce R. Munson, Donald F. Young, and Teodore H. Okiishi, Fundamentals of Fluid Mechanics, Wiley, 2009.",
          "Kumar K. L., Engineering Fluid Mechanics, S. Chand Publishing, New Delhi, 2016.",
          "Modi P. N., and Seth S. M., Hydraulics and Fluid Mechanics Including Hydraulics Machines, 21st ed., Standard Book House, 2018.",
          "Bansal R. K., Fluid mechanics and Hydraulic machines, 1oth ed., Laxmi Publications (P) Ltd. New Delhi, 2019."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2124",
        "title": "MECHANICS OF MATERIALS",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Shear force and bending moments in beams: Classification of beams and loads, sign convention, Shear force and bending moment",
          "Stresses in beams: Theory of simple bending, bending and shear stresses in beams",
          "Beam deflection: Relationship between slope, deflection and radius of curvature, double integration method and Macaulay's method",
          "Torsion: Analysis of torsion of circular bars, shear stress distribution, bars of solid and hollow circular section, stepped shafts",
          "Principal stresses: Stresses in a uniaxial & biaxial member, principal plane and principal stress, graphical method for evaluation of stresses",
          "Columns and struts: Classification of columns, slenderness ratio, Euler's formula, Rankine's formula",
          "Thin and thick cylinders: Classification of cylinders, stresses in thin cylinders, lame's theory for evaluation of stresses in thick cylinders",
          "Materials and their properties: Stressstrain diagrams, Ductile and brittle fracture, Material specification, Theories of failure, Factor of safety"
        ],
        "references": [
          "Popov E.P, Engineering Mechanics of Solids, Prentice-Hall of India, New Delhi, 1997",
          "Beer F. P. and Johnston R, Mechanics of Materials (3e), McGraw-Hill Book Co, 2002",
          "Nash W.A, Theory and problems in Strength of Materials, Schaum Outline Series, McGraw-Hill Book Co, New York, 1995",
          "Kazimi S.M.A, Solid Mechanics, Tata McGraw-Hill Publishing Co, New Delhi, 1981",
          "Ryder G.H, Strength of Materials (3e), Macmillan India Ltd, 2002",
          "Ray Hulse, Keith Sherwin and Jack Cain, Solid Mechanics, Palgrave ANE Books, 2004",
          "Singh D. K., Mechanics of Solids, Pearson Education, 2002",
          "Timoshenko S, Elements of Strength of Materials, Tata McGraw-Hill, New Delhi, 1997",
          "Hearn, Edwin John, Mechanics of Materials 1: The mechanics of elastic and plastic deformation of solids and structural materials, Elsevier, 1997",
          "Hearn, Edwin John, Mechanics of Materials 2: The mechanics of elastic and plastic deformation of solids and structural materials, Elsevier, 1997"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "MIE 2125",
        "title": "THERMAL ENGINEERING",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Basic concepts: definitions, reversible and irreversible processes, Zeroth Law, path and point function",
          "Work and heat transfer: Thermodynamic work, Displacement work, pdv work for various processes and heat transfer",
          "First law of thermodynamics: open and closed systems, SFEE and PMM1",
          "Second law of thermodynamics and entropy: heat engines, reversed heat engines, Kelvin-Planck and Clausius statements, PMM2, Carnot cycle, Carnot theorem, entropy, Clausius inequality, entropy change non-flow processes",
          "Pure Substance: definitions, PVT surface, P-T diagram, dryness fraction and its measurement, Tabulated properties, different processes for pure substances",
          "Ideal and Real gases: definition, different processes, property evaluation, adiabatic mixing of ideal gases, Vander Waal's equation, law of corresponding states, compressibility factor, generalized compressibility chart",
          "Power cycles: Rankine cycle, effect of operating parameters, reheat cycle, Regenerative cycles and properties of working substance, air standard Otto, Diesel dual cycles, air standard efficiency and comparison, simple Brayton cycle and methods to improve its performance",
          "Reciprocating air compressors: theory of compression, single stage compression, effect of clearance, volumetric efficiency, multi-stage compression, and inter-cooling, minimum work of compression",
          "Refrigeration cycles: Bell-Coleman cycle, vapour compression and vapour absorption cycle, properties of refrigerants",
          "Performance testing of IC engines: measurement of BP, IP and FP, various efficiencies, heat balance sheet, principle of combustion in S.I and C.I engines"
        ],
        "references": [
          "Cenegel Yunus and Bole Michael, Thermodynamics: An Engineering Approach, 9th ed., McGraw Hill, New York, 2019",
          "Estop and McConkey, Applied Thermodynamics for Engineering Technologies, 5th ed, Pearson Education, Delhi, 2002",
          "Mayhew A. and Rogers B., Engineering Thermodynamics, 4th ed., E.L.B.S. Longman, London, 2002",
          "Van Wylen and G. J. and Sonntag R. E., Fundamentals of Classical Thermodynamics, 4th ed., John Wiley, New York, 2019",
          "Cengel, Thermodynamics and Heat Transfer, 2nd ed., McGraw Hills, New York, 2009",
          "Nag. P. K., Engineering Thermodynamics, 6th ed., Tata McGraw Hills, New Delhi, 2017"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2141",
        "title": "COMPUTER AIDED MECHANICAL DRAWING AND MODELLING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Introduction to Machine drawing",
          "Conventions",
          "Sectional views",
          "Screw Thread Terminologies and Thread Forms",
          "Hexagonal and Square Head Bolts, Nuts and Screws",
          "Introduction to Sketcher Exercises using CAD tool (CATIA Software)",
          "Modelling of machine components using CAD tool (CATIA Software)",
          "Assembly of machine components",
          "Product Drafting",
          "Surface Modelling Exercises using CAD tool (CATIA Software)"
        ],
        "references": [
          "Gopalakrishna K. R., Machine Drawing, Subhas Publications, Bangalore, 2017.",
          "Narayana K. L. and Kannaiah P, Text book on Engineering Drawing, Scitech Publications, Chennai, 2011.",
          "Bhat N D ;Panchal V M., Machine drawing, AnandCharotar Publishing House, 2007.",
          "Ibrahim K Zeid, CAD/CAM Theory and Practice, Tata McGraw Hill, New Delhi, 2009.",
          "Sham Tickoo, CATIA V5R20 for Engineers and Designers, Dreamtech Press New Delhi, 2019."
        ],
        "flags": [
          "missing_sem",
          "credits_mismatch"
        ]
      },
      {
        "sem": 4,
        "code": "MIE 2142",
        "title": "WORKSHOP PRACTICE – I",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Arc welding practice",
          "Lap and Butt joints",
          "Study of Gas Welding",
          "TIG and MIG Welding",
          "Casting & Forging Practice",
          "Plain turning",
          "step turning",
          "Taper turning & Thread cutting using lathe",
          "Facing",
          "Step turning",
          "Taper turning",
          "Stock Removal Turning",
          "Grooving",
          "Thread cutting",
          "Drilling and boring using CNC Turning Center",
          "Acceptance Test on Lathe and Drilling machine"
        ],
        "references": [
          "Hajra Chaudhury S. K., Hajra Choudhury A. K. and Nirjhar Roy, Elements of Workshop Technology, Vol. I, Media Promoters and Publishers Pvt. Ltd., 2003.",
          "Peter Smid, CNC Programming Hand book, Industrial Press, New York, 2000."
        ],
        "flags": [
          "credits_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "MAT 2230",
        "title": "ENGINEERING MATHEMATICS - IV",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Special Functions: Series solutions of Bessel and Legendre differential equations, Recurrence formulae, generating functions and Orthogonal properties for Jn(x) and Pn(x)",
          "Probability, finite sample space, conditional probability and independence, Bayes' theorem, one dimensional random variable: mean and variance, Chebyshev's inequality",
          "Two and higher dimensional random variables, covariance, correlation coefficient, regression, least square principle of curve fitting",
          "Distributions: binomial, Poisson, uniform, normal, gamma, chi-square and exponential",
          "Moment generating function, Functions of one dimensional and two-dimensional random variables, Sampling theory, Central limit theorem and applications"
        ],
        "references": [
          "Kreyzig E., Advanced Engineering Mathematics, 7th ed., Wiley Eastern",
          "Meyer P. L., Introduction to probability and Statistical applications, 2nd ed., American Publishing Co., 1965",
          "Hogg, and Craig, Introduction of Mathematical Statistics, 4th ed., MacMillan, 1975",
          "Grewal B. S., Higher Engg. Mathematics, Khanna Publishers, 1989"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "MIE 2221",
        "title": "DESIGN OF MACHINE ELEMENTS",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Strength under combined axial, bending & torsional loads, Stress concentration",
          "Stresses in curved beams",
          "Fatigue: S-N diagram, Endurance limit, Variables affecting fatigue strength, Fluctuating stresses, Goodman & Soderberg equations",
          "ASME code for design of transmission shafts, Mises Hencky theory for transmission shafting, Stress concentration, Design of shafts subjected to bending in two planes in addition to axial loads",
          "Keys: Types of keys, Stress in keys, Design of square, rectangular & taper keys and splines",
          "Types of welds, Strength of welds, Welded joints subjected to eccentric loading, Stresses in bolts, Effect of initial tension, Bolts subjected to various eccentric loading conditions",
          "Types of springs, Design of helical compression springs - steady/ fluctuating loads, surge in spring, concentric springs",
          "Design of Leaf springs: Semi elliptic carriage springs, Stress equalization",
          "Nomenclature, Stresses in gear teeth, involute gears, Lewis equation for beam strength of tooth, Form factor, velocity factor, Static, Dynamic, Limiting load for wear",
          "Journal bearing- Terminology, Hydrodynamic lubrication, Stribeck curve, eccentricity and minimum oil film thickness, Heat generation & dissipation",
          "Rolling contact bearings: Types of ball and roller bearings, Life rating, Static and Dynamic load carrying capacity, Selection of bearings",
          "Selection of V belt drive systems, Selection of rope drive systems and chain drive systems"
        ],
        "references": [
          "Shigley J. E. and Mischke C. R., Mechanical Engineering Design, Eight Edition, McGraw Hill Inc, New York, 2008",
          "Bhandari V. B., Design of Machine Elements, Third Edition, Tata McGraw-Hill Publishing Company Limited, New Delhi, 2012",
          "Norton R. L., Machine Design - An Integrated Approach, Second Edition, Prentice Hall Inc. New Jersey, 2007",
          "Juvenile R. C. and Marshek K. M., Fundamentals of Machine Component Design, Fifth Edition, John Wiley and Sons, Inc, New York, 2012",
          "Maleev and Hartman, Machine Design, (Revised and edited by Drop Grover), CBS Publishers, New Delhi, 2018",
          "Hamrock B. J., Jacobson B.O. and Schmid S. R., Fundamentals of Machine Elements, Second Edition, Mc Graw Hill Inc., New York, 2005",
          "Mahadevan K. and Balaveera Reddy K., Machine Design Data Hand Book, Fourth Edition, CBS Publishers and distributors' New Delhi, 2013"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2222",
        "title": "MATERIALS ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to materials",
          "Solidification",
          "Homogeneous and heterogeneous nucleation",
          "Mechanism of solidification",
          "Phases in solids",
          "Equilibrium diagrams",
          "Lever rule and its application",
          "Iron-Carbon systems",
          "Allotropy and polymorphism",
          "Fe-C equilibrium diagrams",
          "Ferrous-alloys",
          "Composition, properties and applications of Plain carbon steels & Alloy steels",
          "Non-ferrous alloys",
          "Types of Brasses",
          "Bronzes",
          "Al-Cu alloys",
          "Introduction to composite materials"
        ],
        "references": [
          "Avner S. H., Introduction to Physical Metallurgy, 3rd ed., McGraw Hill, 2004",
          "William D. Callister, Materials Science and Engineering, John Wiley & Sons, 2007",
          "Gupta K. M., Material science, Metallurgy and Engineering Materials, Umesh Publication, 2012",
          "Raghavan V., Material Science and Engineering, 4th ed., Prentice Hall of India, 2003",
          "Chawla K. K., Composite Materials Science and Engineering, Springer Verlag, 2012",
          "Jones R. M., Mechanics of Composite Materials, McGraw-Hill, 1999"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2223",
        "title": "METROLOGY AND MEASUREMENTS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Measurement systems",
          "Definition of standard terms",
          "Measurement of pressure, temperature, strain, force, torque & shaft power",
          "Limits, fits & tolerances",
          "Types of fits",
          "Gauges",
          "Taylor's principle",
          "Measurement of form errors",
          "Straightness, squareness and flatness measurement",
          "Surface texture",
          "Screw thread measurement",
          "Two-wire & three-wire method"
        ],
        "references": [
          "Beckwith Thomas G., Mechanical Measurements, Pearson Education, 2003",
          "Jain R.K., Engineering Metrology, Khanna Publishers, 1997",
          "Sawhney A.K., Mechanical Measurement & Instrumentation, Dhanpat Rai and Co, 2002",
          "Nakra B.C. and Chaudry K.K., Instrumentation, Measurement and Analysis, Tata McGraw Hill, 2002",
          "Gupta I. C., Engineering Metrology, Dhanpat Rai Publications, 1997",
          "Raghavendra N.V. and Krishnamurthy L., Engineering Metrology and Measurements, Oxford University Press, 2013"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2224",
        "title": "TURBO MACHINES",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Types of turbo machines, dimensional analysis and similitude, specific speed, affinity laws, Moody's empirical efficiency formula",
          "Energy transfer: Euler turbine equation, degree of reaction, concept of utilization factor, zero angle turbine, head capacity relationship, effect of exit blade angle on performance",
          "Thermodynamics of turbomachines: Isentropic efficiency, infinitesimal polytrophic and finite stage efficiencies, preheat factor and reheat factor",
          "Centrifugal pumps: Static pressure rise, manometric head, various efficiencies, minimum starting speed, cavitation and NPSH, slip and slip factor, main and operating characteristics, iso-efficiency graph",
          "Centrifugal compressors, blowers and fans: h-s diagram, stage work, degree of reaction, need for limiting inlet relative velocity in high speed compressors, phenomenon of surging",
          "Axial flow compressors and fans: h-s diagram, velocity triangles, enthalpy and stagnation pressure loss coefficients, blade loading, degree of reaction, work done factor",
          "Hydraulic turbines: Pelton turbine, work done and hydraulic efficiency, design parameters and governing, Francis turbine, draft tube theory, Kaplan turbine, governing of reaction turbines, main and operating characteristics, iso-efficiency graph",
          "Steam turbines: SFEE across a steam nozzle, D'laval Turbine, nozzle and blade efficiencies, need for compounding, curtis stage, Rateau turbine, Parson's reaction turbine"
        ],
        "references": [
          "Yahya S.M., Turbines Compressors and Fans, 4th ed., Tata Mc. Hill, New Delhi, 2017",
          "Seppo A. Korpela, Principles of Turbomachinery, John Wiley & Sons Ltd, 2nd Ed, 2019",
          "Dixon S.L., Fluid Mechanics, Thermodynamics of Turbomachinery, Pergamon, 6th Ed, 2010",
          "V Kadambi, An Introduction to Energy Conversion: Turbomachinery - Vol. III, New Age International Private Limited, 2011",
          "Maneesh Dubey, BVSSS Prasad, ArchanaNema, Turbomachinery, 1st Ed, McGraw Hill Education, 2018"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2225",
        "title": "MANUFACTURING PROCESSES - II",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Hot and Cold Working of metals, forging processes, Rolling of metals",
          "Principle of rod and wire drawing, Tube drawing, Principles of Extrusion",
          "Broaching, Planing, Slotting, Shaper machines. Jigs and Fixtures, Types",
          "Analysis of locating and clamping methods. Micro finishing Processes",
          "Chipless machining, Internal and external thread rolling, Spline rolling",
          "Powder Metallurgy: Methods of powder production, Properties of powdered metals",
          "Surface Coating, Powder Coating, CVD, PVD, Thermal Spray, Sputtering, Hard facing",
          "Rapid prototyping, Fused Deposition Modeling, Stereolithography, Laminated object manufacturing, Selective Laser Sintering, Selective Powder Binding",
          "Economics of Machining, optimization of cutting parameters and its calculations"
        ],
        "references": [
          "Rajput R. K., A Text book of Manufacturing Technology, Laxmi Publications Private Limited, 2011",
          "Khanna O.P., A text book of Production Technology (Vol1&2), Dhanpat Rai Publications, 2011",
          "Rao P. N., Manufacturing Technology, Tata McGraw-Hill Publishing Company Limited, 2006",
          "Serope Kalpakejian and Steven Schmid R, Manufacturing Engineering and Technology, Pearson Education, 2005",
          "Paul DeGarmo E., Black J. T. and Ronald Kohser A, Materials and Process in Manufacturing, John Wiley and Sons, 2004",
          "Lal M.&Khanna O. P., Foundry Technology, Dhanpat Rai & Sons, 1991",
          "Jain R. K., Production Technology, Khanna Publishers, 2001",
          "Chua C. K, Leong K F and Lim C S, Rapid Prototyping: Principles and Applications, World Scientific, 2003",
          "Sharma P. C., A Textbook of Production Technology, S. Chand Publishing, 2007"
        ],
        "flags": [
          "missing_semester",
          "structure_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "MIE 2241",
        "title": "MECHANICS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab"
        ],
        "syllabus": [
          "Fluid Mechanics: Coefficient of discharge for Orifice meter and Venturimeter, friction factor for pipes, Reynolds apparatus",
          "Fluid Machines: Performance characteristics of Pelton turbine, Francis turbine, Centrifugal pump and Gear pump",
          "Strength of materials: Uniaxial test on ductile and brittle material, Hardness tests on metals: Vicker, Brinell and Rockwell, Torsion Test on Circular Shaft, Bending test on beam of uniform cross section and beam of uniform strength, Impact tests on metals: Charpy and Izod"
        ],
        "references": [
          "Kumar K. L., Engineering Fluid Mechanics, S. Chand Publishing, New Delhi, 2016",
          "C.P. Kothandaraman, Fluid Mechanics and Machinery, 3rd ed., New Age International Publishers, 2012",
          "R.K. Bansal, A Textbook of Strength of Materials: Mechanics of Solids, 6th ed., Laxmi publications, 2018"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 5,
        "code": "MIE 2242",
        "title": "WORKSHOP PRACTICE - II",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Spur Gear cutting",
          "Helical Gear cutting",
          "Plain machining",
          "Straight Slot machining & Taper Slot machining using shaper",
          "Face milling",
          "Drilling and Tapping",
          "Contouring, slotting, Pocketing and boring using Vertical Machining Center",
          "Surface Grinding",
          "Cylindrical Grinding",
          "Electro Discharge Machining",
          "Machining using Wire EDM"
        ],
        "references": [
          "Hajra C. S. K., Hajra C. A. K. and Nirjhar Roy, Elements of Workshop Technology, Vol. II, Media Promoters and Publishers Pvt. Ltd., 2003.",
          "Peter S., CNC Programming Hand book, Industrial Press, New York, 2000."
        ],
        "flags": [
          "credits_discrepancy"
        ]
      },
      {
        "sem": 3,
        "code": "HUM 3021",
        "title": "ENGINEERING ECONOMICS AND FINANCIAL MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Time value of money, Interest factors for discrete compounding, Nominal & effective interest rates, Present and future worth of Single, Uniform, and Gradient cash flow. Related problems and case studies.",
          "Bases for comparison of alternatives, Present worth amount, Capitalized equivalent amount, Annual equivalent amount, Future worth amount, Capital recovery with return, Rate of return method, Incremental approach for economic analysis of alternatives, Replacement analysis.",
          "Break even analysis for single product and multi product firms, Break even analysis for evaluation of investment alternatives.",
          "Physical & functional depreciation, Straight line depreciation, declining and double declining balance method of depreciation, Sum-of-the-Years Digits, Sinking Fund and Service Output Methods, Case Study.",
          "Balance sheet and profit & loss statement. Meaning & Contents.",
          "Ratio analysis, financial ratios such as liquidity ratios, Leverage ratios, Turn over ratios, and profitability ratios, Drawbacks.",
          "Safety and Risk, Assessment of Risk and safety, Case study, Risk Benefit Analysis and Reducing Risk."
        ],
        "references": [
          "Chan S. Park, \"Contemporary Engineering Economics\", 4th Edition, Pearson Prentice Hall, 2007.",
          "Thuesen G. J, “Engineering Economics”, Prentice Hall of India, New Delhi, 2005.",
          "Blank Leland T. and Tarquin Anthony J., “Engineering Economy”, McGraw Hill, Delhi, 2002.",
          "Prasanna Chandra, “Fundamentals of Financial Management”, Tata McGraw Hill, Delhi, 2006."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "MIE 3124",
        "title": "DESIGN FOR MANUFACTURE AND ASSEMBLY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Essential factors of product design, morphology of design, producibility requirements in design, Design for X, selection of materials and processes",
          "Design for casting and forging: Sand casting-design rules, Investment casting design guidelines, design guidelines for forging",
          "Metal Extrusion: Design recommendation for metal extrusion, stamping, fine blanked parts, Rolled formed section",
          "Design for machining: Design guidelines for turning, drilling, reaming, slotting, milling, grinding, and heat treatment",
          "Design for die-casting and injection moulding: Design guidelines",
          "Design for sheet metal working and powder metal processing: Design guidelines",
          "Design for joining process: design recommendation for welding process, design for solder and brazed assembly",
          "Design for adhesively bonded assemblies: design recommendations",
          "Design for additive manufacturing: design rules for additive manufacturing",
          "Design for assembly: importance of DFA, basic DFA guidelines, product design for manual assembly, design for high-speed automatic assembly and robot assembly",
          "Process engineering: Importance of Fits, tolerance and surface finish in design, manufacturing drawings"
        ],
        "references": [
          "Geoffrey Boothroyd, Peter Dewhurst and Winston A. Knight, Product Design for Manufacture and Assembly, CRC Press, 2011.",
          "James G. Brala, Design for Manufacturability Handbook, McGraw Hill, New York, 1999.",
          "Kevin Otto and Kristin Wood, Product Design, Pearson Education, Delhi, 2001.",
          "Chitale A. K. and Gupta R. C., Product Design and Manufacturing, Prentice Hall of India Pvt. Ltd., New Delhi, 2005.",
          "George E. Dieter, Engineering Design, McGraw Hill Book Co., Singapore, 2000.",
          "Karl T. Ulrich & Steven D. Eppinger, Product Design and Development, Irwin McGraw Hill, Boston, 2003."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 3,
        "code": "MIE 3125",
        "title": "GREEN ENERGY TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Solar energy: Introduction, principle of conversion of solar radiation into heat, types of solar collectors and their conversion, applications of solar energy conversion –thermal, photovoltaics, hydrogen production",
          "Wind energy: Introduction, principle of wind energy conversion, classification of wind turbines, components and materials, wind farm and site selection, applications of wind energy conversion – grid connectivity, standalone, offshore, industries",
          "Energy from Biomass: Introduction to biomass conversion – wet and dry processes, anaerobic digestion and biogas generation, gasification and pyrolysis, hydrothermal carbonization",
          "Energy from Fuel Cells: Introduction, design and operation of fuel cells, classification of fuel cells, advantages and disadvantages, performance characteristics and efficiency, application of fuel cells",
          "Hydrogen energy: Introduction, production of hydrogen from various methods – electrical, thermal, thermochemical, solar energy, storage and transportation of hydrogen energy, utilization of hydrogen gas"
        ],
        "references": [
          "Duffie J. A. and Beckman W. A., Solar Energy Thermal Processes, 4th ed., John Wiley and Sons, Inc., 2013",
          "Rai G. D., Non-Conventional Energy Sources, Khanna Publishers, 2006",
          "Mittal K. M., Non-Conventional Energy Systems – Principles, Progress and Prospects, Wheeler Publications, 1997"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "MIE 3126",
        "title": "HEAT TREATMENT OF METALS AND ALLOYS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Iron-Carbon equilibrium diagram and fundamentals of heat treatment",
          "Heat treatment processes viz. Annealing, Normalising, Hardening, Tempering, etc.",
          "Case and surface hardening treatments, Age hardening and thermomechanical treatments",
          "Steel specification, classification and heat treatment of steels and cast iron",
          "IS and AISI classification of steel",
          "Heat treatment and application of non-ferrous metals and alloys, Aluminium alloys, Titanium alloys, Copper alloys",
          "Defects, Causes and remedies in heat treatment"
        ],
        "references": [
          "Rajan T. V., Sharma C.P and Alok Sharma, Heat treatment principles and techniques, PHI Publication, 1999",
          "Bolton W., Engineering materials technology, Heinmann Newness, 2001",
          "Thelning K. E., Steel and its heat treatment, Butterworth/Heinemann, 2000",
          "Romesh C. Sharma, Principles of Heat Treatment of Steels, New Age International (P) Limited, 1996",
          "Vijendra Singh, Heat Treatment of Metals, Standard Publishers Distributors, 2012",
          "Avner S. H., Introduction to Physical Metallurgy, 3rd ed., McGraw Hill, 2004",
          "William D. Callister, Materials Science and Engineering, John Wiley & Sons, 2007"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "ELE 3127",
        "title": "FOUNDATIONS OF EV & HYBRID VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Principles for Electric Vehicles: EV Industry, EV Technology and Automotive Revolution, Electrical Engineering for EV, Battery Technology",
          "Control system for Electric Vehicles: Motor and Controller Systems, EV Numerical Calculations, EV Charging Infrastructure, Practical session - Well-to-wheel analysis of EV architecture",
          "Essentials for Electric Vehicles: Electrical Requirement, Power Distribution Specifications, Electronic Control System, Practical session - EV connection and system analysis",
          "Types of components in Electric Vehicles: EV Standards and Classifications, Selection for Electrical and Electronic Components, Practical session - EV hardware components",
          "Principles for Hybrid Vehicles: Introduction to Hybrid Vehicles, Battery Chemistry, Efficiency, Definition and Parameters for Hybrid Systems, Electric Motors, Generators and Power Electronics for Hybrid Systems, Control Systems, Hybrid Electric Vehicle Operation, Practical session - Numerical study on powertrain sizing of HEV"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", Wiley, 2nd ed, 2012, ISBN: 978-1-119-94273-3",
          "Iqbal Husain, \"Electric and Hybrid Vehicles: Design Fundamentals\", Routledge, 3rd Ed, 2021, ISBN: 9780367693930",
          "Muhammad Ehsani, Mehrdad Ehsani, and Ali Emadi, \"Electric Vehicle Systems Architecture and Standardization Needs\", Reports of the PPP European Green Vehicles Initiatives, Springer, 2015",
          "Ali Emadi, \"Advanced Electric Drive Vehicles\", CRC Press, 1st Ed, 2014, ISBN: 9781138072855",
          "Rodrigo Garcia-Valle and João A. Peças Lopes, “Electric Vehicle Integration into Modern Power Networks\", Springer, 2013, ISBN: 978-1461401339",
          "Chris Mi and M. Abul Masrur, “Hybrid electric Vehicles, Principles and Applications with Practical perspectives”, WILEY, 2nd Ed, 2017, ISBN: 978-1-118-97054-6",
          "\"Introduction to Electric Vehicles\" - offered by IIT Delhi on NPTEL Link: https://archive.nptel.ac.in/courses/108/106/108106170/"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MIE 3121",
        "title": "GEOMETRIC MODELLING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to computer graphics, Non-interactive versus interactive computer graphics",
          "Graphic Standards and mode of data transfer: Neutral file formats",
          "Geometric co-ordinate systems and Display co-ordinate systems",
          "Geometrical Transformation techniques: 2D Translation, Rotation, Scaling and Reflection principles",
          "Principle of concatenated transformation and homogenous coordinate system",
          "Geometric modelling of Curves: Analytical Curve modelling and Synthetic Curve modelling. Curve manipulation techniques",
          "Geometric modelling of Surfaces: Analytical surface modelling and Synthetic surface modelling Surface manipulation techniques",
          "Geometric modelling of Solids: Solid modelling techniques - Boundary Representation, Constructive Solid Geometry, Analytical Solid Modelling, Sweep Representation, Pure Primitive Instancing. Solid manipulation techniques"
        ],
        "references": [
          "Groover Mikell P. and Zimmers. Emory W., Computer Aided Design and Manufacturing, Prentice Hall of India, New Delhi, 2000",
          "Rao P.N., CAD/CAM, Tata McGraw Hill Publishing Company Ltd., New Delhi, 2005",
          "Ibrahim K Zeid, CAD/CAM Theory and Practice, Tata McGraw Hill, New Delhi, 2009",
          "David F Rogers and J Alan Adams, Mathematical Elements for Computer Graphics, Tata McGraw Hill, New Delhi, 2002",
          "Ibrahim Zeid and R Sivasubramanian, CAD/CAM Theory and Practice, TATA Mc Graw Hill Education Private Limited, New Delhi, Special Indian Edition 2009",
          "Chougule N K, CAD/CAM/CAE, SCITECH Publications (India) Private Limited, Chennai, 2010"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 3122",
        "title": "FINITE ELEMENT METHODS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Finite Element Method",
          "steps of FEM",
          "advantages/disadvantages and applications of FEM",
          "discretization and element types",
          "matrix algebra",
          "efficient storage of Banded matrices",
          "matrix solution methods for system of simultaneous equations",
          "Eigen value problem",
          "one/two point Gauss quadrature method of numerical integration",
          "basics of theory of elasticity",
          "plane stress/plane stress/axisymmetric problems",
          "minimum potential energy principle",
          "Rayleigh-Ritz's method",
          "Galerkin's method",
          "Basic concepts of FEM",
          "convergence",
          "Pascal's triangle",
          "higher order quadrilateral/triangular elements",
          "shape functions for Lagrange/Serendipity elements and CST element",
          "application of direct stiffness method for one dimensional axially loaded bar and for one dimensional fluid element",
          "Elimination and Penalty methods of handling boundary conditions",
          "isoparametric formulation of 1D bar element",
          "plane/space truss element",
          "plane/space frame element",
          "triangular element",
          "quadrilateral element",
          "axisymmetric triangular element",
          "tetrahedral and hexahedral elements",
          "Application of the Galerkin's residual method to 1-D structural problem"
        ],
        "references": [
          "Chandrupatla T. R. and Belegundu A. D., Introduction to Finite Elements in Engineering, Pearson Education, New York, 2001.",
          "Logan Daryl L., A First course in Finite Element Method, 4th ed., Thompson Ltd, India, 2007.",
          "Hutton David V., Fundamentals of Finite Element Analysis, Tata McGraw Hill, India, 2005.",
          "Reddy J. N., An Introduction to Finite Element Method, 3rd ed., McGraw Hill International Edition, New York, 2006.",
          "Segerlind Larry J., Applied Finite Element Analysis, 2nd ed., John Wiley, New York, 1984.",
          "Desai C. S. and Abel J. F., Introduction to the Finite Element Method: a numerical method for engineering analysis, Van Nostrand Reinhold Co., 1971.",
          "Krishnamoorthy C. S., Finite Element Analysis – Theory & Programming, Tata McGraw-Hill Education, 1994."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "MIE 3123",
        "title": "HEAT AND MASS TRANSFER",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Modes of heat transfer, governing laws and its derivatives, overall heat transfer coefficient",
          "Steady state conduction: General heat conduction equation, heat flow through plane and composite wall, cylinder and sphere, critical thickness of insulation, temperature dependent thermal conductivity, plane, cylinder and sphere with uniform rate of internal heat generation, Heat transfer from extended surfaces, fin efficiency and effectiveness",
          "Transient conduction: Lumped system analysis, Biot and Fourier number, time constant, transient heat conduction in large plane walls",
          "Convection heat transfer: Velocity and thermal boundary layer, dimensional analysis, free and forced convection heat transfer over flat plate, cylinder, sphere and in tubes",
          "Boiling and condensation: Boiling regimes, correlations, film and drop-wise condensation, Nusselt theory",
          "Heat exchangers: types, analysis of heat exchangers – LMTD and NTU method",
          "Radiation: Characteristics, governing laws, radiation intensity, heat transfer between black surfaces and between gray surfaces, radiation shields",
          "Mass transfer: Mass diffusion, Fick's law, diffusion of two species in a stationary medium, steady mass diffusion through a wall, simultaneous heat and mass transfer"
        ],
        "references": [
          "Yunus A. Cenzel and Afshin J. Ghajar, Heat and Mass transfer, 6th ed., Tata McGraw Hill, 2020",
          "Thirumaleshwar M., Fundamentals of Heat and Mass Transfer, 1st ed., Pearson Education, 2006",
          "Rajput R. K., Heat and Mass Transfer, 7th ed., S Chand Publishing, 2019",
          "Theodore L. Bergman, Adrienne S. Lavine, Frank P. Incropera, David P. DeWitt, Fundamentals of Heat and Mass Transfer, 8th Ed, Wiley Publications, 2018",
          "R C Sachdeva, Fundamentals of Engineering Heat and Mass Transfer (SI Units), New Age International Private Limited, 6th Ed, 2022",
          "Holman J. P. and Bhattacharya Souvik, Heat Transfer, 10th ed., Tata McGraw Hill, 2017"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "MIE 3141",
        "title": "MECHANICAL LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab"
        ],
        "syllabus": [
          "Determination of fuel Characteristics such as viscosity, flash and fire points",
          "Carrying out the performance test in a SI and CI engines",
          "Performance test of an air compressor and a blower",
          "Determination of Compression ratio of an IC engine",
          "Determination of dryness fraction of steam using Boy's Gas calorimeter",
          "Sand testing",
          "Calibration of pressure gauges and governors",
          "Balancing of revolving masses"
        ],
        "references": [
          "Ganeshan V., Internal Combustion Engines, 4th ed., Tata McGraw Hill Education Private Limited, New Delhi, 2017",
          "Mathur M. L., and Sharma R. P., Course in Internal Combustion Engines, 8th ed., Dhanpath Raj Publishers, New Delhi, 2010",
          "Rattan S. S., Theory of Machines, 4th ed., Tata Mc-Graw Hill Publishers Pvt. Ltd, New-Delhi, 2014",
          "Cengel, Thermodynamics and Heat Transfer, 2nd ed., McGraw Hills, New York, 2008",
          "Nag. P. K., Engineering Thermodynamics, 6th ed., Tata McGraw Hills, New Delhi, 2017"
        ],
        "flags": [
          "missing_semester",
          "credits_c_mismatch"
        ]
      },
      {
        "sem": 6,
        "code": "MIE 3142",
        "title": "METROLOGY LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Measuring instruments and gauges",
          "Screw thread measurements",
          "Measurement of effective diameter of external screw threads",
          "Comparators",
          "Gear measurement",
          "Radius and angle measurement",
          "Calibration of Micrometer and Vernier caliper",
          "Surface texture and straightness measurement",
          "Use of Profile projector",
          "Coordinate Measuring Machine and Interferometer"
        ],
        "references": [
          "Jain R. K., Engineering Metrology, Khanna Publishers, 1997.",
          "Gupta I. C., Engineering Metrology, Dhanpat Rai Publications, 1997.",
          "Raghavendra N. V., Krishnamurthy L., Engineering Metrology and Measurements, Oxford University Press, 2013."
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "HUM 3022",
        "title": "ESSENTIALS OF MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Definition of management and systems approach, Nature & scope",
          "The Functions of managers, Principles of Management",
          "Planning: Types of plans, steps in planning, Process of MBO, how to set objectives, strategies, policies and planning premises, Strategic planning process and tools",
          "Nature and purpose of organizing, Span of management, factors determining the span, Basic departmentation, Line and staff concepts, Functional authority, Art of delegation, Decentralization of authority",
          "HR theories of planning, Recruitment, Development and training",
          "Theories of motivation, Special motivational techniques",
          "Leadership – leadership behavior & styles, Managerial grid",
          "Basic Control Process, Critical Control Points & Standards, Budgets, Non-budgetary control devices, Profit and Loss control, Control through ROI, Direct, Preventive control",
          "PROFESSIONAL ETHICS - Senses of Engineering Ethics, Variety of moral issues, Types of inquiry, Moral dilemmas, Moral Autonomy, Kohlberg's theory, Gilligan's theory, Consensus and Controversy, Models of professional roles, Theories about right action, Self-interest, Customs and Religion, Uses of Ethical Theories",
          "GLOBAL ISSUES - Managerial practices in Japan and USA & application of Theory Z, The nature and purpose of international business & multinational corporations, unified global theory of management, Entrepreneurship and writing business plans, Multinational Corporations, Environmental Ethics, Computer Ethics, Weapons Development, Engineers as Managers, Consulting Engineers, Engineers as Expert Witnesses and Advisers, Moral Leadership, Code of Conduct, Corporate Social Responsibility"
        ],
        "references": [
          "Harold Koontz & Heinz Weihrich (2020),\"Essentials of Management\", McGraw Hill, New Delhi.",
          "Peter Drucker (2004), \"The practice of management\", Harper and Row, New York.",
          "Vasant Desai (2007), \"Dynamics of entrepreneurial development & management\", Himalaya Publishing House.",
          "Poornima M Charantimath (2006), \"Entrepreneurship Development\", Pearson Education."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "MIE 3221",
        "title": "FATIGUE AND FRACTURE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Fatigue and fracture overview, deformation and failure modes of engineering materials, fatigue types, design philosophies, mechanism",
          "High-cycle fatigue, fatigue loads and tests, stress-life (S-N) curves, mean stress effects, constant life diagrams, influencing factors, stress concentration and notch effects, life estimation using S-N approach, cumulative damage theories",
          "Low-cycle fatigue, monotonic and cyclic stress-strain behavior, CSSC determination, stress-plastic strain relationship, cyclic deformation and crack initiation in ductile and brittle solids, transition life, strain life equations, mean stress effects, notch strain analysis, examples of life estimation",
          "Linear elastic fracture mechanics, fracture modes and mechanisms, Griffith's analysis, energy release rate, elastic crack tip fields, stress and displacement field, stress intensity factor, crack tip plasticity, plastic zone shape and size, R-curves, fracture toughness",
          "Fatigue fracture mechanics, dynamic crack growth, crack closure and fatigue threshold, effect of variable amplitude and over loading cycles, prediction of life of a structural component, generation of crack growth plots"
        ],
        "references": [
          "Bannantine Julie A, Jess J Comer and Handrock James L, Fundamentals of Metal fatigue and Analysis, Prentice Hall, Upper Saddle River, NJ, 1990",
          "Dowling Norman E, Mechanical Behavior of Materials, Fourth Edition, Pearson Publications, USA, 2017",
          "Stephens Ralph I, Fatemi Ali, Stephens Robert R and Henry, Metal fatigue in Engineering, Second Edition, John Wiley and Sons Inc, New York, 2001",
          "Suresh S, Fatigue of Materials, Second Edition, Cambridge University Press, UK, 1998",
          "Prashant Kumar, Elements of Fracture Mechanics, McGraw Hill Education Private Limited, 2013",
          "Anderson T. L., Fracture Mechanics-Fundamentals and applications, Third Edition, CRC Press, London, 2017"
        ],
        "flags": [
          "sem_inferred_from_code"
        ]
      },
      {
        "sem": 3,
        "code": "MIE 3222",
        "title": "REFRIGERATION AND AIR CONDITIONING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Basic concepts and Air refrigeration cycles: Basic terminologies, uses of refrigeration and air conditioning, different refrigeration cycles, air refrigeration cycles for aircrafts",
          "Vapour compression and absorption refrigeration systems: Thermodynamic analysis, absorption refrigeration, absorption versus compression, refrigerants for vapor compression and absorption systems",
          "Other refrigeration cycles: Thermoelectric refrigeration, Vortex tube refrigeration, Steam jet refrigeration",
          "Psychrometrics: Properties of air-vapour mixtures, psychrometric charts, process involving air-vapour mixtures",
          "Air Conditioning: Air-conditioning systems and applications- Unitary and central systems. Summer and winter air conditioning systems. Cooling load calculations: Air conditioning load estimation, sensible and latent heat gain from internal and external sources, RSHF, RLHF, GTHF"
        ],
        "references": [
          "Arora S. C. and Domkondwar S., Course in Refrigeration and Air-conditioning, Danpath Rai. New Delhi, 2018",
          "Prasad Manohar, Refrigeration and Air-conditioning, 3rd ed., New Age International Pvt. Limited. New Delhi, 2021",
          "Rex Miller, Mark Miller, Air Conditioning and Refrigeration, McGraw Hill Professional, 2006",
          "Dossat R. J., Principles of Refrigeration, 4th ed., Pearson Education India, 2002",
          "Alfred F. Bracciano, Andrew D. Althouse, Carl H. Turnquist, Daniel C. Bracciano, Gloria M. Bracciano, Modern Refrigeration and Air Conditioning, 21st Ed, G-W publishers, 2021"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MIE 3223",
        "title": "MACHINE TOOL TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Machine Tool Drives and Mechanisms",
          "Machine tool drives: individual drive, Group drive",
          "Regulation of Speeds and Feeds: Stepped Regulation of Speeds",
          "Flow Diagram",
          "Structural diagram",
          "Ray diagram",
          "Speed diagram",
          "Machine tool structures: Basic Design procedure",
          "Guide ways",
          "Spindles",
          "Spindle assembly of lathe",
          "Milling & Drilling machines",
          "Design of Spindle",
          "Requirements of Spindle Supports",
          "Selection of sliding and antifriction bearings",
          "Vibration of machine tools"
        ],
        "references": [
          "Mehta N. K., Machine Tool Design & Numerical control, Tata McGraw Hill Publishing Co. Ltd., 2012",
          "Sen G.C., Bhattacharya I., Principles of Machine Tools, New Central Book Agency, 2009",
          "C. M. T. I., Machine Tool Design Handbook, Tata McGraw Hill Publishing Co. Ltd., 2004",
          "Pal D. K., BASU S. K., Design of Machine Tools, Oxford and IBH, 2008",
          "George Schlesinger, Testing Machine Tools, Deutsche Nationalbibliothek, 2017"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "ELE 3225",
        "title": "AUTOMOTIVE MECHANICS FOR ELECTRIC VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Vehicle Dynamics Fundamentals, Tire Mechanics and Dynamics, Suspension Systems, Braking Systems, Aerodynamics, Powertrain Systems, Vehicle Stability Control, Vehicle Safety, Vehicle Dynamics Simulation, Electric and Hybrid Vehicle Dynamics, Practical session - EV Dynamics & calculations",
          "Introduction to Automotive Sketching Software, Overview of Vehicle Design Process and Automotive Sketching, Basic Sketching Techniques and Tools in the Software, Sketching Car Exteriors, Interiors and Details, Creating Different Views and Angles of the Vehicle, Rendering and Presenting the Final Sketches, Understanding Proportions, Perspectives and Shapes in Automotive Sketching, Creating Sketches for Different Vehicle Types (Sedans, SUVs, and Trucks), Tips and Tricks for Automotive Sketching in the Software",
          "Introduction to EV Technology and Its Benefits, Basic Vehicle Design Principles, Design and Modelling of Chassis and Frame, Suspension Systems, Design and Modelling of Braking and Steering Systems, Design and Modelling of Electrical Components for EVs, Battery Pack Design and Modelling for 2, 3 and 4 Wheelers, Motor and Drivetrain Design and Modelling for 2, 3 and 4 Wheelers, Design and Modelling of Wheels and Tires for 2, 3 and 4 Wheelers, Testing and Simulation of Vehicle Performance Using Solid Works, Design for Manufacturability and Assembly Considerations, Sustainability and Environmental Impact Considerations in EV Design, Practical session - EV hardware components walkthrough",
          "Introduction to MSC Adams Software and Its Capabilities, Setting Up the Modelling Environment in MSC Adams, Multi-body Dynamics Principles and Application to Vehicle Systems Modelling, Vehicle Suspension Systems Modelling, Vehicle Steering Systems Modelling, Vehicle Braking Systems Modelling, Practical session - EV Component design & modeling",
          "Tire Force and Characteristics Modelling, Vehicle Dynamics Analysis Including Simulating Ride and Handling, Vehicle Stability and Rollover Events, Optimisation Techniques for Vehicle Designs Using MSC Adams, Integration of MSC Adams Models with Other Software Tools for System-level Simulations and Analysis, Practical session - EV body design analysis"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", Wiley, 2nd ed, 2012, ISBN: 978-1-119-94273-3",
          "Du, H., Cao, D., & Zhang, H. (n.d.). “Modelling, Dynamics, and Control of Electrified Vehicles\", Woodhead Publishing, 2017, ISBN-13: 9780128127865",
          "Zaman N., “Automotive Electronics Design Fundamentals\", Springer",
          "Gianfranco Pistoia, “Electric & Hybrid Vehicles\", Elsevier, 1st ed, 2010, ISBN: 9780444638250",
          "Chau, K. T., “Electric Vehicle Machines and Drives: Design, Analysis and Application\", John Wiley and Sons, Inc., 2015, ISBN-13: 9781118752524",
          "Ehsani, Mehrdad, “Modern Electric, Hybrid Electric, and Fuel Cell Vehicles\", CRC, 2019, ISBN-13: 9780367137465",
          "Hughes, Austin, “Electric Motors and Drives\", Newnes (an Imprint of Butterworth-Heinemann Ltd), 2019, ISBN-13: 9780081026151",
          "Chris Ni and M. Abul Masrur, “Hybrid electric Vehicles, Principles and Applications\", WILEY, 2nd Ed, 2017, ISBN: 978-1-118-97054-6",
          "\"Introduction to Electric Vehicles\" - offered by IIT Delhi on NPTEL Link: https://archive.nptel.ac.in/courses/108/106/108106170/"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MIE 3224",
        "title": "MECHANICAL VIBRATION",
        "credits": {
          "l": 4,
          "t": 0,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to vibration: Importance, scope, definition, terminology, limits of vibration severity",
          "Single degree free vibration: Natural frequency by Newton's Classical method and Energy method, Longitudinal, lateral and torsional vibration, Pendulum and pulley systems",
          "Damped free vibration: Influence of damping on Vibration, types of Viscous damping, Coulomb damping",
          "Forced vibration: system is subjected to harmonic excitation, rotating and reciprocating unbalance, force and displacement transmissibility, vibration isolation, whirling of shafts, critical speed of shaft",
          "Vibration measurement: Transducers, vibrometer, accelerometer, frequency measuring instruments, exciters, machine condition monitoring using vibration signals",
          "Two degree of freedom system: Natural frequencies and mode shapes of vibration by Classical method and Lagrange's generalized method, Dynamic vibration absorber, Centrifugal pendulum absorber",
          "Multi degree freedom system: Natural frequency of free vibration by Influence coefficient method, Matrix iteration method, Rayleigh's method, Dunkerley's method, Stodola method and Holzer's method"
        ],
        "references": [
          "Singirisu Rao S., Mechanical Vibration, Pearson Education, Delhi, 5th ed., 2011",
          "S. Graham Kelly, Fundamentals of Mechanical Vibrations, McGraw-Hill, Singapore, 2nd ed., 2000",
          "Rao J. S. and Gupta K., Introductory Course on Theory and Practice of Mechanical Vibrations, New Age Publishers, 2nd ed., 1999",
          "Groover G. K., Mechanical Vibrations, Nem Chand and Bros, 8th ed., 2009",
          "Seto W. W., Theory and Problems in Mechanical Vibrations, McGraw-Hill Publication, 1989"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 3,
        "code": "MIE 3225",
        "title": "COMPUTATIONAL FLUID DYNAMICS",
        "credits": {
          "l": 4,
          "t": 0,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Numerical, experimental and analytical methodology, advantages, limitations, need for CFD, CFD process, equilibrium and marching problems, mathematical behavior of Parabolic, Hyperbolic and Elliptic PDE, governing equations of flow and energy, boundary condition and its types, demonstration of CFD software tool",
          "Finite Difference Method: Finite difference representation of PDE, Taylor's series expansion, truncation, discretization and round-off errors, consistency, stability, polynomial fitting, finite difference method for steady and unsteady heat conduction",
          "Finite Volume Method: Finite volume method for 1D and 2D steady state diffusion problems, FVM for Convection-diffusion problems: Steady 1D convection-diffusion, discretization schemes-Upwind, central, power law and hybrid, QUICK, properties of discretization schemes, Flow simulation for steady and unsteady turbulent internal flow using different discretization schemes",
          "Pressure-Velocity Coupling: Need for Staggered grid, SIMPLE, SIMPLER, SIMPLEC, PISO algorithm",
          "Turbulence and its modelling: Concept of turbulence, RANS, turbulence models, Flow simulation for turbulent flow over flat plate and pipes using turbulence models"
        ],
        "references": [
          "Anderson Jr. J. D., Computational Fluid Dynamics, Tata McGrawHill, 2013.",
          "Versteeg H., Malalasekera W., An Introduction to Computational Fluid Dynamics: The Finite Volume Method, 2nd ed., PHI, 2007.",
          "Ghoshdastidar P. S., Computational Fluid Dynamics and Heat Transfer, 1st ed., Cengage Learning, 2017.",
          "Muralidhar K., Sundarrajan T., Computational Fluid Flow and Heat Transfer, Narosa Publishing House, 2014."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 3,
        "code": "MIE 3226",
        "title": "AUTOMATION IN MANUFACTURING",
        "credits": {
          "l": 4,
          "t": 0,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "CNC Machines: Design considerations in CNC Machines, Methods of improving machine accuracy and productivity, Machine structure, Guideways, Spindle and Feed drives, Spindle Bearings, Interpolators CNC Toolings, Distributed Numerical Control, Adaptive Control Machining System, Coordinate measuring machines, NC programming for Turning Center and Machining Center by Manual method, CNC programming with interactive graphics",
          "Industrial Robotics Physical configurations, Manipulator Kinematics, Robot programming, End effecters, Work cell design, Work cell control and interlock, Robotic sensors, Robotic applications",
          "Group Technology, FMS and CIM, Computer aided Process planning, Material requirement planning",
          "Capacity planning, Shop floor control, Automated data collection systems"
        ],
        "references": [
          "Yoram Koren and Ben Uri J., Numerical Control of Machine Tools, Khanna Publishers, New Delhi, 2005",
          "Groover Mikell P., Automation, Production Systems, and Computer Integrated manufacturing, Prentice Hall of India, New Delhi, 2003",
          "Groover Mikell P. and Zimmers Emory W., Computer Aided Design and Manufacturing, Prentice Hall of India, New Delhi, 2003",
          "Radhakrishnan P., Computer Numerical Control Machines, New Central Book Agency (P) Ltd., Kolkata, 2004"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "MIE 3231",
        "title": "EV BATTERY TECHNOLOGY AND THERMAL MANAGEMENT",
        "credits": {
          "l": 4,
          "t": 0,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Primary Batteries",
          "Secondary Batteries",
          "Lithium-ion batteries; Fundamentals, Materials, Electrode preparation",
          "Battery Assembly",
          "Testing",
          "Failure Analysis",
          "Safety Issues",
          "State of Charge and State of Health Estimation",
          "Cell Balancing",
          "Protection",
          "Operational Mechanisms of Lithium-Ion Batteries",
          "Electrochemical Principles and Reactions",
          "Factors Affecting Battery Performance",
          "Properties of electrode material",
          "Dendrite Formation",
          "Battery Parameters",
          "Lithium-Ion Characteristics",
          "Rate of Heat Generation",
          "Thermal Runaway Battery Management System",
          "Battery Pack Design & Thermal Analysis",
          "Overview of Battery & Battery Management System",
          "Electrical Design",
          "Mechanical Design",
          "Heat Transfer",
          "Thermal Design of Battery Pack",
          "Battery Pack Assembly and Test",
          "Thermal Analysis of Battery Pack",
          "Introduction to EV Powertrain",
          "Overview, Architecture, and Components of EV Power train",
          "Thermal Management of EV Powertrain",
          "Thermal Management Techniques for EV",
          "Selection of Cooling Technique",
          "Cooling Rates of Different Cooling Methods",
          "Selection Criteria",
          "Single-Phase Gas Flow and Heat Transfer",
          "Single-Phase Liquid Flow and Heat Transfer",
          "Direct and Indirect Liquid Cooling",
          "Liquid Immersion Cooling",
          "Cooling using Phase Change Materials"
        ],
        "references": [
          "Rahn, Christopher D., and Wang, Chao-Yang, “Battery Systems Engineering” John Wiley & Sons, Ltd, 2013.",
          "Beard, Kirby W., “Linden's handbook of batteries”. McGraw-Hill Education, 2019.",
          "Dhameja, Sandeep “Electric Vehicle Battery Systems” NEWNES, 2002.",
          "Glaize, Christian, “Lithium batteries and other electrochemical storage systems” John Wiley & Sons, 2013.",
          "Dincer, Ibrahim, Hamut, H.S., Javani, N., “Thermal management of electric vehicle battery systems” John Wiley & Sons, Ltd, 2016.",
          "Hayes, John G., Goodarzi, G. Abas, “Electric Powertrain: Energy Systems, Power Electronics and Drives for Hybrid, Electric and Fuel Cell Vehicles” John Wiley & Sons, Ltd, 2018."
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MIE 3241",
        "title": "FINITE ELEMENT METHODS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab"
        ],
        "syllabus": [
          "Analysis of Truss and Beams Using Ansys APDL",
          "2D Structural analysis using Ansys APDL",
          "3D Structure Analysis Using Ansys by importing CAD Model",
          "3D Structure and Thermal Analysis - Importing the CAD model to Ansys Workbench (Both steady-state and Transient Analysis) using Ansys Workbench",
          "Shell Analysis (Composite) using Ansys Workbench",
          "Modal and Harmonic Analysis Using Ansys Workbench",
          "CFD analysis using Ansys Workbench – 1 (External and Internal flow - Laminar and Turbulent)",
          "Fluid-Structure analysis using Ansys Workbench",
          "Explicit Dynamics",
          "Nonlinear Analysis of Structural application"
        ],
        "references": [
          "Chandrupatla T. R. and Belegundu A. D., Introduction to Finite Elements in Engineering, Pearson Education, New York, 2002.",
          "Logan Daryl L., A First course in Finite Element Method – Fourth India Edition, Thompson Ltd, India, 2007.",
          "Zahavi Eliahu, The Finite Element Method in Machine Design, Prentice Hall Inc, USA, 1992.",
          "Ramamurthy V., Computer Aided Mechanical Design and Analysis, Tata McGraw Hill, Delhi, 1997.",
          "Tickoo Sham, ANSYS workbench 14.0 for Engineers and designers Tutorial, New Delhi Dreamtech publisher, 2014.",
          "Chen Xiaolin Liu Yijun, Finite element modeling and simulation with ANSYS workbench, New York CRC Press, 2015."
        ],
        "flags": [
          "missing_sem",
          "credits_mismatch"
        ]
      },
      {
        "sem": 7,
        "code": "MIE 3242",
        "title": "HEAT TRANSFER AND SOLAR ENERGY LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Analysis of parallel and counter flow heat exchangers",
          "Heat transfer from a pin fin under free and forced convection",
          "determination of thermal conductivity of a metallic bar and insulating powder",
          "heat transfer through a composite wall",
          "determination of emissivity",
          "Stefan Boltzmann apparatus",
          "calibration of temperature measuring instruments",
          "Performance evaluation of air heater",
          "water heater",
          "box cooker",
          "paraboloid concentrator",
          "performance characteristics of a Photovoltaic module"
        ],
        "references": [
          "Holman J. P. and Bhattacharya Souvik, Heat Transfer, 10th ed., Tata McGraw Hill, 2017",
          "Cengel Yunus A. and Ghajar Afshin J., Heat and Mass transfer, 6th ed., Tata McGraw Hill, 2020",
          "Kalogirou Soteris A., Solar Energy Engineering, 2nd ed., Academic Press, 2014",
          "Sukhatme S. P. and Nayak J. K., Solar Energy, 4th ed., Tata McGraw Hill, 2017"
        ],
        "flags": [
          "credits_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4291",
        "title": "INDUSTRIAL TRAINING",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 0,
          "c": 1
        },
        "tags": [
          "core"
        ],
        "syllabus": [
          "Industrial training for a minimum period of 4 weeks during the vacation",
          "Submission of report to the department",
          "Presentation on training"
        ],
        "references": [],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4292",
        "title": "PROJECT WORK / PRACTICE SCHOOL",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 0,
          "c": 12
        },
        "tags": [
          "elective",
          "lab"
        ],
        "syllabus": [
          "Carry out project work in institution/industry/research LAB/institution of higher learning",
          "Minimum duration of 16 weeks",
          "Prepare a project report",
          "Make a presentation on the work carried out"
        ],
        "references": [],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4441",
        "title": "ADVANCED METROLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction",
          "End & line standards for length",
          "Airy & Bessel points",
          "photoelectric microscope and Moir fringe techniques",
          "Fixed & Indicating Gauges",
          "Taylor's principles of gauge design",
          "Comparators",
          "Pre-process",
          "In-process & Post process gauging",
          "Usage of LVDT & Capacitive type gauge heads",
          "Automatic inspection",
          "Measuring Machines",
          "Floating carriage diameter measuring m/c",
          "Universal measuring m/c",
          "Matrix internal diameter measuring machine",
          "Optical dividing head",
          "Coordinate measuring machine",
          "Design principles of measuring machines Abbe's rule",
          "Form Errors",
          "Evaluation of straightness, flatness & roundness",
          "Surface Finish",
          "stylus instrument (TALYSURF)",
          "M & E systems usage of interferograms",
          "Screw Threads",
          "Measurement of thread elements for internal & external threads",
          "progressive periodic, drunkenness and irregular pitch errors",
          "NPL pitch measuring machine",
          "Gears",
          "Measurement of tooth thickness, involute profile, pitch, concentricity and alignment",
          "Rolling gear test"
        ],
        "references": [
          "Jain R. K., Engineering Metrology, Khanna Publishers, 1997.",
          "ASTME, Hand Book of Industrial Metrology, Prentice Hall of India Pvt. Ltd., 1967.",
          "Gupta I. C., A Text Book of Engineering Metrology, Dhanpat Rai & Sons, 2018.",
          "Bosch John A., Giddings, and Dayton Lewis, Coordinate Measuring Machines and Systems, Marcel Dekker, 1999."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4442",
        "title": "APPLIED NUMERICAL METHODS FOR MECHANICAL ENGINEERS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to MATLAB Programming: MATLAB environment, Mathematical Operations, Good Programming practices",
          "Approximations and Errors: Round-off Errors, Truncation Errors, Total Numerical Error, Model Errors",
          "Roots Finding-Bracketing and Open methods: Roots in Engineering and Science, Newton-Raphson Method",
          "Linear Algebraic Equations: Gauss elimination, LU factorization, Cholesky factorization, Jacobi Method, Gauss-Seidel method",
          "Curve Fitting and Interpolation: Linear, polynomial and nonlinear Regression, Splines and piecewise interpolation",
          "Numerical Differentiation and Integration: Richardson Extrapolation, Derivatives of unequally spaced data, Partial Derivatives, The trapezoidal rule, Simpson's Rules, Higher-Order Newton-Cotes formulas, Numerical Integration of Functions-Romberg integration, Gauss quadrature",
          "Differential Equations: Initial and Boundary value problems, Euler's Method, Runge-Kutta Methods, Applications using relevant Case Studies"
        ],
        "references": [
          "Chapra S. C., Applied Numerical Methods with MATLAB for Engineers and Scientists, Indian Edition, McGraw Hill, 2012",
          "Mathews J. H. and Fink K. D., Numerical methods using MATLAB. Pearson Prentice Hall, 1999",
          "Ralston A. and Rabinowitz P., A First Course in Numerical Analysis, McGraw Hill, 2001",
          "Salvadori M. G. and Baron M. L., Numerical Methods in Engineering, Prentice Hall, 1961",
          "Singiresu S. Rao, Applied Numerical Methods for Engineers and Scientists, Prentice Hall, Inc., 2002"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4443",
        "title": "AUTOMATIC CONTROL ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Simple open and closed loop systems, concept of feedback, block diagrams, transfer functions",
          "Representation of Control Components and Systems Representation, differential equations for mechanical systems, electrical systems, hydraulic systems and thermal systems, Integrating devices, hydraulic servo motor, temperature control system, speed control system",
          "Block representation of system elements, Block diagram Reduction, Signal Flow Analysis",
          "Damping ratio and natural frequency, First order and second order system response to various input, Modes of control, characteristics of various controllers",
          "System type numbers and steady-state error, System stability criteria, stability of control system using Routh criteria",
          "Polar and rectangular plots for the frequency response, System analysis using polar plots (Nyquist criterion)",
          "System analysis using logarithmic plots: Bode diagrams: Stability analysis using Bode diagrams, System analysis using root locus plots: System compensation: Series and feedback compensation physical devices for system compensation",
          "Digital computer control: Concepts and control configurations",
          "State space analysis of control systems Analysis of systems, Concept of state, state variable and state model, state model of linear systems, Eigen Values, Transfer function derivation from the state model, Solution of time invariant state equation"
        ],
        "references": [
          "Norman S. Nise, Control Systems Engineering, Wiley India, 2015",
          "Katsuhiko Ogata, Modern Control Engineering, Prentice Hall, India, 2010",
          "Kuo B. C. and Golnarghi F., Automatic Control Systems, Wiley, India, 2009",
          "César Pérez López, MATLAB Control Systems Engineering, Springer, Apress Academic, 2014",
          "Harrison H. L. and Bollinger J. G., Automatic controls, 2nd ed., International Text Book Co. U.S.A, 1969",
          "Nagarth I. J. and Gopal M., A text book of control system engineering, New age International Publishers, 2021"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4444",
        "title": "BIOMECHANICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Biomechanics: Brief history, Contributions of Biomechanics to health science, Contributions of Biomechanics to the field of Mechanics",
          "Hemodynamics: Rheology of blood, Large artery hemodynamics, Small artery hemodynamic",
          "Sports biomechanics: Movement patterns – the essence of sports biomechanics, Qualitative and quantitative analysis of sports movements, forces and torques, The anatomy of human movement",
          "Biomechanics of respiratory system: Gross anatomy of the conducting airways and pulmonary vasculature, Anatomy of associated structures, Biomechanics of breathing, Mass transfer and particle transport in lungs",
          "Skeletal biomechanics: Introduction to bone, Biomechanics of cortical and trabecular bone, Fracture and failure mechanics, Mechanobiology, Structure of ligament, tendon and cartilage and its biomechanics",
          "Terrestrial locomotion: Jumping, Description of walking and running, Gait analysis",
          "Biomechanics of Cardiovascular system: Biomechanical hierarchy in cardiovascular physiology, Structure-function relationship in cardiovascular tissues, Biomechanical feedback in the cardiovascular system, Experimental and computational methods"
        ],
        "references": [
          "Fung Y. C., Biomechanics: motion, flow, stress, and growth, Springer Science & Business Media, 2013",
          "Oomens C., Brekelmans M., Loerakker S., and Baaijens F., Biomechanics: concepts and computation, Cambridge University Press, 2018",
          "Ethier C. R., and Simmons C. A., Introductory biomechanics: from cells to organisms, Cambridge University Press, 2007",
          "Bartlett R., Introduction to sports biomechanics: Analysing human movement patterns, Routledge, 2014",
          "Hirasawa Y., Sledge C. B., and Woo S. L., Clinical biomechanics and related research, Springer Science & Business Media, 2012"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4445",
        "title": "ENERGY AUDIT, CONSERVATION AND STORAGE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Energy management and Audit: Energy management principles, action plan, audit methodologies, audit instruments",
          "Energy conservation and performance assessment: Critical thickness and economical thickness of insulation, power factor improvement methods, electrical lighting and energy conservation methods",
          "Waste heat recovery devices and cogeneration: Waste heat recovery devices, cogeneration principles, methods, types and performance evaluation of cogeneration system",
          "Performance assessment of mechanical systems: Performance evaluation of different systems, energy conservation measures, case studies",
          "Need of energy storage: Introduction and different modes of energy storage",
          "Potential energy: Pumped hydro storage, flywheel storage, compressed air energy storage, electrical and magnetic energy storage, chemical energy storage, thermo-chemical, photo-chemical, bio-chemical, electro-chemical, hydrogen for energy storage, solar Ponds for energy storage",
          "Sensible and Latent Heat Storage: Stratified storage systems, rock-bed storage systems, phase change materials, selection criteria, numerical heat transfer in melting and freezing process"
        ],
        "references": [
          "Turner W. C., Energy management Handbook, 8th ed., Fairmont Press, 2012",
          "BEE (Bureau of energy efficiency) Study Material, Energy Management & Energy Audit, www.bee-india.com",
          "Dinçer Ibrahim and Rosen Marc A., Thermal Energy Storage: Systems and Applications, 3rd ed., Wiley–Blackwell, 2021"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4446",
        "title": "FRICTION AND WEAR",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Surface interactions",
          "influence of material properties",
          "measurement methods of surface interactions",
          "friction",
          "types of friction",
          "measurement of friction",
          "wear & types of wear",
          "importance of wear",
          "different types of wear",
          "wear testing methods as per ASTM standard",
          "adhesive wear",
          "types of adhesive wear",
          "mechanism of adhesive wear",
          "materials used in adhesive wear situations",
          "abrasive wear",
          "types of abrasive wear",
          "mechanisms of abrasive wear",
          "erosive wear",
          "types and mechanisms of erosive wear",
          "corrosive wear",
          "fatigue wear",
          "fretting fatigue wear",
          "respective wear mechanisms",
          "Lubricants",
          "types of lubricants",
          "required and desired characteristics",
          "testing methods",
          "Hydrodynamic lubrication",
          "hydrostatic lubrication",
          "elasto-hydrodynamic lubrication",
          "solid film lubrication",
          "boundary lubrication",
          "effectiveness of liquid lubricant",
          "solid lubricant"
        ],
        "references": [
          "Rabinowicz E., Friction and Wear of Materials, 2nd edition, John Wiley & Sons, Inc., 2013.",
          "Bharat Bhushan, Principles and applications of Tribology, 2nd edition, John Wiley & Sons Inc., 2013.",
          "Arnell R. D., Davies P. B., Halling J. & Whomes T. L., Tribology: Principles and design applications, Palgrave Macmillan, 1991.",
          "Kragelsky I. V., Alisin V.V., Friction Wear Lubrication – Tribology handbook, Elsevier Science & Technology, Kent, 2016.",
          "Majumdar B. C., Tribology of Bearings, S Chand, 2010."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4447",
        "title": "INDUSTRIAL AUTOMATION AND IOT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Basic concepts of process automation",
          "Architecture of industrial automation network",
          "Basics",
          "Design & Architecture of Programmable Logic Controller (PLC)",
          "PLC Programming Tools",
          "Roles of computer in automation",
          "Architecture of computer based industrial automation",
          "Hardware and software configuration",
          "Basic concepts of Distributed Control System (DCS)",
          "Basic concepts of Supervisory Control and Data Acquisition (SCADA)",
          "Cloud computing",
          "Edge computing",
          "Basics of internet of things (IoT) and industrial internet of things (IIoT)"
        ],
        "references": [
          "Dey C., Sen S.K., Industrial Automation Technologies, CRC Press, 2020.",
          "Lamb F., Industrial Automation: Hands On, McGraw-Hill Education, 2013.",
          "Comer D., The Cloud Computing Book: The Future of Computing Explained, CRC Press, 2021.",
          "Buyya R., Srirama S. N., Fog and Edge Computing: Principles and Paradigms, Wiley, 2019.",
          "Ismail Y., Internet of Things (IoT) for Automated and Smart Applications, Intech Open, 2019."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "MIE 4448",
        "title": "INDUSTRIAL SAFETY ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Safety Engineering",
          "Industrial Accidents",
          "Theories of Accident Causation",
          "Introduction to Health and Toxic Substances",
          "Environmental Control and Noise",
          "Ventilation and its Design Principle",
          "Personal Protection and First Aid",
          "Fire Protection",
          "Machine Guarding",
          "Safeguarding the point of operation",
          "Power presses",
          "Grinding machines",
          "Saws",
          "Belts and Pulleys",
          "Safety consideration regarding material handling and storage",
          "Safety Requirement for Material Handling and Storage",
          "Electrical Hazards",
          "Employee Participation in Promoting Safety",
          "Safety Training",
          "Safety Committees",
          "Teamwork Approach to Promoting Safety"
        ],
        "references": [
          "Asfahl C. R. and Rieske D. W., Industrial Safety and Health Management, 6th ed., Pearson Education, 2011",
          "Spellman F. R. and Whiting N. E., The Handbook of Safety Engineering: Principles and Applications, Government Institutes, 2009",
          "Gupta A., Industrial Safety and Environment, 1st ed., Laxmi Publications Pvt. Ltd., 2006",
          "Goetsch D. L., Occupational Safety and Health for Technologists, Engineers and Managers, 8th ed., Pearson Education Limited, 2014"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4449",
        "title": "MEMS AND NANOTECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Overview of Micro Electro Mechanical Systems and Microsystems",
          "Applications of microsystems",
          "Working principles of microsystems",
          "micro sensor",
          "micro actuators",
          "micro accelerometers",
          "microfluidics",
          "Design of microsystems",
          "Scaling laws in miniaturization",
          "materials for MEMS and microsystems",
          "fabrication process",
          "micro manufacturing methods bulk micro manufacturing",
          "surface micromachining",
          "LIGA Process",
          "General methods of preparation of nano particles",
          "Carbon nanostructures and their Applications",
          "Physical chemistry of Nano systems",
          "Nanoparticles",
          "Nanowires and Nanorods",
          "Thin films- Self assembled monolayers",
          "Experimental techniques- Atomic Force Microscopy",
          "Scanning Tunnelling Microscopy",
          "Spectroscopy and Diffractiontechniques",
          "Nanomaterials used in energy and Environmental applications and their Properties",
          "Device applications in hydrogen storage and Production",
          "Fuel cells",
          "Battery",
          "Solar energy conversion",
          "Waste water treatment",
          "Pollution remedies",
          "Nanomaterials in automobiles"
        ],
        "references": [
          "Tai Ran Hsu, MEMS and Microsystems- Design and Manufacturing, TATA McGraw Hill, 2002",
          "James J Allen, MEMS Design, Taylor and Francis Publication, 2005",
          "Mohamed Gad-el-Hak, The MEMS Handbook, Taylor and Francis Publication, 2005",
          "Charles P Poole, Introduction to Nanotechnology, Wiley Publication, 2003",
          "Guozhong Cao, Nanostructures & Nanomaterials, Imperial College Press, 2004",
          "C B Sobhan, Microscale and Nanoscale Heat Transfer, Taylor and Francis Publication, 2008",
          "Murthy B. S., Shankar P., Textbook of Nanoscience and Nanotechnology, Universities Press (India) Private Ltd, 2013"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4450",
        "title": "NON-DESTRUCTIVE TESTING OF MATERIALS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Fundamentals of Non-Destructive Testing (NDT)",
          "Comparison of NDT vs destructive testing",
          "Mechanical testing",
          "Terminologies used",
          "flaws and defects in NDT",
          "Advantages, limitations, scope, and applications of NDT",
          "Working principle",
          "parameters affecting",
          "testing methods",
          "testing procedures adopted",
          "sensitivity",
          "standards applied",
          "advantages, disadvantages and applications of Penetrant Inspection (PI) methods",
          "Magnetic Particle Testing (MPT)",
          "Ultrasonic Testing (UT)",
          "Holography (HG)",
          "Radiographic Techniques (RGT)",
          "Eddy Current Testing (ECT)",
          "Acoustic Emission Testing (AET)",
          "Thermography (TG) method of non-destructive testing"
        ],
        "references": [
          "Don E. B. and Roderic K. S., Non-destructive Evaluation: A tool in design, manufacturing and service, Taylor and Francis Group, 1997",
          "Paul E. M., Introduction to Non-destructive Testing-A training Guide, 2nd ed., John Wiley and Sons, Inc, 2005",
          "NDT Hand Books Vol. 1 – 10, American Society for Non-destructive Testing (ASNT), 1999",
          "Davis J. R., ASM Handbook: Volume 17, Non-destructive Evaluation and Quality Control, 2nd ed., ASM International Materials Park, 1992",
          "ASNT (Edited), Materials and Processes for NDT Technology, ASNT, USA, 1981",
          "Ensminger D., Ultrasonics: Fundamentals, Technology, Application, 2nd ed., Marcel Dekker, New York, 1988",
          "Annual Book of ASTM Standards. Metals Test Methods and Analytical Procedures: Non-destructive Testing, section 3, v03.03, American Society for Testing and Materials, 1989",
          "Shull P. J., Non-destructive Evaluation – Theory, Applications, and Applications, Marcel Dekker, 2002"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4451",
        "title": "PIPE SYSTEM ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Definition and scope, Importance advantages of transport by pipeline, Piping elements",
          "Codes and standards: ASME codes, Materials of construction, Pipe sizes",
          "Single phase incompressible flow: Flow regimes, Development of velocity profile, Pressure drop calculations, Bernoulli's equation, Major and minor losses, Hydraulic and energy grade lines",
          "Pipe networks: Pipe hydraulics and sizing, Pump and pipe system matching, H-Q curves, Pipes in series and parallel, Pipe network analysis",
          "Structural design of pipe lines: Stress due to internal fluid pressure, Stress due to external fluid pressure, High/low pressure pipes",
          "Planning and construction of pipelines: Piping drawing basics, Development of plot plan, Process piping layout, Utility piping layout, Selection of supports & expansion joints, Flexibility analysis",
          "Protection of pipelines: Pipeline damage due to corrosion, abrasion, heating and freezing, Protection methods - Lining, coating, insulation, jacketing etc.",
          "Industrial pipelines: Non-Newtonian fluid flow, Single phase compressible flows - Flow analysis for ideal gas, flow analysis for real gas, Multi-phase flows – Slurry pipelines, Pneumotransport, Capsule pipelines"
        ],
        "references": [
          "Henry Liu, Pipeline Engineering, Lewis Publishers, CRC Press LLC, Florida, 2003",
          "Antaki George A., Piping and Pipeline Engineering: Design, Construction, Maintenance, Integrity, and Repair, CRC Press, 2003",
          "Larock Bruce E., Jeppson Roland W., and Watters Gary Z., Hydraulics of Pipeline Systems, CRC Press LLC, Florida, 2000",
          "Nayyar Mohinder L., Piping Handbook, McGraw-Hill, 2000"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "MIE 4452",
        "title": "PRODUCT DESIGN AND DEVELOPMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "New Product Development",
          "Translation of needs into Specifications",
          "Creativity and Innovation",
          "Concept Development",
          "Embodyment Design",
          "Design for X",
          "Supporting Techniques"
        ],
        "references": [
          "Ulrich Karl T., and Eppinger Steven D., Product Design and Development, 6th ed., McGraw-Hill, 2015.",
          "Cooper Robert G., Winning at New Products: Creating Value through Innovation, Hachette Book Group, New York, 2017.",
          "Starc John, Product Lifecycle Management (Decision Engineering), Springer Publications, 2015.",
          "Otto Kevin and Wood Kristin, Product Design Techniques in Reverse Engineering and New Product Development, Pearson Education (LPE), 2001.",
          "Chitale A. K., and Gupta R. C., Product Design and Manufacturing, 6th ed., Prentice–Hall of India, 2013.",
          "NPTEL Courses: Product Design and Development, https://nptel.ac.in/courses/112107217.",
          "NPTEL Courses: Design Thinking - A Primer, https://nptel.ac.in/courses/110106124."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4453",
        "title": "PROJECT MANAGEMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Concept of project, Importance of project management, Project life cycle, Project management as an integrated approach, organizing projects within the functional organization, organizing projects as dedicated teams, Organizing projects within a matrix arrangement, Project manager and their attributes",
          "Feasibility study: Pre-feasibility study, Technical feasibility, Managerial feasibility, Economic feasibility, Financial feasibility, Cultural feasibility, Political feasibility, Environmental feasibility, Market feasibility, Steps of feasibility study",
          "Estimating project times and costs: Factors influencing the quality of estimates, Costs associated with projects, Estimating guidelines for times, costs and resources, Top-down approaches of estimation, Bottom-up approaches of estimation, Hybrid approach of estimation",
          "Risk management process: Risk identification, Risk Assessment - probability analysis, mitigating risk, avoiding risk, transferring risk, sharing risk, Retaining risk, Contingency planning, Contingency funding and time buffers, Risk response control – change control management, Decision tree analysis, Numerical",
          "Project scheduling: Bar charts and Milestone charts, Elements of network, Development of networks, Work Breakdown Structure (WBS), Critical Path Method, Program Evaluation and Review Technique, Network crashing, CPM updating, Numerical",
          "Project audit and closure: Guidelines for conducting a project audit, Initiating and staffing, Data collection and Analysis, Audit reporting, Conditions for project closure, Evaluation of project team and members"
        ],
        "references": [
          "Gray C., Larson E. and Desai G., Project Management – The Managerial Process, Tata McGraw Hill Pvt. Ltd., New Delhi, 2013",
          "Paneerselvam R. and Senthilkumar P., Project Management, PHI Learning Pvt. Ltd., New Delhi, 2010",
          "Meredith J. and Mantel S., Project Management – A Managerial Approach, John Wiley & Sons, USA, 2012",
          "Vohra N. D., Quantitative Techniques in Management, New Delhi, 2007"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4454",
        "title": "THEORY OF ELASTICITY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Analysis of Stresses: stress transformation, stress invariants, Principal stresses, Mohr's circle for stress transformation, Octahedral stresses, Balance Laws for 3D Elasticity",
          "Analysis of Strains: strain displacement relationship, Strain Tensor, Compatibility equations",
          "Constitutive Laws: Generalized Hooke's law, Formulation of constitutive laws, Elastic constants for anisotropic, orthotropic and isotropic materials",
          "2D Elasticity and Applications: Plane stress, Plane strain and Axisymmetric problems, Airy's stress function, Applications to Thick shells, Rotating disk, Stress concentration due to circular hole",
          "3D Elasticity and Applications: Betti-Maxwell Reciprocal Theorem, Torsion of a uniform circular, non-circular Bars, Membrane Analogy",
          "Introduction to Plasticity: Constitutive relations, Problems contained plastic deformation, strain rate effects, idealization, Yield criteria, plastic stress-strain relations"
        ],
        "references": [
          "Timoshenko S. P. and Goodier J. N., Theory of Elasticity, 3rd edition, McGraw-Hill, 2010",
          "Srinath L. S., Advanced Mechanics of Solids, Tata Mc-Graw Hill Book Company, 3rd ed., 2017",
          "Sadd M. H., Elasticity, Elsevier Publishers, New Delhi, 2014",
          "Sokolnikoff I. S., Mathematical Theory of Elasticity, Krieger Publishing Company, 1983",
          "Shames I. H., Mechanics of Deformable Solids, Krieger Publishing Company, 1983",
          "Sadhu Singh, Theory of Elasticity, 1st Edition, Khanna Publishers, 1978",
          "Helena H. Jane, Theory of Elasticity and Plasticity, Paperback, PHI Learning, 2017",
          "Singh Sadhu, Theory of Plasticity and Metal Forming Process, 1st Edition, Khanna Publishers, 1980"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MIE 4455",
        "title": "WIND ENERGY TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory",
          "elective"
        ],
        "syllabus": [
          "Introduction: Wind resources and modern wind turbines, classification of wind turbines and turbine components, materials and technology advancements, applications of wind turbines, grid connectivity, industries, standalone systems, offshore power",
          "Wind resource assessment: variations of space, time, season, months, and diurnal, characteristics of steady wind and wind speed distribution",
          "Wind measurement: parameters, types of anemometers, monitoring station, remote wind speed sensing instrumentation",
          "Design of wind turbines: Rotor torque and power, braking, blade design and blade materials, blade section, Performance measurement",
          "Subsystems of wind turbines: Different types of generators, wind power control systems, asynchronous load management using pumps, paddle wheels, and batteries",
          "Wind Farms: Wind flow models, wind farm design using capacity factor, siting and layout of wind turbines, site selection, micrositing, and wake model",
          "Economics of wind energy conversion: annual energy output, capital recovery factor, depreciation, cost of wind energy, wind generated electricity value, present value of annual costs"
        ],
        "references": [
          "Mathew Sathyajith, Wind Energy: Fundamentals, Resource Analysis and Economics, Springer, 2006",
          "Johnson Garg L., Wind Energy Systems, Prentice Hall, Inc., 2006",
          "Ahmed Siraj, Wind Energy – Theory and Practice, 3rd ed., PHI Learning Pvt. Ltd., 2015"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MIE 4456",
        "title": "MICROFLUIDICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction and Applications: Characteristics and dimensions of microfluidics, advantages, multidisciplinary and Multiphysics features, example applications",
          "Governing Principles: Classification of forces between surfaces, scaling law and its effects, hydrodynamic equation and Reynolds number in microsystems, compressibility effects, no-slip vs slip boundary conditions, slip length, Maxwell's first order slip model",
          "Pressure and Surface Tension driven microflows: Fundamentals, velocity profile, governing expression, low Reynolds number hydrodynamics, surface force and capillarity, Young-Laplace equation, practical examples",
          "Microfabrication: Top-down and bottom-up approach, photolithography, soft lithography, micro-milling, paper based microfluidic devices, low-cost fabrication techniques",
          "Bio-microfluidics: Natural and cellular microfluidics, cell-culture and analysis using TFM, confinement effects, DNA microfluidics, Lab-on-chip, 3D printing in microfluidics, biomimetics, drug delivery"
        ],
        "references": [
          "Tabeling P., Introduction to Microfluidics, Oxford University Press, 2011.",
          "Bruus H., Oxford University Press, 2008.",
          "Chakraborty S., Microfluidics and Microfabrication, 1st ed., Springer, 2010.",
          "Madou M.J., Fundamentals of Microfabrication, CRC Press, 2002.",
          "Happel J., Brenner H., Low Reynolds Number Hydrodynamics, Springer, 1983.",
          "NPTEL Course: Micro fluidics, https: https://nptel.ac.in/courses/112105187."
        ],
        "flags": [
          "missing_sem",
          "incomplete_reference"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4457",
        "title": "ENGINEERING ASSET MANAGEMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Basic concepts",
          "Definitions",
          "Review of Existing Frameworks for Asset Management",
          "A framework for AM system",
          "Requirement and Challenges",
          "Asset Management Drivers",
          "Benefits of Asset Management",
          "Asset Management Standards: ISO Requirements",
          "ISO 55002 Guidelines on the application of ISO 55001",
          "Asset Management Principles: Barriers to implement Asset Management",
          "Asset Life Cycle",
          "Balancing Cost, Risk and Performance",
          "Principles of asset integrity and management",
          "Asset Management Tools and Elements of Asset Assessment (Performance Management)",
          "Terminology used in asset management policy and requirements",
          "Fundamentals of Reliability Engineering",
          "Maintenance Management",
          "maintenance contracts and contract administration",
          "reliability centred maintenance",
          "total productive maintenance",
          "Preventive component replacement",
          "capital equipment replacement decisions"
        ],
        "references": [
          "Campbell, J.D., Jardine, A.K.S. McGlynn, J. “Asset Management Excellence: Optimizing Equipment Life-Cycle Decisions”, 2nd Edn., CRC Press, Boca Raton, FL, 474 pp. 2011.",
          "Jardine, A.K.S. and Tsang, A.H.C. “Maintenance, Replacement and Reliability: Theory and Applications”, CRC Taylor & Francis, New York, 322 pp. 2006.",
          "Kelly, A. “Strategic Maintenance Planning”, Butterworth Heinemann, Oxford, 284 pp. 2006.",
          "Kelly, A. “Managing Maintenance Resources”, Butterworth Heinemann, 292 pp. 2006.",
          "Lawrenson, J. “Effective Spares Management”, International Journal of Physical Distribution & Materials Management, Vol 16, No. 5., 111 pp., 1986.",
          "O'Conner, P.D.T. “Practical Reliability Engineering”, 5th Edn., John Wiley and Sons, 2012.",
          "Moubray, J. “Reliability-Centered Maintenance”, 2nd Edition, Industrial Press Inc., NY, 414 pp., 1992."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4311",
        "title": "INTRODUCTION TO COMPOSITE MATERIALS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Definition",
          "Classification",
          "Types of matrices & reinforcements",
          "Characteristics & selection of Fiber",
          "Laminated & Particulate composites",
          "Prepregs",
          "Micro mechanical analysis of a lamina",
          "Rule of mixture",
          "Processing of composites",
          "Hand-layup",
          "Spray-layup",
          "Compression molding",
          "Injection molding",
          "Reaction injection molding",
          "Autoclaving",
          "Resin transfer molding",
          "Filament winding",
          "Pultrusion",
          "Sheet molding",
          "Secondary processing of polymer composites: Joining",
          "Adhesive joining",
          "Mechanical joining",
          "Microwave joining",
          "Induction and resistance welding",
          "Drilling of polymer composites",
          "Testing of polymer composites",
          "ASTM standards test for physical properties",
          "mechanical properties",
          "SEM analysis",
          "Application developments",
          "Aircrafts",
          "Missiles",
          "Space",
          "Automobile",
          "Electrical and electronics",
          "Marine",
          "Recreational",
          "sports equipment",
          "Construction"
        ],
        "references": [
          "Autar K. K., Mechanics of Composite Materials, CRC Press, 2005.",
          "Krishan K. C., Composite Material Science and Engineering, 4th ed., Springer Publication, 2021.",
          "Mallik P. C., Fiber Reinforced Composites, Marcel Decker Publication, 1993.",
          "Rober M. J., Mechanics of Composite Materials, McGraw Hill Kogakusha Ltd, 2008.",
          "Michael W..Hyer, Stress analysis of fiber Reinforced Composite Materials, McGraw Hill Publication, 1998.",
          "Gupta M. C., Gupta A. P., Polymer Composites, New age international (P) Ltd, 2005."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4312",
        "title": "Introduction to Biomechanics",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Biomechanics: Brief history, Contributions of Biomechanics to health science, Contributions of Biomechanics to the field of Mechanics",
          "Hemodynamics: Rheology of blood, Large artery hemodynamics, Small artery hemodynamics",
          "Ocular biomechanics: Ocular anatomy, Biomechanics of glaucoma, Ocular blood",
          "Biomechanics of respiratory system: Gross anatomy of the conducting airways and pulmonary vasculature, Anatomy of associated structures, Biomechanics of breathing, Mass transfer and particle transport in lungs",
          "Skeletal biomechanics: Introduction to bone, Biomechanics of cortical and trabecular bone, Structure of ligament, tendon and cartilage and its biomechanics",
          "Biomechanics of Cardiovascular system, Biomechanical hierarchy in cardiovascular physiology, Structure-function relationship in cardiovascular tissues, Biomechanical feedback in the cardiovascular system",
          "Experimental and computational methods"
        ],
        "references": [
          "Fung Y. C., Biomechanics: motion, flow, stress, and growth, Springer Science & Business Media, 2013.",
          "Oomens C., Brekelmans M., Loerakker S., and Baaijens F., Biomechanics: concepts and computation, Cambridge University Press, 2018.",
          "Ethier C. R., and Simmons C. A., Introductory biomechanics: from cells to organisms, Cambridge University Press, 2007.",
          "Hirasawa Y., Sledge C. B., and Woo S. L., Clinical biomechanics and related research, Springer Science & Business Media, 2012.",
          "Brandao S., Da Roza T., Mascarenhas T., Duarte S., Ramos I., Parente M., and Natal Jr., Applied Biomechanics: Concepts and Connections Applied Biomechanics: Concepts and Connections, International journal of urology, 2013."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4313",
        "title": "INTRODUCTION TO OPERATIONS RESEARCH",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Definition, Phases, Applications, Advantages and Limitations of Operations Research",
          "Linear programming problems: Assumptions, Formulation of LPP for business and non-business applications. Graphical solutions, Special cases – Degeneracy, Infeasible Solution, Unbalanced and Multiple optimal solutions. Minimization and Maximization cases. Simplex algorithm, Concept of dual",
          "Transportation problem: Formulation, generating initial solutions using North-West Corner (NWC) Method, Least Cost (LC) Method, Vogel's Approximation Method (VAM). MODI Method",
          "Assignment problem, Travelling salesman problem",
          "Game theory: Introduction to game theory, Two-person-zero sum games, Pure and Mixed Strategies, Solution methods for 2 x 2 games, Graphical method (2 x n games; m x 2 games)",
          "Queueing theory: Introduction to queueing theory, Poisson arrival rate and Exponential service times, System characteristics, Problems on the models- (M/M/1) :( /FIFO), (M/M/1): (N/FIFO)",
          "Critical Path Method (CPM). Project Evaluation and Review Technique (PERT)"
        ],
        "references": [
          "Taha H. A., Operations Research, Pearson Education, 7th ed., 2002.",
          "Winston W. L., Operations Research, Thomson Asia, 2003.",
          "Vohra N. D., Quantitative Techniques in Management, New Delhi, 2007.",
          "Sharma S.D., Operations Research, Kedar Nath Ramnath Publications, 14th ed., 2005."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4314",
        "title": "ENERGY ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Steam power plant: Different types of fuels used for steam generation, equipment for burning coal in lump form, oil burners, advantages and disadvantages of using pulverized fuel, pulverized fuel furnaces, coal and ash handling, high and super critical pressures",
          "Diesel engine power plant: Applications of diesel engines in power field, method of starting diesel engine, auxiliaries, layout of diesel power plant",
          "Hydro–electric plant: hydrographs, flow duration and mass curves, unit hydrograph and numerical, different types of plants, accessories, general layout of hydel power plants",
          "Nuclear power plant: Principles of release of nuclear energy, nuclear fuels used in the reactors, elements of nuclear reactor, reactor types, radiation hazards, shielding's, and radioactive waste disposal",
          "Solar energy: Solar extra-terrestrial radiation and radiation at the earth surface, radiation measuring instruments, solar energy conversion systems",
          "Biomass energy: Photosynthesis, anaerobic fermentation, classification, gasifiers",
          "Wind energy: Properties of wind, wind velocity and power from wind, types of wind machines and their characteristics",
          "Other energy conversion techniques: Fundamental characteristics of tidal power, harnessing tidal energy and limitations. principle of working of ocean thermal energy, Rankine cycle, limitations of OTEC. geothermal energy conversion working principle, types of geothermal stations, limitations"
        ],
        "references": [
          "Nag P. K., Power Plant Engineering, 3rd ed., Tata McGraw Hill, 2011.",
          "Domkundwar, Power Plant Engineering, 8th ed., Dhanpat Rai Publications, 2016.",
          "Rai G. D., Non-Conventional Energy Sources, Khanna Publishers.",
          "Rao S., and Parulekar B. B., Energy Technology, Khanna Publishers, 2009.",
          "Culp A. W., Principles of Energy Conversion, McGraw Hill International, 2001."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4315",
        "title": "INTRODUCTION TO FINITE ELEMENT ANALYSIS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Basics Concepts of FEA: General steps involved in FEM, Convergence requirements, Pascal's triangle, Higher order quadratic elements; Local and Global coordinate systems, Shape Functions and properties. Basics of theory of Elasticity.",
          "Finite Element Formulation by DSM: FE formulation of 1D linear element by direct stiffness method, Elimination and Penalty approach. Application to bar and plane truss problems. Introduction to space truss.",
          "FE formulation of Beam element by energy approach, Application to Beam problems.",
          "Additional Methods and Applications of FEM: Structure of commercial FEM software package, Mini project on using FEA software, Mini Project on using computation approach."
        ],
        "references": [
          "Chandrupatla T. R., and Belegundu A. D., Introduction to Finite Elements in Engineering, Pearson Education, New York, 2011.",
          "Logan Daryl L., A First course in Finite Element Method, 5th ed., Cengage Publishing, India, 2012.",
          "Hutton David V., Fundamentals of Finite Element Analysis, Tata McGraw Hill, India, 2005.",
          "Reddy J. N., An Introduction to Finite Element Method, 4th ed., McGraw Hill International Edition, New York, 2020.",
          "Bathe K. J., Finite Element Procedures, Prentice-Hall of India, New Delhi, India, 1996.",
          "Rao S. S., Finite Element Analysis, 6th ed., Elsevier Butterworth-Heinemann, India, 2017.",
          "Zienkiewicz O. C., and Cheung Y. K., The Finite Element Method in Structural and Solid Mechanics, 7th ed., Elsevier Butterworth-Heinemann, India, 2013."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4316",
        "title": "BIO-FLUID DYNAMICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Cardiovascular physiology: Cardiovascular system",
          "The heart-blood vessels",
          "Mechanical model (Winkessel model)",
          "Blood",
          "Fundamentals of fluid mechanics: Intrinsic properties of fluid",
          "Conservation laws- Mathematical tools",
          "Mass Conservation",
          "Conservation of momentum",
          "Form of fluid motions equations",
          "Dimensional analysis",
          "Energy conservations & Bio-heat Equation of Mammalian Tissue",
          "Mathematical solutions for bio-fluid problems: How to solve a problem?",
          "Boundary conditions",
          "Mathematical solutions for bio-fluid problems - Shear stress on arterial endothelial cells",
          "NS in a pipe - Validity of the Hagen-Poiseuille relationship in the cardiovascular system",
          "Pulsatile flow",
          "Effect of pulsatility",
          "Wormersley solution",
          "Computational fluid dynamics (CFD) and Flow measurement in the cardiovascular",
          "Flow over immersed body (incompressible): General flow characteristics",
          "Lift and drag concepts – Definitions",
          "Drag for different shapes",
          "Drag coefficient, for a sphere in stokes flow",
          "Transport of micro-particles",
          "Characteristic flow past an object",
          "Boundary layer characteristics - Boundary Layer Structure and Thickness on a Flat Plate",
          "Boundary layer thickness",
          "MomentumIntegral Boundary Layer Equation for a Flat Plate",
          "Prandtl/Blasius Boundary Layer Solution",
          "Turbulent boundary layer",
          "Pressure gradient effect on flow - Separation point",
          "Reduction of drag",
          "Biological solution for drag reduction",
          "Rheology of blood",
          "Non-Newtonian fluid: Viscosimetry",
          "Blood composition and viscosity",
          "Cell free marginal layer",
          "Pressure flow relationship for non-Newtonian fluid",
          "Hemodialysis and platelet activation",
          "Time effect viscosity",
          "Introduction to Fluid Machinery and biomedical application: Introduction to Fluid Machinery",
          "Fluid machinery in biomedical"
        ],
        "references": [
          "Rittgers Stanley E., Chandran Krishnan B., and Yoganathan Ajit Prithiviraj, Biofluid mechanics: the human circulation, Taylor and Francis. 2nd ed., 2012.",
          "Kundu P. K., Cohen I. M., and Dowling D. R., Fluid Mechanics, 5th ed., Academic Press, 2011.",
          "Waite L., Applied Biofluid Mechanics, 1st ed., McGraw-Hill Professional, 2007.",
          "Truskey George A., Yuan Fan, and Katz David F., Transport Phenomena in Biological Systems (Pearson Prentice Hall Bioengineering), 2009."
        ],
        "flags": [
          "missing_semester",
          "incomplete_reference_details"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4317",
        "title": "INTRODUCTION TO ENGINEERING ASSET MANAGEMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Basic concepts, Definitions, Review of Existing Frameworks for Asset Management, A framework for AM system, Requirement and Challenges, Asset Management Drivers, Benefits of Asset Management",
          "Asset Management Standards: ISO Requirements, ISO 55002 Guidelines on the application of ISO 55001",
          "Asset Management Principles: Barriers to implement Asset Management, Asset Life Cycle, Balancing Cost, Risk and Performance",
          "Principles of asset integrity and management: Asset Management Tools and Elements of Asset Assessment (Performance Management), Terminology used in asset management policy and requirements",
          "Fundamentals of Reliability Engineering: Maintenance Management; maintenance contracts and contract administration, reliability centred maintenance; total productive maintenance; Preventive component replacement and capital equipment replacement decisions"
        ],
        "references": [
          "Campbell, J.D., Jardine, A.K.S. McGlynn, J. “Asset Management Excellence: Optimizing Equipment Life-Cycle Decisions”, 2nd Edn., CRC Press,Boca Raton, FL, 474 pp. 2011.",
          "Jardine, A.K.S. and Tsang, A.H.C. “Maintenance, Replacement and Reliability: Theory and Applications”, CRC Taylor & Francis, New York, 322 pp. 2006.",
          "Kelly, A. “Strategic Maintenance Planning”, Butterworth Heinemann, Oxford, 284 pp. 2006.",
          "Kelly, A. “Managing Maintenance Resources”, Butterworth Heinemann, 292 pp. 2006.",
          "Lawrenson, J. “Effective Spares Management”, International Journal of Physical Distribution & Materials Management, Vol 16, No. 5., 111 pp., 1986.",
          "O'Conner, P.D.T. “Practical Reliability Engineering”, 5th Edn., John Wiley and Sons, 2012.",
          "Moubray, J. “Reliability-Centered Maintenance”, 2nd Edition, Industrial Press Inc., NY, 414 pp., 1992."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "MIE 4401",
        "title": "DESIGN OF MECHANICAL SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Definition of engineering design",
          "Steps of the design process",
          "General consideration in machine design",
          "Design of Piston",
          "Design of Connecting rod",
          "Design of Crankshaft",
          "Design of Valve gear mechanism",
          "Flange coupling",
          "Screw jack",
          "Single plate clutch",
          "Two-speed gearbox",
          "Passenger lift",
          "Concrete mixer",
          "Automobile chassis & suspension",
          "Johnson's method of optimization"
        ],
        "references": [
          "Bhandari V. B., Design of Machine Elements, Tata McGraw Hill Publishing Company, 5th ed., New Delhi, 2020.",
          "Trikha S. N., Machine Design Exercises, Khanna Publishers, 4th ed., Delhi, 1966.",
          "Patil S. P., Mechanical System Design, Jaico Publishing House, Mumbai, 2004.",
          "Dieter George E., Engineering Design, McGraw Hill Book Co., Singapore, 2009.",
          "Ulrich Karl T., and Eppinger Steven D., Product Design and Development, Irwin McGrawHill, Boston, 2016.",
          "Ullman David G., The Mechanical Design Process, McGraw Hill Book Co., Singapore, 2010.",
          "Bralla James G., Design for Manufacturability Handbook, McGraw Hill, New York, 1998.",
          "Mahadevan K., and Reddy Balaveera K., Design Data Handbook, CBS Publishers and Distributors, New Delhi, 2020."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MIE 4402",
        "title": "INTRODUCTION TO CONTINUUM MECHANICS FOR ENGINEERS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction and Mathematical Preliminaries: Solids and fluids as continuous media, Tensors, Dummy indices, Kronecker delta, Index notation, Tensor algebra, Divergence and Curl Theorems",
          "Kinematics of Continua: Bodies, configurations, and motions, Deformation gradient tensor, Strain measures, Strain-Rate Tensor, Spin, Infinitesimal Deformation",
          "The Balance Laws, Stress Tensors: Transformation of stress tensors under the rotation of axes, Plane stress, Deviatoric stress, von-Mises stress",
          "Isothermal Solid Mechanics: Elasticity equations, Initial and boundary value problems, Virtual work theorem, Uniqueness and reciprocal theorem, Constitutive relations for linearly and nonlinearly elastic solids",
          "Isothermal Fluid Mechanics: Ideal fluids, Newtonian viscous fluids, Incompressible case, Navier Stokes equations, Applications to fluid mechanics problems"
        ],
        "references": [
          "Batra R. C., Elements of Continuum Mechanics, American Institute of Aeronautics and Astronautics, 2006",
          "Chaves E. W. V., Notes on Continuum Mechanics, Springer Science & Business Media, 2013",
          "Gonzalez O., and Stuart A. M., A First Course in Continuum Mechanics, Cambridge University Press, 2008",
          "Holzapfel G. A., Nonlinear Solid Mechanics: A Continuum Approach for Engineering, John Wiley & Sons, 2000",
          "Nair S., Introduction to Continuum Mechanics, Cambridge University Press, 2009",
          "Reddy J., An Introduction to Continuum Mechanics, 2nd ed., Cambridge University Press, 2013",
          "Spencer A. J. M., Continuum Mechanics, Dover Publications, 2012"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MIE 4403",
        "title": "LUBRICATION AND ROTOR DYNAMICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Rotating machinery",
          "Properties and testing of lubricants",
          "Rolling element bearings, Hydrodynamic oil-journal bearings, Gas lubricated bearings, Hydrostatic bearings and Squeeze film bearings",
          "Simple rotor systems, Simple rotor-bearing foundation systems, Simple rotor systems with gyroscopic effect, Torsional vibrations of rotors, Continuous systems and FE methods: Transfer matrix method and FE method, Transverse vibration analysis of simple rotors, Instability in rotating machines, Instability of multi-degrees of freedom rotor mounted on flexible bearings"
        ],
        "references": [
          "Bhushan Bharat, Principles and Applications of Tribology, Wiley, 2nd ed., 2013.",
          "Majumdar B. C., Sarangi Mihir, and Ghosh M. K., Theory of Lubrication, Tata McGraw Hill, 2013.",
          "Gwidon W. Stachowiak, Andrew W. Batchelor, Engineering Tribology, 4th ed., Butterworth Heinemann, London, 2016.",
          "Rao J. S., Rotor Dynamics, 3rd ed., New Age International (P) Ltd., New Delhi, 2018.",
          "Chong-Won Lee, Vibration Analysis of Rotors, Springer Science Business Media, 2012.",
          "Krzysztof Czolczynski, Rotordynamics of Gas-Lubricated Journal Bearing Systems, Springer, 2012.",
          "Friswell M. I., Dynamics of Rotating Machines, Cambridge, 2010."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4404",
        "title": "MODELING AND SIMULATION OF DYNAMIC SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Modeling and Simulation: Importance of Modeling, Models of Systems, Systems, Subsystems, and Components.",
          "Bond Graph Modeling of Dynamic Systems: Engineering Ports, Bonds, and Power, Bond Graphs, Inputs, Outputs, and Signals, Basic Bond Graph Elements, Causality considerations for the basic Elements.",
          "Basic System Models: Mechanical systems involving translation, rotation, Hydraulic systems. Acoustic systems and Electrical systems.",
          "System Models of Combined Systems: Multi Energy Domain systems, Transducers, Transformers, Gyrators, Thermo-fluid system, Mechatronic system, Multibody systems.",
          "State-Space Equations and Automated Simulation: Standard form for System equations, Basic formulation and reduction.",
          "Analysis and Control of Linear Systems: Solution techniques for ordinary differential equations, free response and Eigen values for undamped and damped oscillator."
        ],
        "references": [
          "Karnopp Dean C., Margolis Donald L., and Rosenberg Ronald C., System Dynamics: Modeling, Simulation, and Control of Mechatronic Systems, John Wiley & Sons, Inc. 5th ed., 2012.",
          "Mukherjee A., Karmakar R., and Samantaray A. K., Bond graph in modeling, simulation and fault identification, IK International, New Delhi, 2006.",
          "Das Shuvra, Mechatronic Modeling and Simulation Using Bond Graphs, CRC Press, 2009.",
          "Borutzky Wolfgang, Bond Graph Methodology Development and Analysis of Multidisciplinary Dynamic System Models, Springer, 2010.",
          "Thoma Jean U., Simulation by Bondgraphs, Springer, 1990."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4405",
        "title": "ADDITIVE MANUFACTURING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Basic principles",
          "Advantages",
          "limitations and applications of Additive Manufacturing (AM)",
          "Standardizations in AM",
          "Contrast with conventional manufacturing processes",
          "Classification",
          "Detailed working principle",
          "Equipment",
          "process and techniques",
          "Process parameters in AM",
          "General process workflow in AM",
          "Pre-processing for AM",
          "Role of CAD in AM",
          "Part placement in machine envelop and slicing",
          "Build process",
          "Post processing",
          "Role of materials in AM",
          "Properties",
          "Specifications and development of materials for AM",
          "Materials Issues in AM",
          "Design for AM",
          "Impact of AM on conventional DFM and DFA",
          "Design guidelines for AM",
          "Management & Implementation of AM",
          "Case studies"
        ],
        "references": [
          "Gibson Ian, Rosen David W., and Stucker Brent, Additive Manufacturing Technologies: Rapid Prototyping to Direct Digital Manufacturing, 2nd ed., Springer Pub., 2015",
          "Gebhardt Andreas, Understanding Additive Manufacturing, Hanser Publishers, 2011",
          "Hopkinson N., Hague R. J. M., and Dickens P. M., Rapid Manufacturing - An Industrial Revolution for the Digital Age, John Wiley & Sons, Ltd, 2005",
          "Advanced Additive Manufacturing- Handbook, INEX-ADAM, 2020"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4406",
        "title": "NON-TRADITIONAL MACHINING TECHNIQUES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Classification & selection of Non-traditional machining process",
          "Need for NTM",
          "Comparison with traditional machining",
          "Process",
          "Equipment",
          "Working principle",
          "Advantages",
          "Limitations & Process parameters of Ultrasonic machining",
          "Abrasive jet machining",
          "water jet machining",
          "Electrochemical machining",
          "Electrochemical grinding",
          "Electrochemical honing",
          "Chemical machining",
          "Chemical blanking",
          "Chemical milling",
          "Electric discharge machining",
          "Electric discharge grinding",
          "Wire EDM",
          "Plasma arc machining",
          "Laser beam machining",
          "Electron beam machining"
        ],
        "references": [
          "Production technology, HMT, McGraw Hill Education India Pvt. Ltd, 2001",
          "Vijay K. Jain, Advanced Machining Processes, 1st ed., Allied Publishers Pvt. Ltd., 2013",
          "Pandey P. C., and Shah H. S., Modern Machining Processes, 1st ed., Tata McGraw-Hill Educational India Pvt. Ltd., 2013",
          "Bhattacharyya Amitabha, New Technology, The Institute of Engineers (India), 2000",
          "Elanchezhian C., Vijaya Ramnath B., and Vijayan M., Unconventional Machining processes, 1st ed., Anuradha Publication, 2005",
          "Singh M. K., Unconventional Machining processes, 1st ed., New Age International Publishers, 2010",
          "Benedict. G.F., Nontraditional Manufacturing Processes, Marcel Dekker Inc., 1987",
          "Paul De Garmo, Black J. T., and Kohser Ronald. A., Material and Processes in Manufacturing, 8th ed., Prentice Hall of India Pvt. Ltd., 2001"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4407",
        "title": "LEAN MANUFACTURING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Definition and basic concepts of lean manufacturing philosophy",
          "5S principle",
          "Total productive maintenance",
          "Process mapping techniques",
          "Concept of work cell",
          "Cause and effect diagram",
          "Pareto chart",
          "Spider/radar chart",
          "Poke Yoke",
          "Kanban",
          "Autonomation",
          "SMED",
          "Standardized fixtures",
          "DFMA",
          "JIT concept",
          "Visual workplace",
          "Lean implementation and productivity improvement"
        ],
        "references": [
          "Gopalakrishnan N., Simplified Lean Manufacture, India: Prentice-Hall of India Pvt. Limited, 2010",
          "Socconini L., Lean Manufacturing. Step by step, Spain: ICG Marge, SL, 2021",
          "Shook J., and Rother, M., Learning to See: Value Stream Mapping to Add Value and Eliminate Muda, Germany: Taylor & Francis, 2003"
        ],
        "flags": [
          "missing_semester",
          "unclear_course_type"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4408",
        "title": "MICRO MACHINING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Introduction to micro machining",
          "Need for miniaturization",
          "Classification of micro machining",
          "Applications of micro machining",
          "MEMS vs micro machining",
          "Machine tools for micro machining",
          "Micro cutting tools",
          "Sensors and actuators for monitoring and control of micro machining",
          "Theory of micro machining",
          "Diamond turning",
          "Micro machining operations",
          "Abrasive jet micro machining",
          "Abrasive water jet micro machining",
          "Ultrasonic micro machining",
          "Abrasive flow finishing",
          "Magnetic abrasive finishing",
          "Magneto rheological finishing",
          "Magneto rheological abrasive flow finishing",
          "Electric discharge micro machining",
          "Wire electric discharge micro machining",
          "Electric discharge grinding",
          "Electric discharge diamond grinding",
          "Laser beam micro machining",
          "Electron beam micro machining",
          "Ion beam micro machining",
          "Chemical micro machining",
          "Electro chemical micro machining",
          "Electro chemical micro grinding",
          "Electro-chemical honing",
          "Electro stream micro drilling",
          "Electro chemical micro deburring",
          "Shaped tube electrolytic micro machining"
        ],
        "references": [
          "V. K. Jain, Micro Manufacturing Processes, CRC Press, Taylor & Francis Group, 2012",
          "K. Cheng K., and Huo D., Micro-cutting: Fundamentals and Applications, John Wiley & Sons, 2013",
          "Jain V. K., Advanced Machining Processes, Allied Publishers Pvt. Ltd., 2007",
          "Mishra P. K., Nonconventional Machining, Narosa Publishing House Pvt. Ltd, 2007",
          "McGeough J, A., Advanced Methods of Machining, Springer, 2011",
          "Qin Y., Micro-manufacturing Engineering and Technology, William Andrew, 2015",
          "Davim J. P., and Jackson M. J., Nano and Micromachining, John Wiley & Sons, 2013"
        ],
        "flags": [
          "missing_sem",
          "minor_specialization_not_mapped"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4409",
        "title": "CRYOGENICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Introduction to cryogenics: Properties of cryogenic fluids, material properties at cryogenic temperatures mechanical properties, thermal properties, electrical properties, Carnot liquefaction cycle, F.O.M. and yield of liquefaction, cycles, inversion curve, Joule Thomson effect, areas of applications of cryogenic Engineering",
          "Gas Liquefaction Systems: Simple Linde Hampson system, pre cooled Linde Hampson System, Claude System, Heylndt system, dual pressure, Claude system, liquefaction cycle, kapitza system and comparison, liquefaction cycle for hydrogen and helium system, critical components of liquefaction systems",
          "Gas cycle cryogenic refrigeration systems: Classification of cryo-coolers, Stirling cycle, cryo – refrigerators, ideal cycle working principle. Schmidt's analysis of Stirling cycle, various configurations of Stirling cycle refrigerators, Gifford Mcmahoncryo- refrigerator, Pulse tube refrigerator, Cryogenic regenerators",
          "Gas Separation and gas Purification Systems: Thermodynamic ideal separation system, properties of mixtures, principles of gas separation, Linde single column air separation. Linde double column air separation and adsorption Process",
          "Vacuum Technology: Mechanical pumps, diffusion pumps, cryo-pumping, cryogenic insulation, evacuated porous insulation powder and fibers, gas filled powders and fibrous materials multilayer super-insulation, composite insulation"
        ],
        "references": [
          "Barron Randal F., Cryogenic Systems, Oxford University Press, New York, 1999.",
          "Flynn T. M., Cryogenic Engineering, 2nd ed., Maxwell Dekker, 2005.",
          "Timmerhaus K. D. and Flynn T. M., Cryogenic Process Engineering, Plenum Press, 2013.",
          "Timmerhaus Klaus D., Reed Richard Palmer, Cryogenic Engineering: 50 years of progress, Springer, 2007."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4410",
        "title": "SOLAR THERMAL SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Introduction: World energy scenario, solar radiation geometry, radiation measurement, empirical equations, radiation on tilted surfaces, incident angle",
          "Liquid Collectors: Construction and working of flat plate collector, thermal analysis of absorber plate, H-W-B equation, effect of various parameters, ASHRAE test standard and procedure, uncertainty analysis, working of evacuated tube collector, advantages, PV/T system analysis",
          "Air heaters: Performance analysis of conventional air heater, absorber plate treatment, novel designs, testing procedure and performance curves, cabinet drier",
          "Concentrating Collectors: Thermodynamic and optical limit to concentration, cylindrical parabolic system (PTC), construction, losses, thermal analysis of PTC, tracking, compound parabolic collector, performance analysis, paraboloid dish collector, thermal analysis, central receiver tower system, power cycles, fresnel lens",
          "Other Systems: Solar cooker, desalination, solar pond, solar refrigeration, green building",
          "Energy Storage: need for energy storage, sensible and latent heat storage, liquid storage tank analysis"
        ],
        "references": [
          "Goswami D. Yogi, Principles of solar engineering, CRC Press, 2015",
          "Kalogirou Soteris A., Solar Energy Engineering, Academic Press, 2014",
          "Tiwari G. N., Solar Energy, Narosa Publications, 2014",
          "Sukhatme S. P., and Nayak J. K., Solar Energy, Tata McGraw Hill, 2012"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4411",
        "title": "DESIGN OF HEAT EXCHANGERS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Classification of heat exchanger, design methods, convection correlations, overall heat transfer coefficient, thermal network, fouling resistance, pressure drop due to fouling, general design procedure",
          "Double pipe heat exchangers: Working, classification, applications, need for parallel-series flow, thermal and hydraulic analysis, bare and finned tube analysis",
          "Shell and Tube Heat Exchangers: Types, basic components, layout and geometry, applications, stream allocation, design procedure, TEMA Standard, Kern and Bell-Delaware method",
          "Compact Heat Exchangers: Different designs, design procedure, heat transfer and pressure drop calculations, plate heat exchangers, thermal performance",
          "Evaporators and Condensers: Condensation in horizontal and vertical tubes, thermal design of shell and tube condensers, horizontal and vertical condensers with tube side and shell side condensation, flow boiling correlations, thermal design of evaporators",
          "Furnace and Cooling towers: Types, fundamentals of combustion, heat transfer and heat balance in fired heaters, furnace heat transfer, working of cooling tower, classification, concept of psychrometry, energy balance, design and analysis",
          "Testing of Heat Exchangers: Procedure for different heat exchangers, performance evaluation"
        ],
        "references": [
          "Kakac Sadik, Heat exchangers: Selection, rating, and thermal design, 3rd ed., CRC Press, 2012",
          "Serth Robert W., Process Heat Transfer: Principles, Applications and Rules of Thumb, Academic Press, 2014",
          "Kern Donald Q, Process heat transfer, McGraw Hill Publication, 1997",
          "Kays W. M., and London A. L., Compact Heat Exchangers, McGraw-Hill, 1998",
          "Shah Ramesh K., Fundamentals of heat exchanger design, 1st ed., John Wiley and sons, 2003"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4412",
        "title": "JET PROPULSION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to aircraft propulsion: Jet engine performance parameters; Thrust, SFC, efficiencies, single and multispool gas turbine based propulsive devices",
          "Real cycle thermodynamic analysis: Ideal and real Brayton cycles, Jet engine cycles for aircraft propulsion",
          "Cycle components and component performance, analysis of engine real cycles",
          "Fundamentals of rotating components: Thermodynamics of compressors and turbines, development of parameters for compressor and turbines",
          "Compressors and turbines: Loss and blade performance estimation, single and multistage axial compressor characteristics, elements of centrifugal compressor, concept of rothalpy, centrifugal compressor characteristics, surging and choking",
          "Combustion systems: Combustion mechanism and important combustion parameters, combustion efficiency, combustion intensity, fuels and their properties, fuel injection systems",
          "Intakes and propelling nozzles: Requirements of an intake, aircraft intake design considerations, propelling nozzles, energy conversion in a nozzle, nozzle design considerations",
          "Engine installed performance, sizing and matching: Installed performance of engine, dimensional analysis for engine, engine off design operations, aircraft engine component matching"
        ],
        "references": [
          "Kroes Michael J., and Wild Thomas W., Aircraft Powerplants, 7th ed., Tata-McGraw-Hill, 2010",
          "Hill Philip, and Peterson Carl, Mechanics and Thermodynamics of Propulsion, Addison Wesley, 1992",
          "Roy Bhaskar, Aircraft Propulsion, Elsevier, 2008",
          "Mattingly J. D., Elements of Propulsion - Gas Turbines and Rockets, AIAA Education series, 2006",
          "El-Sayed Ahmed, Aircraft Propulsion and Gas Turbine Engines, Taylor and Francis (CRC Press), 2008",
          "Saravanamuttoo, H. I. H., Rogers G. F. C., and Cohen H., Gas Turbine Theory, 7th ed., Pearson, 2017",
          "Mathur M. L., and Sharma R. P., Gas Turbines and Jet Propulsion, Standard Publishers Distributors, Delhi, 2010",
          "Yahya S. M., Fundamentals of Compressible flow with Aircraft and Rocket Propulsion, 6th ed., New Age International Pvt.Ltd. New Delhi, 2018",
          "Ganesan V., Gas Turbines, Tata McGraw-Hill, New Delhi. 2005"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4413",
        "title": "PROCESSING OF POLYMERS AND POLYMER COMPOSITES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Engineering materials and processing techniques",
          "Thermoplastics and thermosets",
          "Thermoforming process",
          "Extrusion",
          "Compression molding",
          "Injection molding",
          "Transfer molding",
          "Rotational molding",
          "Blow molding",
          "Processing of polymer composites",
          "Hand-layup",
          "Spray-layup",
          "Press molding",
          "Reaction injection molding",
          "Autoclaving",
          "Resin transfer molding",
          "Filament winding",
          "Pultrusion",
          "VARIM",
          "RTM",
          "Vacuum bagging",
          "Sheet molding",
          "Pre-pegging",
          "Secondary processing of polymer composites",
          "Manufacturing of Composites",
          "Micromechanics of composites",
          "Testing of composites",
          "Mechanical properties (Tensile, Flexural, ILSS, impact, thermal, wear properties)",
          "Standards of testing",
          "NDT of composites"
        ],
        "references": [
          "Chawla Krishan K. Composite materials: science and engineering, Springer Science & Business Media, 2012.",
          "Mallick P. K., Fiber-reinforced composites: materials, manufacturing, and design, CRC press, 2007.",
          "Mazumdar Sanjay, Composites manufacturing: materials, product, and process engineering, CRC press, 2001.",
          "Kaw Autar K., Mechanics of composite materials, CRC press, 2005."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4414",
        "title": "METAL & CERAMIC COMPOSITE MATERIALS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Characteristics of MMC",
          "Various types of Metal matrix composites",
          "Alloy vs. MMC",
          "Advantages of MMC",
          "Limitations of MMC",
          "Metal Matrix",
          "Reinforcements",
          "particles",
          "fibres",
          "Effect of reinforcement - Volume fraction – Rule of mixtures",
          "Processing of MMC",
          "Powder metallurgy process",
          "diffusion bonding",
          "stir casting",
          "squeeze casting",
          "Deformation and damage in metal matrix composites",
          "Fatigue of discontinuous metal matrix composites",
          "Mechanical behaviour of intermetallics and intermetallic matrix composites",
          "Engineering ceramic materials",
          "properties",
          "advantages",
          "limitations",
          "Monolithic ceramics",
          "Need for CMC",
          "Ceramic matrix",
          "Various types of Ceramic Matrix composites",
          "oxide ceramics",
          "non-oxide ceramics",
          "aluminium oxide",
          "silicon nitride",
          "reinforcements",
          "particles",
          "fibres",
          "whiskers",
          "Sintering",
          "Hot pressing",
          "Cold isostatic pressing (CIPing)",
          "Hot isostatic pressing (HIPing)",
          "Structure-property relationships in ceramic matrix composites"
        ],
        "references": [
          "Nikhilesh Chawla, Krishan K. C, Metal matrix composites, Springer, 2012.",
          "Nanjappan Natarajan, Vijayan Krishnaraj and Paulo Davim J., Metal Matrix Composites Synthesis, Wear Characteristics, Machinability Study of MMC Brake Drum, Springer Briefs in Applied Sciences and technology -Manufacturing and Surface Engineering, 2014.",
          "Kainer K. U., Metal Matrix Composites: Custom-made Materials for Automotive and Aerospace Engineering, Wiley, 2006.",
          "Longbiao Li, Time-Dependent Mechanical Behaviour of Ceramic-Matrix Composites at Elevated Temperatures, Advanced Ceramics and Composites, Springer, 2020."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4415",
        "title": "MATERIALS CHARACTERIZATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Importance of materials characterization for Mechanical & Industrial Engineering",
          "Hardness and instrumentation",
          "Micro and nano indentation hardness",
          "Sample preparation for microstructure examinations",
          "Optical microscopy",
          "Topography",
          "Surface feature studies using scanning electron microscopy",
          "Elemental chemistry identification by energy dispersive spectroscopy",
          "Advanced materials characterizations using transmission electron microscopy",
          "Elemental chemistry identification using electron energy loss spectroscopy",
          "Compounds /phases",
          "Crystal structure",
          "Elemental composition by X-ray diffraction",
          "X-Ray fluorescence",
          "Scanning auger microscopy"
        ],
        "references": [
          "Spencer Michael, Fundamentals of Light Microscopy, Cambridge University Press, 1982.",
          "David B. W., and Barry Carter C., Transmission Electron Microscopy: A Textbook for Materials Science, Springer, 2009.",
          "Joseph I. G., Dale E. N., Patrick Echlin, and David C. J., Scanning Electron Microscopy and X-Ray Microanalysis, 3rd ed., 2005.",
          "Ray Egerton, Physical Principles of Electron Microscopy, Springer Science, 2005.",
          "Brandon D., and Kaplan W., Microstructural Characterization of Materials, John Wiley and Sons, 1999."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4416",
        "title": "FIBER REINFORCED COMPOSITE MECHANICS & MANUFACTURING TECHNIQUES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Importance, classification and application of composite materials",
          "Materials – Types of fibers, Thermoset and thermoplastic polymers",
          "Fiber surface treatments",
          "Processing of polymer composite materials",
          "Hand layup, Spray up, Compression, Bag molding, Pultrusion, Resin transfer molding, Injection, Filament winding",
          "Micromechanical analysis of lamina, volume, weight, density ratios",
          "Macro mechanical Behavior of a Lamina, Compliance and stiffness matrices",
          "Macro mechanical Behavior of a laminate, Classical Lamination theory",
          "Theories of failures, Maximum stress theory, Maximum strain theory, Tsai-Hill theory, Tsai Wu failure theory",
          "Testing of composite materials, tensile, compression, flexural properties"
        ],
        "references": [
          "Mallik P. K., Fiber Reinforced Composites: Materials, Manufacturing and Design, 3rd ed., CRC, 2007",
          "Kaw Autar K., Mechanics of Composite Materials, 2nd ed., CRC Press New York, 1997",
          "Agarwal B. D., Broutman L. J., and Bert C. W., Analysis and Performance of Fiber Composites, 3rd ed., Wiley, 2012",
          "Jones Robert M., Mechanics of Composite Materials, 2nd ed., Taylor & Francis Group, 1999"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4417",
        "title": "AUTOMOBILE ENGINES AND COMBUSTION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "SI and CI engines, main components, electric vehicles and hybrid vehicles components, vehicle kinetics, dynamics of vehicle motion",
          "Battery: Discharge rate, state of charge and discharge, battery pack Design, properties",
          "AC and DC machines: Motor and engine rating, DC machines, three phase A/C machines, induction machines, permanent magnet machines and switched reluctance machines",
          "Clutch and Gearbox: Different types of clutch and gear box",
          "Drive to wheels and tyres: Torque reaction, driving thrust, torque tube drive, universal joint, propeller shaft, differential gearbox, types of the rear axle, tyres - desirable tyre properties, tube, and tubeless tyres",
          "Steering and suspension system: Steering geometry, steering mechanism, steering linkages for rigid axle and independent suspension systems",
          "Brakes: Brake efficiency and stopping distance, types of brakes, balance beam compensator, antilock braking system",
          "Combustion in SI engines, combustion knock, SI engine combustion chamber, combustion in CI engines: DI and IDI systems, delay period and diesel knock, control of diesel knock, CI engines combustion chambers",
          "Automotive emission control system: Controlling crankcase and evaporative emissions, exhaust gas recirculation, air-aspirator system, catalytic converter, emission standards- Euro norms, Bharat Stage norms"
        ],
        "references": [
          "Hussain Iqbal, Electric & Hybrid Vehicles – Design Fundamentals, 2nd ed., CRC Press, 2011",
          "Larminie James, Electric Vehicle Technology Explained, John Wiley & Sons, 2003",
          "Singh Kirpal, Automobile Engineering Vol. I & II, 13th ed., Standard Publishers Distributors, New Delhi, 2017",
          "Rajput R. K., Automobile Engineering, 2nd ed., Laxmi Publication (P) Ltd, 2017",
          "Jain K. K., and R. B. Asthana, Automobile Engineering, 1st ed., Tata McGraw Hill Education, New Delhi, 2017",
          "Heywood John B, Internal Combustion Engine Fundamentals, 2nd ed., McGraw-Hill Education New York, 2018"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4418",
        "title": "AUTOMOTIVE TRANSMISSION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Different Types of Clutches - Principle - Construction and Torque Capacity",
          "Determination of Gear Ratios for Vehicles",
          "Different Types of Gearboxes Such as Sliding Mesh Gearbox – Constant Mesh Gearbox and Synchromesh Gearbox",
          "All Spur and internal Gear Type Planetary Gearboxes - Ford T-Model - Cotal and Wilson Gear Box - Determination of Gear Ratios",
          "Automatic Overdrives: Principal of Torque Conversion - Single - Multistage and Polyphase Torque Converters - Performance Characteristics",
          "Automatic Transmission: Relative Merits and Demerits When Compared to Conventional Transmission - Automatic Control of Gears",
          "Hydrostatic Drives: Advantages and Disadvantages - Principles of Hydrostatic Drive Systems"
        ],
        "references": [
          "Heldt P. M., Torque converters, Chilton Book Co., 1992.",
          "Garrett T. K., Steeds W., and Newton K., The Motor vehicle, 13th ed., Butterworth-Heinemann, 2001.",
          "Judge A.W., Modern Transmission systems, Chapman and Hall Ltd., 1990.",
          "Crouse W. H., and Anglin D. L., Automotive Transmission and Power Trains construction, McGraw Hill, 1983."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4419",
        "title": "ELECTRIC AND HYBRID VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Hybrid vehicles – Performance characteristics of road vehicles – calculation of road load – predicting fuel economy – grid connected hybrids",
          "Hybrid architecture – Series, Parallel and Series Parallel Configuration Locomotive Drives – Switching – Load Tracking Architecture",
          "Hybrid Power plant specifications – Grade and Cruise Targets – Launching and Boosting – Braking and Energy Recuperation – Drive Cycle Implications",
          "Sizing the drive system, matching electric drive and ICE, Sizing the propulsion Motor, Power Electronics",
          "Fuel Cell characteristics – Fuel Cell Types – Alkaline Fuel Cell – Proton Exchange Membrane – Direct Methanol Fuel Cell – Phosphoric Acid Fuel Cell",
          "Nonelectric Hybrid Propulsion Systems – Short Term Storage, Flywheel, Accumulators – Continuously Variable Transmission"
        ],
        "references": [
          "Halderman James D., and Martin Tony, Hybrid and Alternative Fuel Vehicles, 2nd ed., 2010",
          "Arvid Linde, How your car works: Your guide to the components and systems of modern cars, Including Hybrid and Electric Vehicles, Rac Handbook, 2011",
          "Hussain Iqbal, Electric & Hybrid Vehicles – Design Fundamentals, 2nd ed., CRC Press, 2011",
          "Chris Mi, Masrur M. Abul, and David Wenzhong Gao, Hybrid Electric Vehicles: Principles and Applications with Practical Perspectives, 2011"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4420",
        "title": "AUTOTRONICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Principle and construction of Lead Acid and Lithium – Ion Battery",
          "Characteristics of battery, rating capacity and efficiency of batteries",
          "Conditions at starting, behavior of starter during starting, series motor and its characteristics, principle and construction of starter motor, Bendix type, solenoid operated and axle type of starter motor",
          "Generation of direct current, shunt generator characteristics, armature reaction, cutout, voltage and current regulators",
          "Inductive, Hall effect, thermistors, piezo electric, piezo resistive based sensors, Solenoids",
          "Components for electronic engine management system, open and closed loop control strategies, PID control, look up tables",
          "Layout and working of SI Engine Management Systems",
          "Group and Sequential Injection Techniques",
          "MPFI, GDI, advantages of electronic Ignition systems",
          "Cold start and warm up phases, idle speed control, acceleration and full load enrichment, deceleration fuel cutoff"
        ],
        "references": [
          "B echhold, Understanding Automotive Electronics, SAE, 1998",
          "Crouse W.H., Automobile Electrical Equipment, McGraw Hill Book Co. Inc. New York, 3rd ed., 1986",
          "J udge A. W., Modern Electrical Equipment of Automobiles, Chapman & Hall, London, 1992",
          "Young A. P., and Griffiths. L., Automotive Electrical Equipment, ELBS & New Press, 1999"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MIE 4421",
        "title": "ROBOTICS: MECHANICS AND CONTROL",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Definition of robots, Automation and Robotics, History of Robots, Anatomy of Robot, Robot configuration, Robot Motions, Work Volume, Drive System, Control System, Precision of movement, Specification of a robot, Applications of industrial robots",
          "Robot Motion Analysis: Coordinate frames, Mapping and Transforms, Inverting a homogeneous transform, Euler angle representation, Kinematic modelling of the manipulator, Joint Notations in kinematics, Denavit–Hartenberg Notation, Manipulator Transformation matrix, Inverse Kinematics, Position Representation, Robot arm/manipulator, Forward and reverse transformation of 2 degree of freedom arm",
          "Robot end effectors: Types end effectors, Mechanical grippers and their mechanisms, Force analysis of gripper, vacuum cups, magnetic grippers, hooks and scoops, tools as end effectors, Physical support of the end effectors, Power and signal transmission, Guidelines for gripper selection",
          "Trajectory Planning: Joint-space schemes, Cartesian-space schemes, Geometric problems with Cartesian paths, path generation at run time, collision free path planning",
          "Robot Control Systems: Control system concepts, Mathematical models, Transfer Functions, Characteristic equation for spring mass dampener system, Types of controllers"
        ],
        "references": [
          "Mittal R. K., and Nagrath I. J., Robotics and Control, Mc Graw Hill Education (India) Pvt. Ltd.",
          "Groover Mikell P., Weiss Mitchel, Nagel Roger N., Odrey Nicholas G., and Dutta Ashish, Industrial Robotics, 2nd ed., McGraw Hill Education (India) Pvt. Ltd, 2012",
          "Craig John J., Introduction to Robotics: Mechanics and Control, Pearson Prentice Hall Publication",
          "Janakiraman P. A., Robotics and Image processing, Tata McGraw Hill, 1995"
        ],
        "flags": [
          "inferred_semester_from_code"
        ]
      },
      {
        "sem": 4,
        "code": "MIE 4422",
        "title": "ELEMENTS OF MECHATRONICS SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Definition, basic concepts and elements of mechatronic systems, needs and benefits of mechatronics in manufacturing",
          "Sensors, Transducers: Displacement. Piezoelectric actuators, Shape memory alloys",
          "Hydraulic & Pneumatic devices – Power supplies, valves, cylinder sequencing",
          "Data acquisition and translation: Signal conditioning – Operational amplifiers, inverting amplifier, differential amplifier, Protection, comparator, filters, Multiplexer, Pulse width Modulation Counters, decoders, ADC, DAC Signal Analysis - Linearization of data, Compensation, Signal Averaging, Fourier analysis",
          "Data presentation system: Display - Cathode ray oscilloscope, LED, LCD, Printers, Magnetic Recording, Controllers and Algorithms: Microprocessor Applications"
        ],
        "references": [
          "Alciatore David G., and Histand Michael B., Introduction to Mechatronics and Measurement systems, Tata McGraw Hill, 2003",
          "Boltan W., Mechatronics, Addison Wesley Longman Ltd, 1999",
          "Shetty Devdas, and Kolk Richard, Mechatronics System Design, PWS Publishing, 2001",
          "Nesculescu Dan, Mechatronics, Pearson Education Pvt. Ltd, 2002"
        ],
        "flags": []
      },
      {
        "code": "MIE 4423",
        "title": "FLUID DRIVES AND CONTROL",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Hydraulic systems: Advantages and limitations; Pascal's law; Force transmission in hydraulics",
          "Hydraulic actuators, accessories and valves: Actuators: linear, rotary, and telescopic; Accumulator: types, and applications; Construction, and working of direction control valves: 2/2 way, 3/2 way, 4/2 way, 4/3 way; Hydraulic circuits: Regenerative; Meter in, and meter out; Bleed off; Sequencing; Pressure reducing circuits; Electro hydraulic circuits",
          "Introduction to pneumatic systems: Advantages, limitations, and applications; Manual pneumatics: Symbols of pneumatic valves; Traverse time diagram; Design of manually operated circuits; Control of multiple actuators",
          "Electropneumatics: Introduction; Structure of signal flow; Advantages of electro pneumatics; Limit switches; Proximity sensors: Magnetic, Inductive, Capacitive, Optical, Ultrasonic, and Pneumatic; electrically actuated direction control valves; Relay control systems; Design of electro pneumatic circuits"
        ],
        "references": [
          "Croser Peter, and Ebel Frank, Pneumatics Basic Level TP 101, Festo Didactic GMBH Co, Germany, 2002",
          "Prede G. and Scholz D., Electropneumatics Basic Level, Festo Didactic GMBH & Co, Germany, 2002",
          "Merkle D., Schrader B., and Thomes M., Hydraulics Basic Level TP 501, Festo Didactic GMBH & Co, Germany, 1998",
          "Rohner Peter, Industrial Hydraulic Control, John Wiley & Sons, Brisbane, 1989"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4424",
        "title": "MECHANICAL HANDLING SYSTEMS AND EQUIPMENTS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Elements of Material Handling System: Importance, Terminology, Principles and features, Objectives and benefits of better material handling; Selection of Material Handling Equipment: Factors affecting for selection, material handling equation, choices of material handling equipment; General analysis and procedure: Basic analytic techniques, the unit load concept; Selection of suitable types of systems for applications",
          "Design of Mechanical Handling Equipment: Design of hoists, drives for hoisting components and hoisting mechanisms; rail travelling components and mechanisms; hoisting gear operation during transient motion",
          "Design of load lifting attachments: Load chains and types of ropes used in material handling system; forged, standard and Ramshom Hooks; crane Grabs and Clamps; Grab Buckets",
          "Equipment of Material Storage: Objectives of storage, Bulk material handling; gravity flow of solids through slides and chutes; Storage in bins and hoppers; Material Handling / warehouse automation and safety considerations – storage and warehouse planning and design; computerized warehouse planning; Need, Factors and Indicators for consideration in warehouse automation; which function, when and How to automate"
        ],
        "references": [
          "Michael Rivkin, Bulk Material Handling, Partridge Publishing Singapore, 2018",
          "Charles Reese, Material Handling Systems, Taylor & Francis, 2000",
          "C.R. Woodcock & J.S. Mason, Bulk Solids Handling, Springer Netherlands, 2012",
          "Jacob Fruchtbaum, Bulk Materials Handling Handbook, Springer US, 2013",
          "Siddhartha Ray, Introduction to Materials Handling, New Age International Private Limited, 2007"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4425",
        "title": "STATISTICAL QUALITY CONTROL",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Definitions of the term quality",
          "Causes of variation",
          "Patterns of variation",
          "Frequency distribution",
          "Measures of central tendency and dispersion",
          "The Normal distribution curve",
          "Inequality theorems",
          "Shewhart's bowl drawing experiments",
          "Control charts for variables (X , R and s charts)",
          "Type I and Type II Errors",
          "Process capability analysis",
          "Process capability indexes",
          "Control charts for attributes (p ,np, c and u charts)",
          "Acceptance sampling by attributes",
          "Single and Double sampling plans",
          "Operating characteristic curve",
          "Acceptable quality level",
          "Lot tolerance percent defective",
          "Average outgoing quality",
          "Average total Inspection",
          "Average fraction inspected",
          "Producers risk",
          "Consumers risk",
          "Acceptance sampling tables",
          "Conventional and Statistical tolerancing",
          "Precision",
          "Accuracy and Reproducibility of method of measurements",
          "Quality costs"
        ],
        "references": [
          "Grant E. L., and Levenworth R., Statistical Quality Control, McGraw Hill Publications, 2005",
          "Montgomery D.C., Introduction to Statistical Quality Control, John Wieley and Sons, 2005",
          "Mahajan M.S., Statistical Quality Control, Dhanpat Rai and Co. Pvt. Ltd., 2012",
          "Juran J.M., and Gryna F.M., Quality Planning and Analysis, Tata McGraw Hill Publications, 1995"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4426",
        "title": "PRODUCTION PLANNING AND CONTROL",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Functions of production, planning and control",
          "Types of production activities",
          "Production consumption cycle",
          "Importance and uses of forecasting",
          "Type of forecasts",
          "Qualitative methods of forecasting",
          "Quantitative methods of forecasting",
          "Exponential smoothing",
          "Linear regression analysis",
          "Correlation analysis and Seasonality",
          "Forecast control",
          "Need and inputs for aggregate production planning",
          "Pure and mixed strategies of aggregate planning",
          "Aggregate planning approach",
          "Factors affecting job shop scheduling",
          "Index method",
          "Priority sequencing rules",
          "Determination of mean flow time, average job lateness and average number of jobs in the system",
          "Sequencing of 'n' jobs through 'n' machines",
          "Classification of inventories",
          "Economic order quantity",
          "Inventory control models",
          "Effect of quantity discount",
          "Safety stock",
          "Reorder level",
          "Lead time",
          "ABC Analysis",
          "Product structure tree",
          "MRP inputs and outputs",
          "MRP logic",
          "Problems",
          "Meaning and determination of cycle time and theoretical minimum number of workstations",
          "Precedence diagram",
          "Priority rules for allocation of tasks to workstations",
          "Longest work element time rule",
          "Maximum following tasks rule",
          "Calculation of efficiency and percentage delay loss"
        ],
        "references": [
          "Monks Joseph G., Operations Management, Tata McGraw-Hill Publishing Co. Ltd., New Delhi, 2004.",
          "Krajewski Lee J., and Ritzman Larry P., Operations Management, Pearson Education (Singapore) Pte. Ltd., Delhi, 2005.",
          "Adam Everett E. Jr., and Ebert Ronald J., Production and Operations Management, Prentice Hall of India Pvt. Ltd., New Delhi, 2002.",
          "Chase Richard B., Aquilano Nicholas J., and Jacobs F. Roberts, Production and Operations Management, Tata McGraw-Hill Publishing Co. Ltd., New Delhi, 1999."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "MIE 4427",
        "title": "OPERATIONS RESEARCH",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: Definition, Phases, Applications, Advantages and Limitations of Operations Research",
          "Linear programming problems: Assumptions, Formulation of LPP for business and non-business applications, Graphical solutions, Special cases – Degeneracy, Infeasible Solution, Unbalanced and Multiple optimal solutions, Minimization and Maximization cases, Simplex algorithm, Concept of dual, Sensitivity analysis with respect to objective function coefficients and R.H.S. values",
          "Transportation problem: Formulation, North-West Corner (NWC) Method, Least Cost (LC) Method, Vogel's Approximation Method (VAM), Testing the solution by Stepping stone, Modified Distribution (MODI) Method, Maximization, Multiple optimal solutions, Degeneracy and Unbalanced problems, Post optimality analysis",
          "Assignment problem: Solution algorithm for Assignment Problems, Unbalanced, multiple optimal solutions, Maximization and Application problems",
          "Travelling salesman / Job sequencing problem: Solution algorithm for Travelling Salesman Problem, Application to job sequencing problem",
          "Game theory: Introduction to game theory, Two-person-zero sum games, Pure and Mixed Strategies, Solution methods for 2 x 2 games, Graphical method (2 x n games; m x 2 games)",
          "Simulation of queuing system - Steps in simulation, Application and Limitations, Monte-Carlo technique-Problems involving Waiting line situations and Selection of crew members",
          "Critical Path Method (CPM): General framework, Introduction to elements of network, conventions adapted in drawing network, analysing the network, Calculation of event and Activity times, Total Float, Free Float, Independent float, Critical path, Determination of project duration, Project Crashing, Applications and Limitations of CPM",
          "Project Evaluation and Review Technique (PERT): Calculation of Probabilistic/Expected event and Activity times, Variance of activity duration, Determination of critical path, probability/expectation of project completion"
        ],
        "references": [
          "Taha H. A., Operations Research, Pearson Education, 7th ed., 2002",
          "Winston W. L., Operations Research, Thomson Asia, 2003",
          "Vohra N. D., Quantitative Techniques in Management, New Delhi, 2007",
          "Sharma S. D., Operations Research, Kedar Nath Ramnath Publications, 14th ed., 2005",
          "Wagnor Hervey M., Principles of Operations Research, Prentice Hall of India Private Ltd, 1999",
          "Paul Loomba, Management, A Quantitative Perspective, MacMillan, New York, 1978"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MIE 4428",
        "title": "TOTAL QUALITY MANAGEMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Definition of quality and Total quality management (TQM)",
          "Basic concepts of TQM",
          "Contributions of Gurus of TQM",
          "Benefits of TQM",
          "Characteristics of successful quality leaders",
          "The Deming philosophy",
          "Quality council",
          "Quality statements",
          "Strategic planning",
          "Customer satisfaction",
          "Employee involvement",
          "Continuous process improvement",
          "Juran Trilogy",
          "PDSA cycle",
          "Kaizen",
          "Six sigma",
          "Supplier partnership",
          "Performance measures",
          "Quality costs",
          "Benchmarking",
          "Quality function deployment (QFD)",
          "QFD process",
          "Failure Mode and Effect Analysis (FMEA)",
          "Total Productive Maintenance (TPM)",
          "The seven tools of quality control",
          "Statistical fundamentals",
          "Control charts for variables and attributes",
          "Concept of six sigma quality",
          "Taguchi's quality loss function",
          "Quality and environmental management systems",
          "Quality auditing",
          "Case Studies"
        ],
        "references": [
          "Besterfield Dale H., Besterfield-Michna Carol, Besterfield Glen, Besterfield-Sacre Mary, Urdhwarshe Hemant, and Urdwarshe Rashmi, Total Quality Management. Revised 3rd ed., Pearson Education, New Delhi, 2012",
          "Evans James R., and Lindsay William M., The Management and Control of Quality, 5th ed., South-Western Thomson Learning, 2002",
          "Oakland John S., Total Quality Management text with Cases, Elsevier, New Delhi, 2006",
          "Besterfield Dale H., Total Quality Management, Pearson Education, Delhi, 2006"
        ],
        "flags": [
          "sem_inferred_from_course_code",
          "minor_specializationMentioned_but_not_mapped"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4429",
        "title": "PROGRAMMING IN MECHANICAL ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to programming",
          "Programming the matrix algebra",
          "Programming for plotting engineering charts",
          "Programming applications in numerical analysis",
          "Programming case studies in mechanical engineering",
          "Solid geometry",
          "Engineering mechanics",
          "Geometric Transformations",
          "Machine design",
          "Mechanical vibration",
          "Fluid mechanics",
          "Thermal science",
          "FEA of structural systems"
        ],
        "references": [
          "Rao V. Dukkipati, MATLAB for Mechanical Engineers, New Age Science Limited, 2009.",
          "Rao V. Dukkipati, Solving Engineering Systems Dynamics Problems with MATLAB, New Age International (P) Limited, 2007.",
          "Steven T. Karris, Numerical Analysis Using MATLAB® and Spreadsheets, 3rd ed., Orchard Publications, 2007.",
          "Orbaiceta, Angel Sola. Hardcore Programming for Mechanical Engineers: Build Engineering Applications from Scratch. No Starch Press, 2021.",
          "Alex Kenan, Python for Mechanical and Aerospace Engineering, Licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License, 2020.",
          "Amos Gilat, MATLAB®An Introduction with Applications, 4th ed., JOHN WILEY & SONS, INC., 2011."
        ],
        "flags": [
          "missing_semester",
          "uncertain_tags"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4430",
        "title": "METAHEURISTIC OPTIMIZATION TECHNIQUES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Introduction to Optimization: Optimization, mathematical structure of an optimization problem, terminologies",
          "Evolutionary optimization techniques: Types of evolutionary optimization techniques, the Genetic Algorithm (GA), structure and working principle of the GA",
          "Swarm intelligence optimization techniques: Types of swarm intelligence optimization techniques, the Particle Swarm Optimization (PSO) technique, structure and working principle of the PSO",
          "Algorithmic-specific-parameter-less optimization techniques: Limitations of the advanced metaheuristic optimization techniques, the Teaching Learning Based Optimization (TLBO) technique, the JAYA optimization technique, structure and working principle of the TLBO and JAYA",
          "Multi-objective optimization problems: Singleobjective versus the multi-objective optimization, Approaches of solving multi-objective optimization problems",
          "Application of optimization techniques to Mechanical Engineering problems"
        ],
        "references": [
          "Bozorg-Haddad Omid, Solgi Mohammad, and Loáiciga Hugo A., MetaHeuristic and Evolutionary Algorithms for Engineering Optimization, John Wiley & Sons, Inc., 2017",
          "Deb Kalyanmoy, Multi-objective optimisation using evolutionary algorithms, Wiley, 2001",
          "Goldberg David E., Genetic Algorithms in Search, Optimization, and Machine Learning, Addison-Wesley Professional, 1989",
          "Sun Jun, Lai Choi-Hong, and Wu Xiao-Jun, Particle Swarm Optimisation Classical and Quantum Perspectives, CRC Press, Taylor & Francis Group, 2019",
          "Rao RavipudiVenkata, Jaya: An advanced Optimization Algorithm and its Engineering Applications, Springer International Publishing, 2019"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4431",
        "title": "MACHINE LEARNING AND ITS APPLICATIONS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Machine Learning Definition and Basics",
          "Learning Models - Supervised Learning (Classification Problem, Regression Problem), Unsupervised Learning, Semi supervised Learning, Reinforcement Learning",
          "Regressions - Linear Regression, Normal Equation Method vs Gradient Descent Method, Logistic Regression",
          "Model improvement - Nonlinear Contribution, Feature Scaling, Gradient Descent Algorithm Variations, Regularization, Multi-class Classifications",
          "Classification - Nonlinear Decision Boundary, Skewed Class, Naïve Bayes' Algorithm, Support Vector Machines - Kernel Selection",
          "Random Forests - Decision Tree, Disadvantages of Decision Trees, Data Bagging, Feature Bagging, Cross Validation, Prediction in Random Forests, Disadvantages of Random Forests",
          "Testing the Algorithm and the Network",
          "Artificial Neural Networks - Neural Network Representation, Training the Network, Backpropagation, Updating weights, Controlling computations",
          "ML case studies in Mechanical Engineering - Implementation of machine learning models to solve problems in Design Engineering, Thermal sciences, Vibration analysis, Materials engineering, Manufacturing engineering"
        ],
        "references": [
          "Jo T., Machine Learning Foundations Supervised, Unsupervised, and Advanced Learning, In Machine Learning Foundations, Springer International Publishing, 2021.",
          "Kramer O., Machine learning for evolution strategies, Springer International Publishing, 2016.",
          "Rebala G., Ravi A. and Churuwala S., Introduction to Machine Learning, In Studies in Computational Intelligence, Vol. 975, 2021.",
          "Manohar Swamynathan, Mastering Machine Learning with Python in Six Steps, A Practical Implementation Guide to Predictive Data Analytics Using Python, Second Edition, APress, 2019.",
          "Rodrigo Fernandes De Mello and Moacir Antonelli Ponti, Machine Learning, A Practical Approach on the Statistical Learning Theory, Springer International Publishing AG, 2018.",
          "Oliver Theobald, Machine Learning For Absolute Beginners: A Plain English Introduction, 3rd ed., 2021."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MIE 4432",
        "title": "MICROCONTROLLER BASED AUTOMATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Introduction to microcontrollers",
          "embedded system and automation",
          "Instruction set architecture of ARM microcontroller",
          "Embedded C programming",
          "sensors",
          "actuators and their interfacing",
          "Microcontroller development boards and embedded programming platforms",
          "D/A and A/D converter",
          "Timers",
          "Delay generation",
          "PWM",
          "Inter Integrated Circuit communication",
          "Universal Asynchronous Receiver/Transmitter",
          "Serial Peripheral Interface communication protocols",
          "Temperature sensing unit",
          "Light sensing unit",
          "Sound sensing unit",
          "Feedback control system",
          "relay control unit",
          "driving electrical appliances like motors",
          "bulb",
          "pump",
          "motion sensing using accelerometer",
          "control of appliances",
          "case study based on automation sectors"
        ],
        "references": [
          "CemÜnsalan, Hüseyin Deniz Gürhan, Mehmet ErkinYücel, Embedded System Design with Arm Cortex-M Microcontrollers, Springer Cham, 2022",
          "Mazidi, and Naimi, STM32 Arm Programming for Embedded Systems, Microdigitaled, 2018",
          "Carmine Noviello, Mastering STM32, A step-by-step guide to the most complete ARM Cortex-M platform, LeanPub.com, 2022",
          "Donald Norris, Programming with STM32: Getting Started with the Nucleo Board and C/C++, McGraw-Hill Education, 2018",
          "Dogan Ibrahim, Nucleo Boards Programming with the STM32CubeIDE, ElektorVerlag, 2022",
          "Yury Magda, ARM Assembly Language Programming With STM32 Microcontrollers: Learning By Example, 2020",
          "https://www.st.com/en/development-tools/stm32cubeide.html"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "ELE 4415",
        "title": "EV BATTERY TECHNOLOGY AND POWERTRAIN DEVELOPMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Battery Fundamentals: Basics of Batteries, Battery Parameters, Lithium-Ion Characteristics, Thermal Runaway, Battery Management System (BMS), Functionality, Practical session - Battery Selection and Connection Process with Vehicle Sensors",
          "Battery Management Systems: SOC/SOH Estimation, Cell Balancing, Protection, Thermal Management, CAN Communication, Practical session - BMS development",
          "Battery Pack Design & Modelling: Overview of Battery & BMS System, Electrical Design, Mechanical Design: Calculations and Mechanical Design using ANSYS, Heat Transfer, Thermal Design of Battery Pack, Battery Pack Assembly and Test, Thermal Analysis on Battery Pack, MATLAB/Simulink-based Battery Pack Modelling, Practical session - Battery life cycle testing",
          "Powertrain and Charging Systems of Electric Vehicles: Introduction to EV Powertrain, Overview, Architecture and Components of EV Powertrain, Thermal Management of EV Powertrain, EV Charging Systems and Types of Chargers",
          "Modelling, Simulation, and Analysis of EV Powertrain Components: Modelling and Simulation of EV Powertrain Components in MATLAB, Modelling and Analysis of EV Powertrain Components in SolidWorks, Analysis of EV Powertrain Components in ANSYS, Case Study on Powertrain of Existing Models"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", Wiley, 2nd ed, 2012, ISBN: 978-1-119-94273-3",
          "JIANGONG, D. H. Z., “Advances in lithium-ion batteries for electric vehicles: Degradation Mechanism, health estimation, and lifetime prediction”, Elsevier – Health Science, 2024, ISBN-13: 9780443155437",
          "R. Xiong, “Battery Management Algorithm for Electric Vehicles”, Springer, 2020, ISBN-13: 9789811502507",
          "Rui Xiong and Weixiang Shen, “Advanced battery management technologies for electric vehicles”, John Wiley & Sons Inc, 2019, ISBN-13: 9781119481645",
          "Hannes Hick, Klaus Kupper, and Helfried Sorger, “Systems engineering for automotive powertrain development”, Springer, 2021, ISBN-13: 9783319996288",
          "Christopher D. Rahn, \"Battery Systems Engineering\", Wiley, 1st Ed, 2013, ISBN:9781119979500",
          "Noshin Omar, \"Electric Vehicle Batteries: Moving from Research towards Innovation\", Reports of the PPP European Green Vehicles Initiatives, Springer, 2015",
          "Gonzalo Abad and Joaquim Lois, “Power Electronics and Electric Drives for Traction Applications\", Wiley, 2016, ISBN: 978-1-118-95442-3",
          "John G. Hayes and G. Abas Goodarzi, Electric Powertrain: Energy Systems, Power Electronics and Drives for Hybrid, Electric and Fuel Cell Vehicles\", Wiley, 2017, ISBN: 978-1-119-06364-3"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "code": "AAE 4425",
        "title": "Extraction Failed",
        "sem": null,
        "credits": null,
        "tags": [
          "error"
        ],
        "syllabus": [],
        "references": [],
        "flags": [
          "extraction_failed"
        ]
      },
      {
        "code": "ELE 4417",
        "title": "Extraction Failed",
        "sem": null,
        "credits": null,
        "tags": [
          "error"
        ],
        "syllabus": [],
        "references": [],
        "flags": [
          "extraction_failed"
        ]
      },
      {
        "sem": null,
        "code": "AAE 4426",
        "title": "EV FEA Analysis",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory",
          "lab"
        ],
        "syllabus": [
          "Theory of FEA/CAE",
          "Introduction to Hyper Mesh",
          "Creating and Modifying Geometry",
          "Geometry Clean-up and Defeature",
          "Introduction to 2D Meshing",
          "Introduction to 3D Meshing",
          "Element Quality, Mesh Edit",
          "Introduction to Plastic Meshing",
          "Introduction to 1D Meshing",
          "Modal Analysis",
          "Linear Static Analysis",
          "Buckling Analysis",
          "Connectors",
          "Optimization techniques using Hyper Mesh",
          "Introduction to Abaqus Software",
          "Fundamentals of FEA-Stress",
          "About Abaqus Software-Features",
          "Applications of Abaqus Software in Different Industries",
          "Simple Modelling in Abaqus Software",
          "Create Material and Create Assembly",
          "Create Steps, Loads, Boundary Conditions",
          "Generate Mesh, Result Visualization",
          "Multi physics analysis using Abaqus",
          "One Dimensional Analysis",
          "Linear Static Analysis and Linear Buckling Analysis",
          "Heat Transfer Analysis",
          "Non-linear Analysis",
          "Dynamic Simulation-Modal Analysis",
          "Impact Analysis",
          "Time-Dependent Load Analysis",
          "Basics of Finite-Element Analysis (FEA) along with ANSYS Tool and Software Interface",
          "Essential Mechanical and Electrical Properties of Materials",
          "Various Case Studies on ANSYS Mechanical",
          "Basics of Computational Fluid Dynamics (CFD)",
          "Various Case Studies on ANSYS Fluent",
          "FEA analysis using ANSYS",
          "Simulation of Battery Thermal Management in Electric Vehicle",
          "Vibration and Fatigue Analysis of Battery Pack",
          "Simulation of Structural Integrity for Motor Mount",
          "Thermal Analysis of Liquid-Cooled Radiator",
          "CFD Study of External Cooling Mechanism for Battery Pack",
          "Vulnerability analysis"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained”, Wiley, 2nd ed, 2012, ISBN: 978-1-119-94273-3",
          "Eric Miller and Jeff Strain, “Introduction to the ANSYS Parametric Design Language (APDL)”, Phoenix, 2nd Ed, 2016, ISBN: 978-1537133997",
          "Narayana, Lakshmi, et al., “Advances in Automation, Signal Processing, Instrumentation, and Control”, Springer, 2021, ISBN 9789811582202",
          "P Seshu., “Textbook of Finite Element Analysis”, Prentice-Hall of India, 2010, ISBN-13: 9788120323155",
          "Turner, John., “Progress in Modelling and Simulation of Batteries”, SAE International, 2016, ISBN-13: 9780768082821",
          "Y Nakasone, et al., “Engineering Analysis with ANSYS Software”, Butterworth-Heinemann, 2018, ISBN-13: 9780081021644",
          "Mohamed Amine Fakhfakh, “Modeling and Simulation for Electric Vehicle Applications”, BoD – Books on Demand, 2016, ISBN-13: 9789535126362",
          "Atul Sharma, \"Introduction to Computational Fluid Dynamics: Development, Application and Analysis\", Wiley, 1st Ed, 2017, ISBN: 9781119002994",
          "\"Introduction to Electric Vehicles\" - offered by IIT Delhi on NPTEL Link: https://archive.nptel.ac.in/courses/108/106/108106170/"
        ],
        "flags": [
          "missing_semester",
          "possible_combined_reference_entry"
        ]
      }
    ]
  }
}