{
  "department": {
    "name": "MECHATRONICS",
    "courses": [
      {
        "sem": 3,
        "code": "MAT 2121",
        "title": "ENGINEERING MATHEMATICS - III",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Gradient, divergence and curl",
          "Line, surface and volume integrals",
          "Green's, divergence and Stoke's theorems",
          "Fourier series of periodic functions",
          "Half range expansions. Harmonic analysis",
          "Fourier integrals. Sine and cosine integrals, Fourier transform, Sine and cosine transforms",
          "Partial differential equation- Basic concepts, solutions of equations involving derivatives with respect to one variable only",
          "solutions by indicated transformations and separation of variables",
          "One-dimensional wave equation, one dimensional heat equation and their solutions",
          "Numerical solutions of boundary valued problems, Laplace and Poisson equations and heat and wave equations by explicit methods"
        ],
        "references": [
          "Erwin Kreyszig: Advanced Engineering Mathematics, (5e) 1985 Wiley Eastern",
          "S.S.Sastry : Introductory Methods of Numerical Analysis (2e)1990, Prentice Hall",
          "B.S.Grewal : Higher Engg.Mathematics, 1989 Khanna Publishers",
          "Murray R.Spiegel : Vector Analysis, Schaum Publishing Co."
        ],
        "flags": [
          "missing_sem_in_text"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2121",
        "title": "DATA STRUCTURES AND ALGORITHMS",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Python Programming: Data types, I/o statements, Conditional and Looping statements, Functions",
          "Stacks, Queues, Evaluation of expressions",
          "Linked lists-singly, doubly, header node, circular along with application",
          "Trees- Binary trees, In-order, Preorder and Post order traversal of Trees",
          "Creation, Insertion and Deletion operations on Binary search tree",
          "Sorting - Bubble sort, Selection sort, Merge sort, Quick sort, Heap sort",
          "Searching - Linear search, Binary search",
          "Horspool algorithm",
          "Open Hash table",
          "Floyd's algorithm",
          "Warshall's algorithm",
          "Prim's algorithm",
          "Kruskal's algorithm",
          "Dijkstra's algorithm"
        ],
        "references": [
          "Bradley N. Miller, David L. Raum, Problem Solving with Algorithms and Data Structures using Python, (3e), FBA Publishers, 2018",
          "Agarwal Basant, Baka Benhamin, Hands-On Data Structures and Algorithms with Python, (2e), Packt Publishing, 2018",
          "Dinesh P. Mehta, SartajSahni, Handbook ofData Structures and Applications, (2e), CRC Press, 2018"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2122",
        "title": "DIGITAL DESIGN AND VERILOG PROGRAMMING",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Logic Families",
          "Review of logic minimization techniques",
          "Weighted and unweighted codes",
          "Binary Adder/ Subtractor",
          "BCD Adder",
          "code converters",
          "Binary comparators",
          "Parity generator/ checker",
          "Combinational circuit design using logic blocks: multiplexers, demultiplexers, encoders, priority encoder, decoder",
          "Shannon's decomposition",
          "Sequential Logic Design: Latches, Flip-flops: Design of synchronous and asynchronous counters, Shift registers",
          "Synchronous Sequential machines: classification, finite state machine (FSM), analysis and design",
          "Introduction to Verilog HDL: VHDL versus Verilog, Structural modeling, Data-flow Modeling, Behavioral Modeling, Switch Level Modeling, Tasks and Functions, Test Bench",
          "Digital Implementation Options and FPGA Architectures: Full-custom and semi-custom, PLD, ASICs: CPLDs, MPGAs and FPGAs, Architecture of ACTEL and XILINX logic family"
        ],
        "references": [
          "Zvi Kohavi, Niraj K Jha, Switching and Finite Automata Theory, (3e), Cambridge, 2010",
          "Morris Mano, Digital design, (3e), Prentice Hall of India, 2002",
          "Floyd and Jain, Digital Fundamentals, (11e), Pearson Education, 2015",
          "A. Anand Kumar, Switching Theory and Logic Design, (2e), Prentice Hall of India, 2009",
          "Bhasker. J, A Verilog HDL Primer, (3e), Star Galaxy, 2016",
          "Stephen. Brown and Zvonko Vranesic, Fundamentals of Digital Logic with Verilog Design, (3e), Tata McGraw Hill, 2014",
          "M. J. S. Smith, Application Specific ICs, Pearson Education, 2004"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2123",
        "title": "DIGITAL AND ANALOG CMOS DESIGN",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Moore's law",
          "VLSI technology trends",
          "BJT versus MOS",
          "MOSFET: types",
          "VI characteristics and regions of operation",
          "second-order effects",
          "NMOS and CMOS inverter",
          "pass transistors and transmission gates",
          "CMOS circuit realisation of combinational circuits using switch logic and gate logic",
          "CMOS fabrication process",
          "Stick diagrams",
          "Layouts",
          "delay unit",
          "CMOS inverter delay",
          "Analog versus digital",
          "Analog building blocks: Current Mirror, VFOA, CFOA, CCII, OTA",
          "Operational Amplifier: block diagram representation",
          "ideal and practical characteristics",
          "Linear and non-linear applications of Op-amp",
          "Active-RC filters",
          "Data converters"
        ],
        "references": [
          "Pucknell D. A and Eshraghian K, Basic VLSI Design, (3e), PHI Publication, 2015",
          "R. Jacob Baker, Harry W. Li, David E. Boyce, CMOS: Circuit design, Layout, and SimulationWiley-IEEE Press, 2019",
          "Ramakant A. Gaikwad, Op-Amps and Linear Integrated Circuits, Prentice Hall of India, (4e), 2015",
          "Stanley William D., Operational Amplifiers with Linear Integrated Circuits, Prentice Hall, 2 004",
          "Franco Sergio, Design with Op-amps and Analog Integrated Circuits, McGraw Hill, (3e), 2017",
          "Choudhury Roy D and Shail B. Jain, Linear Integrated Circuits, Wiley Eastern, (4e), 2018"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 2124",
        "title": "MECHANICS OF ROBOTICS SYSTEMS",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to robotics - types and specification of robots, DoF, configurations, control resolution, spatial resolution, accuracy and repeatability, actuators and sensors, drives and transmission systems used in robotics",
          "Kinematic analysis & coordinate transformation - Direct kinematic problem in robotics, homogeneous transformation matrices, joint space, cartesian space, Denavit-Hartenberg method, Inverse manipulator kinematics solvability, robot kinematics constraints, robot workspace, holonomic robots, Jacobian matrix, Jacobian singularity",
          "Trajectory generation - general considerations in path description and generation, joint-space schemes, cartesian-space schemes",
          "Manipulator dynamics - Newton's equation, Euler's dynamic formulation, iterative vs. closed form, Lagrangian Formulation of Dynamics, Introduction to 3D rigid body dynamics: The Inertia Tensor",
          "Kinematic modeling of planar and spatial parallel manipulators, Closed-loop equation, four-bar and slider-crank mechanism, Stewart platform",
          "Feedback and closed-loop control (SISO & MIMO), second-order linear systems, Case studies",
          "Self-study: Kinematic configurations of industrial robots, case studies on different industrial manipulator working principles and applications or mini project"
        ],
        "references": [
          "John J. Craig, Introduction to Robotics: Mechanics and Control, (3e), PHI, 2005",
          "C. Peter., Robotics, Vision and Control: Fundamental Algorithms in MATLAB. Vol. 73. Springer, 2011",
          "G. Ashitava, Robotics: Fundamental Concepts and Analysis, Oxford University Press, 2006",
          "Murray, Richard M., Zexiang Li, S. Shankar Sastry, and S. ShankaraSastry, A Mathematical Introduction to Robotic Manipulation, CRC press, 1994",
          "S. Bruno and O. Khatib, EDS: Springer handbook of Robotics, Springer, 2016",
          "Mittal, R. K., and I. J. Nagrath. Robotics and control. Tata McGraw-Hill, 2003",
          "Niku, Saeed B. Introduction to robotics: analysis, control, applications. John Wiley & Sons, 2020"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2125",
        "title": "SENSORS AND TRANSDUCERS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Units and standards",
          "Calibration",
          "Static and dynamic characteristics of an instrument",
          "Error analysis",
          "Electromechanical measuring instruments",
          "Material science concepts: materials used for manufacturing sensors and transducers",
          "Analog and digital voltmeters, ammeters, LCR-Q meters, DC bridges, AC bridges",
          "Cable fault detection, shielding and grounding",
          "Introduction to sensors and transducers",
          "Types of sensors",
          "Physics behind sensors",
          "Selection and calibration of sensors",
          "Measurement of physical quantities - position, velocity, acceleration, proximity, strain, force, temperature, pressure, flow, level, humidity, light, gas sensors",
          "LiDAR, Radar sensors, oxygen sensors, breathanalyzers, heart rate sensor",
          "Sensor applications, transmitters",
          "Digital Storage Oscilloscope",
          "Data acquisition system",
          "Signal conditioning",
          "IEC, ISO, IP standards",
          "Electrical safety",
          "Engineering ethics",
          "Case study",
          "Risk assessment and mitigation"
        ],
        "references": [
          "Sawhney A.K., A Course in Electrical and Electronic Measurements and Instrumentation, (28e), Dhanpat Rai & Co., 2020",
          "Boyes W., Instrumentation Reference Book, Butterworth-Heinemann, (4e), 2009",
          "Murty D.V.S., Transducers and Instrumentation, (2e), Prentice Hall India Learning Private Limited, 2012",
          "Charles B. Fleddermann, Engineering ethics, (4e), Pearson, 2012",
          "Bela G. Liptak, Process Measurement and Analysis, (4e), CRC press, 2003"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2141",
        "title": "INDUSTRIAL ROBOTICS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab"
        ],
        "syllabus": [
          "Introduction to Robot Studio an offline Programming Tool",
          "Defining Targets and Trajectory Generation",
          "Creating a Custom Tool and Defining a Work object",
          "Conveyor Tracking using Robot Studio",
          "Manual programming using Teach pendant for IRB2600",
          "Control of Digital Inputs and Outputs through IRB2600 Robot",
          "automation applications with industrial robot IRB2600 and collaborative robot Universal Robot UR5",
          "Control of Stepper Motor and servo motor actuators using Raspberry PI",
          "PID Control of Lego Line Following Robot",
          "Robot Vision- with image processing software or Open CV",
          "Kinematic modeling of the industrial robot",
          "knowledge of Sensors and actuators for case study or mini project"
        ],
        "references": [
          "S. Bruno and O. Khatib, EDS: Springer handbook of Robotics, Springer, 2016",
          "Niku, Saeed B. Introduction to robotics: analysis, control, applications. John Wiley & Sons, 2020",
          "C. Peter., Robotics, Vision and Control: Fundamental Algorithms in MATLAB. Vol. 73, Springer, 2011",
          "Operating manual RobotStudio, ABB Robotics, 2021",
          "Sherlock Machine Vision Software User's Reference Manual, for Software versions 7.1.x and 7.2.x"
        ],
        "flags": [
          "missing_sem",
          "credits_mismatch"
        ]
      },
      {
        "code": "MTE 2142",
        "title": "INTEGRATED ELECTRONICS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Introduction to op-amp using 741IC",
          "Linear applications of Op-amp",
          "Operational amplifier and block diagram representation",
          "Characteristics of operational amplifier",
          "Analyze and design linear and non-linear applications of Op-Amp using 741 IC",
          "Design Timer circuits using 555 IC",
          "Design voltage regulator using 78xx and LM317 ICs",
          "Design combinational and sequential logic circuits using digital ICs"
        ],
        "references": [
          "Stanley William D., Operational Amplifiers with Linear Integrated Circuits, 4(e), Prentice Hall, 2004"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 4,
        "code": "MTE 2143",
        "title": "MANUFACTURING PROCESSES LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab"
        ],
        "syllabus": [
          "Introduction to machine shop, foundry and smithy shop",
          "Preparation of the models by lathe involving turning, thread cutting, knurling operations",
          "Preparation of models using milling, shaping and surface grinding machines",
          "Operation of CNC milling and turning center",
          "Preparation of arc welding models",
          "Demonstration of Wire-EDM, TIG and MIG welding process",
          "Case studies on various manufacturing processes for designing a component"
        ],
        "references": [
          "Chaudhury S. K. Hajara & Others, Elements of Workshop Technology Vol 1 & 2, (5e), Media Promoters & publishers Pvt.Ltd ., Mumbai, 2004",
          "R.K. Jain, Production Technology, (2e), Khanna Publishers, New Delhi, 2002",
          "Raghuwanshi, B.S., A course in Workshop technology, Vol 1 & II, Dhanpat Rai & Sons, New Delhi"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MAT 2231",
        "title": "ENGINEERING MATHEMATICS IV",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "The z transforms, properties of z transforms, initial and final value theorems, solution of difference equations by the method of z transforms, convolution theorem",
          "Special functions: Series solutions of ordinary differential equations, Series solutions of Bessel's and Legendre's differential equations, Recurrence relations and generating functions",
          "Orthogonal properties, Probability: Finite sample space, conditional probability and independence, Bayes' theorem, one dimensional random variable: mean and variance, Chebyshev's inequality",
          "Binomial, Poisson, uniform, normal, gamma, chi-square and exponential distributions",
          "Two and higher dimensional random variables, Covariance, correlation coefficient, regression lines, least square principles of curve fitting",
          "Moment generating function, Functions of random variables, Sampling theory, Central limit theorem and applications"
        ],
        "references": [
          "Kreyzig E-.Advanced Engineering Mathematics, (7e)., Wiley Eastern.",
          "Meyer P.L. - Introduction to Probability and Statistical applications, (2e). American Publishing Co.",
          "Ross S.M. - Introduction to Probability and Statistics for Engineers and Scientists, (2e). Wiley International.",
          "Grewal B.S - Higher Engineering Mathematics, Khanna Publishers.",
          "Hogg & Craig - Introduction of Mathematical Statistics, (7e).2013. MacMillan"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2221",
        "title": "THEORY OF MACHINES",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to mechanisms and machines: Kinematics and Dynamics",
          "Mechanisms and Machines, Plane and Space Mechanisms",
          "Mechanisms and their Inversions",
          "Kutzbach and Grubler's criterion",
          "Grashof's criterion",
          "Other mechanisms: Straight line Mechanism, Toggle mechanism, Pantograph, Hooke's joint, Ackermann and Davis steering gear, Geneva mechanism and Ratchet mechanism",
          "Analysis and synthesis of planar mechanisms: Velocity and acceleration analysis, Corioli's component of acceleration",
          "Balancing and Dynamic force analysis: Power Smoothening by Flywheels",
          "Gears and Gear trains",
          "Cams and followers",
          "Self-study: Mechanisms used in robotic applications and analysis of velocity and acceleration of various links used in industrial robots"
        ],
        "references": [
          "John J. Uicker Jr., Gordon R. Pennock, Joseph E. Shigley, Theory of Machines and Mechanisms, (5e) OUP USA, 2017",
          "Rattan. S. S, Theory of Machines, (4e), Tata Mc Graw Hill, New Delhi, 2017",
          "Bevan. T, Theory of Machines, (4e), Laxmi Publications, New Delhi, 2016",
          "Ghosh and Mallick. A. K, Theory of Machines and Mechanisms, (3e), Affiliated East West Private Limited New Delhi, 2008",
          "Ballaney P. L, Theory of Machines and Mechanisms, Khanna Publishers, New Delhi, 2005"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2222",
        "title": "DESIGN OF MACHINE ELEMENTS",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Stresses and Strains: Shear force and bending moments. Types of loads and stresses",
          "Bending and Torsional Stresses: Types of beams and supports, theory of simple bending, stress variation in beams, analysis of torsion in shafts, shear stress in shafts and stress distribution",
          "Deflection of Beams: Deflection of beams by double integration method and Macaulay's method",
          "Static and Dynamic Loading: Stress concentration, fatigue strength, stress-life (S-N) diagram",
          "Design of Transmission Shafts: Materials, permissible stresses, permissible deflection and permissible angular twist, power transmitting elements, design for static and fatigue load (bending and torsion), ASME code for shaft design",
          "Design of Helical Springs: Helical coil spring",
          "Power Screws: Types of power screws, terminology, torque for power screws, collar friction, efficiency",
          "Design of Spur Gears: Spur gears, terminology, tooth profile, pressure angle, Lewis equation for beam strength, form factor, velocity factor",
          "Selection of Bearings: Definition, objective, viscosity and types of lubrication. Construction, application, merits and demerits of journal bearing",
          "Rolling Contact Bearings: Types, capacity of bearings, bearing life, loading ratio, equivalent bearing load and bearing selection",
          "Self-study: Mechanical components used in robotic applications and design of these components used in industrial robots"
        ],
        "references": [
          "Timoshenko and Young, Elements of Strength of Materials, Tata McGraw Hill, New Delhi, 2003",
          "Popov E.P., Engineering Mechanics of Solids, Prentice Hall India, New Delhi, 2001",
          "Beer F. P. and Jonhston R, Mechanics of Materials, (3e), MacGraw Hill Book Company, 2002",
          "Shigley J. E. and Mischke C. R., Mechanical Engineering Design, (5e), McGraw Hill Inc, New York, 2004",
          "Bhandari V B., Design of Machine Elements, (2e), Tata McGraw-Hill Publishing Company Limited, Newh Delhi, 2007"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 2223",
        "title": "INDUSTRIAL AUTOMATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to industrial automation, types of automation; architecture of industrial automation",
          "Industrial revolutions, advantages and limitations of Automation, and trends in industrial automation",
          "Sensors and actuators used in industry: Sensors, Transmitters, Actuators and Signal Conditioning",
          "Measurements with Industrial Field Instruments, Data Acquisition Systems",
          "Drives and motors: Types of motors and Drives",
          "Industrial Controllers and drives: PLC, PID, DCS",
          "Industrial monitoring: HMI and SCADA",
          "Industrial Communication and networking: Device network (CAN, PROFIBUS-PA, HART)",
          "Control network (ControlNet, PROFIBUS-DP, Ethernet), Interfaces (RFID, Barcode)",
          "Safety instrument used in automation technology",
          "Overview of Industrial robots",
          "Advancement industrial automation: Industry 4.0 and Industrial IoT"
        ],
        "references": [
          "Stamatios Manesis, George Nikolakopoulos, Introduction to Industrial Automation, CRC Press, 2018",
          "Chanchal Dey, Sunit Kumar Sen, Industrial Automation Technologies, CRC Press, 2020",
          "Frank Lamb, Industrial Automation: Hands On, McGraw-Hill Professional, 2013",
          "A.K. Gupta, S.K. Arora, Jean Riescher Westcot, Industrial Automation and Robotics: An Introduction, Mercury Learning & Information, 2016",
          "Zongwei Luo, Zongwei Luo, Robotics, Automation, and Control in Industrial and Service Settings, IGI Global; Engineering Science Reference, 2015"
        ],
        "flags": [
          "missing_semester_info"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2224",
        "title": "LINEAR CONTROL THEORY",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Feedback control systems terminologies, control system design process",
          "Differential equation of physical systems, linear approximation",
          "Frequency domain representation, Time domain analysis and design",
          "First and second order system response analysis, time domain and Steady State Error (SSE), stability, RH criteria, root locus technique",
          "Introduction to compensator design, design of lag, lead, and lag-lead compensating network",
          "Frequency domain analysis - frequency response, Bode plot construction and interpretation of system behaviour, gain margin & phase margin, relation between time domain & frequency domain specification, SSE characteristics from frequency response, P, PI and PID Controllers and their tuning"
        ],
        "references": [
          "Norman S. Nise, Control Systems Engineering, (6e), Wiley India, 2010",
          "R.C Dorf, R. H. Bishop, Modern Control Systems, (12e), PEARSON, India, 2011",
          "B.C. Kuo, F. Golnaraghi, Automatic Control Systems, (10e), TMH, India, 2017",
          "K. Ogata, Modern Control Engineering, (5e), PEARSON, India, 2010",
          "M. Gopal, Control System: Principles and Practices, (4e), TMH, India, 2016"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "code": "MTE 2225",
        "title": "MICROCONTROLLER BASED SYSTEM DESIGN",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Microcomputer: Significance of Microcomputer Technology, Digital Vs Analog Computing and Types of Instruction set Computing",
          "ARM Cortex M series: Introduction to ARM Cortex A series, Cortex R series & Cortex M series. Introduction to Cortex M4: Architecture, Memory Mapping, Types of registers",
          "Instruction sets in assembly: Data Movement, Arithmetic, Logical, Memory addressing, Bitwise, Branching, and Subroutine. Calculation of delay",
          "Introduction to Embedded C: C programming Vs Embedded C, GPIO, System Timer, NVIC, Watchdog Timer, Clock Select, Timer-32, Timer-A, PWM Generation, UART Communication",
          "Case studies"
        ],
        "references": [
          "Bai, Ying. Microcontroller Engineering with MSP432: Fundamentals and Applications. Crc Press, 2016.",
          "Unsalan, Cem, H. DenizGurhan, and M. ErkinYucel. Programmable Microcontrollers: Applications on the MSP432 LaunchPad. McGraw Hill Professional, 2017.",
          "MSP432 Manual by Texas Instrumentation."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 2241",
        "title": "CAD AND KINEMATICS' SIMULATION LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab",
          "core"
        ],
        "syllabus": [
          "2D sketcher exercises of simple machine components",
          "Solid modeling and assembly exercise of machine components like 6 axis robot, CPU fan, bench vice, screw jack",
          "Kinematic analysis of simple mechanisms like slider crank mechanism, 4 bar mechanism, cam and follower mechanism"
        ],
        "references": [
          "Gopalkrishna K. R., Machine Drawing, Subhas Publications, Bangalore, 2002",
          "Bhat N.D., Machine Drawing, Charotar Publishing House, Anand, 2002",
          "Venugopal K., Engineering drawing and graphics + Auto CAD, Newage International Publishers, Delhi 2002",
          "Narayana K.L. and Kannaiah P, Text Book on Engineering drawing, Scitech Publications, Chennai 2002"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 2242",
        "title": "MICROCONTROLLER LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Introduction to Keil software",
          "Assembly programming: Familiarization of assembly instructions, Data Movement, Arithmetic, Logical instructions, Memory addressing, Bitwise, Branching instructions, and Subroutines",
          "Introduction to Embedded C programming",
          "GPIO programming",
          "hardware interfacing",
          "delay generation using SysTick Timer",
          "Timer-32",
          "PWM Generation using Timer-A",
          "serial communication using UART",
          "ARM controller based system design",
          "Self-study: Risk and safety assessment for microcontroller-based system"
        ],
        "references": [
          "Bai, Ying. Microcontroller Engineering with MSP432: Fundamentals and Applications. CRC Press, 2016.",
          "Unsalan, Cem, H. DenizGurhan, and M. ErkinYucel. Programmable Microcontrollers: Applications on the MSP432 LaunchPad. McGraw Hill Professional, 2017.",
          "MSP432 Manual by Texas Instrumentation."
        ],
        "flags": [
          "missing_sem",
          "credits_mismatch"
        ]
      },
      {
        "sem": 5,
        "code": "MTE 2243",
        "title": "SENSORS AND PLC LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Behavior of inductive, magnetic, reflection light scanner, and one way barriers, reflection light barrier OBS and an ultrasonic sensor",
          "Path power characteristic curve of inductive analog encoder, reduction factor of reflection light scanner OJ, fitted with an optical waveguide",
          "Response curve of inductive sensor, capacitive sensor, magnetic field sensors",
          "Switching frequency and switching distance and hysteresis of NBN, CJ, MB, OJ",
          "Calculation of maximum admissible velocity of an object using ultrasonic sensor",
          "Introduction of PLC, study basic components, networking and different programming technique of PLC",
          "Study NO, NC and holding circuit programs, Implement of Simple Ladder program, to study basic functions of timers, counters, math, logical and program control instructions",
          "Study different applications using ladder logic",
          "Self-study: Siemen and Allen Bradely manual",
          "https://instrumentationtools.com"
        ],
        "references": [
          "Siemens PLC manual, Siemens",
          "PLC training practice module, BOSCH REXROTH manual Germany 2011",
          "John W. Webb and Ronald A. Reiss, Programmable logic controllers- Principle and applications, (5e), PHI, 2005",
          "Sensorics training system practice module, BOSCH REXROTH manual, Germany 2011",
          "Sensors in theory and practice, BOSCH REXROTH AG Germany 2007"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "HUM 3021",
        "title": "ENGINEERING ECONOMICS AND FINANCIAL MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Time value of money, Interest factors for discrete compounding, Nominal & effective interest rates, Present and future worth of Single, Uniform, and Gradient cash flow. Related problems and case studies.",
          "Bases for comparison of alternatives, Present worth amount, Capitalized equivalent amount, Annual equivalent amount, Future worth amount, Capital recovery with return, Rate of return method, Incremental approach for economic analysis of alternatives, Replacement analysis.",
          "Break even analysis for single product and multi product firms, Break even analysis for evaluation of investment alternatives.",
          "Physical & functional depreciation, Straight line depreciation, declining and double declining balance method of depreciation, Sum-of-the-Years Digits, Sinking Fund and Service Output Methods, Case Study.",
          "Balance sheet and profit & loss statement. Meaning & Contents.",
          "Ratio analysis, financial ratios such as liquidity ratios, Leverage ratios, Turn over ratios, and profitability ratios, Drawbacks.",
          "Safety and Risk, Assessment of Risk and safety, Case study, Risk Benefit Analysis and Reducing Risk."
        ],
        "references": [
          "Chan S. Park, \"Contemporary Engineering Economics\", 4th Edition, Pearson Prentice Hall, 007.",
          "Thuesen G. J, “Engineering Economics”, Prentice Hall of India, New Delhi, 2005.",
          "Blank Leland T. and Tarquin Anthony J., “Engineering Economy”, McGraw Hill, Delhi, 2002.",
          "Prasanna Chandra, “Fundamentals of Financial Management”, Tata McGraw Hill, Delhi, 2006.",
          "Mike W. Martin and Roland Schinzinger, “Ethics in Engineering”, Tata McGraw Hill, New Delhi, 2003.",
          "Govindarajan M, Natarajan S, Senthil Kumar V. S, “Engineering Ethics”, Prentice Hall of India, New Delhi, 2004."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 3121",
        "title": "DIGITAL SIGNAL PROCESSING",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to Signal Processing",
          "operations on signals",
          "Properties of signals and systems",
          "Impulse Response and convolution",
          "Sampling",
          "Aliasing",
          "Transform domain analysis of discrete-time systems: Z Transform and application of Z transforms",
          "Discrete Fourier Transform",
          "Fast Fourier Transform",
          "Digital Filter Characteristics and structures",
          "IIR Filter Design using Butterworth approximations",
          "Bilinear transformation methods",
          "FIR Filter Design using Window method",
          "Applications of digital signal processing- speech, image, video, communication, acoustics and vibration"
        ],
        "references": [
          "Oppenheim A.V, Willsky A.S, Signals and Systems, (2e), PHI,2011.",
          "Oppenheim A.V. and R.W. Schafer, Discrete time signal processing, (2e), Prentice-Hall, 2001.",
          "Proakis J.G. and D.G. Manolakis, Digital Signal Processing: Principles, Algorithms and Applications, (3e), PHI, 2007.",
          "SanjitK.Mitra, Digital Signal Processing – A computer-based approach(4e), McGrawHill Education, 2013."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 3122",
        "title": "ELECTRIC DRIVES",
        "credits": {
          "l": 3,
          "t": 1,
          "p": 0,
          "c": 4
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Fundamentals of electric drives, basic components, advantages, closed loop control, speed, torque conventions, steady state equilibrium, and determination of motor power rating",
          "Introduction to power electronics, Power Diode, SCR, BJT, MOSFET and IGBT, Uncontrolled and controlled rectifiers, loads, freewheeling diodes",
          "Chopper's, Inverters and AC-AC converters",
          "DC motors, operating principles, torque speed characteristics, speed control concepts, Control of DC motor using choppers and controlled rectifiers",
          "AC motors, three phase induction motors, operating principles, torque speed characteristics, speed control, single phase induction motors, synchronous motors, linear induction motors, PM synchronous motors, BLDC motors, switched reluctance motors and synchronous reluctance motors",
          "Servo motors, stepper motors and universal motors"
        ],
        "references": [
          "Gopal K. Dubbey, Fundamentals of Electric Drives, (2e), Narosa Publishers, 2010",
          "Bimbra P.S., Power electronics, (3e), Khanna Publishers, 2010",
          "P. C. Sen, Principles of Electrical Machines, (3e), Wiley, 2020",
          "R. Krishnan, Electric Motor Drives Modeling, Analysis, and Control, (2e), Prentice Hall, 2012",
          "L. Umanand, Power Electronics: Essentials & Applications, Wiley 2009"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "MTE 3124",
        "title": "HYDRAULICS AND PNEUMATICS SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to pneumatic systems: Structure and signal flow, Applications of pneumatic systems, Pneumatic power pack, Air reservoir, Air generation and Distribution, different types of compressor, Constructional details and working of filter, lubricator and pressure regulator",
          "Actuators and Control valves: Single acting and double acting cylinders, Air motor and types, comparison between Air and electric motor, Various types of poppet valve, spool and rotary direction control valves, Check valves, Dual pressure valve, shuttle valves, Time delay valves, Pressure sequence valves",
          "Manual pneumatics: Traverse time diagram, Design of pneumatic circuits using classic, Cascade and Step counter approaches",
          "Electro-pneumatics components and sensors: Electrically actuated direction control valves, Relay control systems, Application circuits using electronic sensors",
          "Logic circuit design using K-V mapping",
          "Introduction to Hydraulic systems: Physical principles of oil hydraulics, Hydraulic power pack, Types of hydraulic pumps: Hydraulic actuators, valves and accessories, Pressure control valves",
          "Hydraulic circuits: Regenerative, meter in, meter out, bleed off, Sequencing, pressure reducing circuits, electrohydraulic circuits"
        ],
        "references": [
          "Anthony Esposito, Fluid power with applications, Pearson Education, 2003",
          "Andrew A. Parr, Hydraulics and Pneumatics, Elsevier Science & Technology Books, (3e), 2011",
          "Scholz D., Proportional Hydraulics, Festo Didactic GMBH & Co, Germany, 2002",
          "Majumdar S.R., Pneumatic Systems - Principles and Maintenance, Tata McGraw Hill, 2000",
          "Merkle D., Rupp K. and Scholz D., Electrohydraulics Basic Level TP 601, Festo Didactic GMBH & Co, Germany, 1994"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "MTE 3123",
        "title": "MANUFACTURING TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Over View of Manufacturing process: Types of manufacturing processes and their operating principles, tooling, quality issues in manufacturing processes",
          "Computer Numerical Controlled Machines tools: Components of CNC Machines, Construction details of CNC machines, Machine structure, Guide ways, Spindle, Measuring systems, Drives and Controls",
          "Configuration of CNC system, Interfacing, Monitoring, Diagnostics, Compensations for machine accuracy, Adaptive control CNC systems, Testing of CNC machines",
          "Advanced Manufacturing techniques: Abrasive Jet Machining, Ultrasonic Machining, Electro Chemical Machining, Laser and electron beam machining, Electro Discharge Machining",
          "Additive Manufacturing: Process Chain for Additive Manufacturing Processes, Benefits of Additive Manufacturing, Rapid Prototyping Data Formats, Non–Manifold Conditions, Liquid Based Process",
          "Application in design, engineering, analysis and planning, Application in manufacturing and tooling, automotive, biomedical industry, Application in jewellery, coin industry",
          "Self-study: Different applications based on manufacturing processes and case studies on methodologies involving various techniques for prototyping"
        ],
        "references": [
          "C.K. Chua, K.F. Leong, C.S. Lim, Rapid Prototyping: Principles and Applications, (3e), 2010",
          "Gibson, I, Rosen, D W., and Stucker, B., Additive Manufacturing Methodologies: Rapid Prototyping to Direct Digital Manufacturing, Springer, 2014",
          "Kalpakajain, Manufacturing Engineering and Technology, (4e), Addison Wesley, New York, 2014",
          "Hans B. Kief, Helmut A. Roschiwal, CNC Handbook, (1e), McGraw-Hill Education, 2012",
          "Jagadeesha T, Non-Traditional Machining Processes, I K International Publishing House Pvt. Ltd, 2016"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "ELE 3127",
        "title": "FOUNDATIONS OF EV & HYBRID VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Principles for Electric Vehicles: EV Industry, EV Technology and Automotive Revolution, Electrical Engineering for EV, Battery Technology",
          "Control system for Electric Vehicles: Motor and Controller Systems, EV Numerical Calculations, EV Charging Infrastructure, Practical session - Well-to-well analysis of EV architecture",
          "Essentials for Electric Vehicles: Electrical Requirement, Power Distribution Specifications, Electronic Control System, Practical session - EV connection and system analysis",
          "Types of components in Electric Vehicles: EV Standards and Classifications, Selection for Electrical and Electronic Components, Practical session - EV hardware components",
          "Principles for Hybrid Vehicles: Introduction to Hybrid Vehicles, Battery Chemistry, Efficiency, Definition and Parameters for Hybrid Systems, Electric Motors, Generators and Power Electronics for Hybrid Systems, Control Systems, Hybrid Electric Vehicle Operation, Practical session - Numerical study on powertrain sizing of HEV"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", Wiley, 2nd ed, 2012, ISBN: 978-1-119-94273-3",
          "Iqbal Husain, \"Electric and Hybrid Vehicles: Design Fundamentals\", Routledge, 3rd Ed, 2021, ISBN: 9780367693930",
          "Muhammad Ehsani, Mehrdad Ehsani, and Ali Emadi, \"Electric Vehicle Systems Architecture and Standardization Needs\", Reports of the PPP European Green Vehicles Initiatives, Springer, 2015",
          "Ali Emadi, \"Advanced Electric Drive Vehicles\", CRC Press, 1st Ed, 2014, ISBN: 9781138072855",
          "Rodrigo Garcia-Valle and João A. Peças Lopes, “Electric Vehicle Integration into Modern Power Networks\", Springer, 2013, ISBN: 978-1461401339",
          "Chris Mi and M. Abul Masrur, \"Hybrid electric Vehicles, Principles and Applications with Practical perspectives\", WILEY, 2nd Ed, 2017, ISBN: 978-1-118-97054-6",
          "\"Introduction to Electric Vehicles\" - offered by IIT Delhi on NPTEL Link: https://archive.nptel.ac.in/courses/108/106/108106170/"
        ],
        "flags": [
          "department_mismatch (course code prefix ELE vs department MECHATRONICS)",
          "sem_inferred_from_code"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 3141",
        "title": "DRIVES, CONTROLS AND MODELLING LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Modeling of RL and RLC circuits",
          "Power Electronics",
          "Closed loop PID control",
          "DC Motor Modelling and Control",
          "AC Induction Motor Control",
          "Industrial PLC Based PMSM motor control",
          "V/f Control of Induction Motor",
          "PWM Based DC Motor Control",
          "Advanced drives: BLDC",
          "Switched Reluctance Motor",
          "Stepper",
          "Servo and Linear Motor Drives",
          "AC Servo drives"
        ],
        "references": [
          "Drives and Control training system- Practice module, BOSCH REXROTH manual, Germany 2011",
          "Matlab Documentation, Mathworks",
          "PLC training practice module, BOSCH REXROTH manual Germany 2011",
          "John W. Webb and Ronald A. Reiss, Programmable logic controllers-Principle and applications, (5e), PHI",
          "Hackworth and Hackworth F.D, Programmable logic controllers-Programming Method and applications, Pearson, 2004"
        ],
        "flags": [
          "credits_c_discrepancy"
        ]
      },
      {
        "sem": 6,
        "code": "MTE 3142",
        "title": "ROBOT OPERATING SYSTEM LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Introduction to ROS2",
          "Installation",
          "Create ROS2 Workspace: Python and C++ Package",
          "Object-Oriented Programming",
          "ROS2 Nodes",
          "Publisher/Subscriber",
          "Custom",
          "Experiments with Turtle Sim Package",
          "Topics",
          "Services",
          "Actions",
          "Parameters",
          "Debug Tools in ROS2",
          "Introduction to URDF",
          "3 axis manipulator design",
          "Control of manipulator",
          "3 wheeled robot Design",
          "Gazebo and RViz",
          "Sensor Integration",
          "Introduction to Moveit2",
          "ROS2 Industrial Robots",
          "Working with TurtleBot and UR5 using ROS2"
        ],
        "references": [
          "Anis Koubâa, Robot Operating System (ROS), the complete reference, volume 1, Springer International Publishing, 2016",
          "Anis Koubâa, Robot Operating System (ROS), the complete reference, volume 2, Springer International Publishing, 2017",
          "Lentin Joseph, Robot Operating System for absolute beginners, Apress Media LLC, 2018",
          "Wyatt Newman, A systematic approach to learning robot programming with ROS, Chapman and Hall, 2017",
          "Joseph Howse, Prateek Joshi, Michael Beyeler, OpenCV Computer Vision projects with Python, Packt Publishing, 2016",
          "Alvaro Morena, Artificial Vision and Language Processing for Robotics, Packt Publishing, 2019",
          "https://wiki.ros.org/"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "HUM 3022",
        "title": "ESSENTIALS OF MANAGEMENT",
        "credits": {
          "l": 2,
          "t": 1,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory",
          "core"
        ],
        "syllabus": [
          "Definition of management and systems approach, Nature & scope",
          "The Functions of managers, Principles of Management",
          "Planning: Types of plans, steps in planning, Process of MBO, how to set objectives, strategies, policies and planning premises, Strategic planning process and tools",
          "Nature and purpose of organizing, Span of management, factors determining the span, Basic departmentation, Line and staff concepts, Functional authority, Art of delegation, Decentralization of authority",
          "HR theories of planning, Recruitment, Development and training",
          "Theories of motivation, Special motivational techniques",
          "Leadership – leadership behavior & styles, Managerial grid",
          "Basic Control Process, Critical Control Points & Standards, Budgets, Non-budgetary control devices, Profit and Loss control, Control through ROI, Direct, Preventive control",
          "PROFESSIONAL ETHICS - Senses of Engineering Ethics, Variety of moral issues, Types of inquiry, Moral dilemmas, Moral Autonomy, Kohlberg's theory, Gilligan's theory, Consensus and Controversy, Models of professional roles, Theories about right action, Self-interest, Customs and Religion, Uses of Ethical Theories",
          "GLOBAL ISSUES - Managerial practices in Japan and USA & application of Theory Z, The nature and purpose of international business & multinational corporations, unified global theory of management, Entrepreneurship and writing business plans, Multinational Corporations, Environmental Ethics, Computer Ethics, Weapons Development, Engineers as Managers, Consulting Engineers, Engineers as Expert Witnesses and Advisers, Moral Leadership, Code of Conduct, Corporate Social Responsibility"
        ],
        "references": [
          "Harold Koontz & Heinz Weihrich (2020), “Essentials of Management”, McGraw Hill, New Delhi.",
          "Peter Drucker (2004), “The practice of management”, Harper and Row, New York.",
          "Vasant Desai (2007), “Dynamics of entrepreneurial development & management”, Himalaya Publishing House.",
          "Poornima M Charantimath (2006), “Entrepreneurship Development”, Pearson Education.",
          "Mike W. Martin & Ronald Schinzinger (2003), “Ethics in engineering”, Tata McGraw Hill, New Delhi.",
          "Govindarajan M, Natarajan S, & Senthil Kumar V S (2004), “Engineering Ethics”, Prentice Hall of India, New Delhi.",
          "R. S. Nagarazan. (2004), “A text book on professional ethics and human values”, New age international publishers, New Delhi."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 3221",
        "title": "ENERGY AND HEAT TRANSFER",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Properties of pure substances and ideal gases",
          "First and second laws of thermodynamics",
          "Energy conversion by cycles",
          "Power-absorbing and power producing cycles",
          "Fluids and Their Properties",
          "Fluid Pressure and Its Measurement",
          "Hydrostatics",
          "Buoyancy and Floatation",
          "Kinematics of Fluid Flow",
          "Venturiemeter and Pitot Tube",
          "Small and Large Orifices",
          "Applications of the Momentum equation",
          "Flow Through pipes",
          "Heat Transfer: Introduction to heat transfer",
          "General Law of Heat Conduction",
          "Steady state one dimensional heat conduction with and without heat generation",
          "Heat Transfer from Extended Surfaces",
          "Heat Transfer by Forced convection and Free convection",
          "Radiation",
          "Heat Exchangers",
          "Cooling of Electronic equipment",
          "Risk mitigation, and safety for Vapor compression cycle and heat exchangers for refrigeration and thermal power plants and industry"
        ],
        "references": [
          "Cengel Y Al and Boles M A, Thermodynamics, An Engineering Approach, Tata Mc Graw Hill, 2003",
          "Michael J Moran, Fundamentals of Engineering Thermodynamics, Wiley India Pvt. Ltd., 2010",
          "Munson B R, Young D F and Okiishi T H, Fundamentals of Fluid Mechanics, John Wiley & Sons., Singapore, 2006",
          "Kumar D. S, Fluid Mechanics and Fluid Power Engineering, Kataria S K and Sons, New Delhi, 2010",
          "Yunus A. Cengel, Heat Transfer: A Practical Approach, Tata McGraw Hill Inc., New Delhi, 2005"
        ],
        "flags": []
      },
      {
        "sem": 3,
        "code": "ELE 3225",
        "title": "AUTOMOTIVE MECHANICS FOR ELECTRIC VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Vehicle Dynamics Fundamentals",
          "Tire Mechanics and Dynamics",
          "Suspension Systems",
          "Braking Systems",
          "Aerodynamics",
          "Powertrain Systems",
          "Vehicle Stability Control",
          "Vehicle Safety",
          "Vehicle Dynamics Simulation",
          "Electric and Hybrid Vehicle Dynamics",
          "Practical session - EV Dynamics & calculations",
          "Introduction to Automotive Sketching Software",
          "Overview of Vehicle Design Process and Automotive Sketching",
          "Basic Sketching Techniques and Tools in the Software",
          "Sketching Car Exteriors, Interiors and Details",
          "Creating Different Views and Angles of the Vehicle",
          "Rendering and Presenting the Final Sketches",
          "Understanding Proportions, Perspectives and Shapes in Automotive Sketching",
          "Creating Sketches for Different Vehicle Types (Sedans, SUVs, and Trucks)",
          "Tips and Tricks for Automotive Sketching in the Software",
          "Introduction to EV Technology and Its Benefits",
          "Basic Vehicle Design Principles",
          "Design and Modelling of Chassis and Frame",
          "Suspension Systems",
          "Design and Modelling of Braking and Steering Systems",
          "Design and Modelling of Electrical Components for EVs",
          "Battery Pack Design and Modelling for 2, 3 and 4 Wheelers",
          "Motor and Drivetrain Design and Modelling for 2, 3 and 4 Wheelers",
          "Design and Modelling of Wheels and Tires for 2, 3 and 4 Wheelers",
          "Testing and Simulation of Vehicle Performance Using Solid Works",
          "Design for Manufacturability and Assembly Considerations",
          "Sustainability and Environmental Impact Considerations in EV Design",
          "Practical session - EV hardware components walkthrough",
          "Introduction to MSC Adams Software and Its Capabilities",
          "Setting Up the Modelling Environment in MSC Adams",
          "Multi-body Dynamics Principles and Application to Vehicle Systems Modelling",
          "Vehicle Suspension Systems Modelling",
          "Vehicle Steering Systems Modelling",
          "Vehicle Braking Systems Modelling",
          "Practical session - EV Component design & modeling",
          "Tire Force and Characteristics Modelling",
          "Vehicle Dynamics Analysis Including Simulating Ride and Handling",
          "Vehicle Stability and Rollover Events",
          "Optimisation Techniques for Vehicle Designs Using MSC Adams",
          "Integration of MSC Adams Models with Other Software Tools for System-level Simulations and Analysis",
          "Practical session - EV body design analysis"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", Wiley, 2nd ed, 2012, ISBN: 978-1-119-94273-3",
          "Du, H., Cao, D., & Zhang, H. (n.d.). “Modelling, Dynamics, and Control of Electrified Vehicles”, Woodhead Publishing, 2017, ISBN-13: 9780128127865",
          "Zaman N., “Automotive Electronics Design Fundamentals”, Springer",
          "Gianfranco Pistoia, “Electric & Hybrid Vehicles”, Elsevier, 1st ed, 2010, ISBN: 9780444638250",
          "Chau, K. T., “Electric Vehicle Machines and Drives: Design, Analysis and Application”, John Wiley and Sons, Inc., 2015, ISBN-13: 9781118752524",
          "Ehsani, Mehrdad, “Modern Electric, Hybrid Electric, and Fuel Cell Vehicles”, CRC, 2019, ISBN-13: 9780367137465",
          "Hughes, Austin, “Electric Motors and Drives”, Newnes (an Imprint of Butterworth-Heinemann Ltd), 2019, ISBN-13: 9780081026151",
          "Chris Ni and M. Abul Masrur, “Hybrid electric Vehicles, Principles and Applications”, WILEY, 2nd Ed, 2017, ISBN: 978-1-118-97054-6",
          "\"Introduction to Electric Vehicles\" - offered by IIT Delhi on NPTEL Link: https://archive.nptel.ac.in/courses/108/106/108106170/"
        ],
        "flags": [
          "department_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "MTE 3222",
        "title": "AUTOMOBILE ENGINEERING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "vehicle construction and layouts",
          "chassis, frame and body",
          "Vehicle power supply systems",
          "Transmission systems, clutch types & construction, gear boxes- Hydrodynamic Clutches, Torque Converter",
          "Heating and air conditioning systems",
          "Steering geometry and types of steering gear box, power steering",
          "types of front axle",
          "types of suspension systems",
          "pneumatic and hydraulic braking systems",
          "Desirable tyre properties",
          "conventional tubed & tubeless tyre",
          "Noise vibration and harshness in automobiles",
          "Fundamentals of regenerative braking",
          "Bearing and lubrication systems",
          "environmental management and service information systems",
          "Electrical and lighting systems",
          "Industrial Fabric",
          "ergonomics and safety standards in automotive industry"
        ],
        "references": [
          "Jack Erjavec, Rob Thompson, Automotive Technology - A Systems Approach, Cengage (7 e), 2018.",
          "Richard Stone, Jeffrey K. Ball, Automotive Engineering Fundamentals, SAE International (1e), 2004.",
          "Trelle Borg, Automotive Vibration Control Technology: Fundamentals, Materials, Construction, Simulation, and Applications (1e), Vogel Business Media GmbH & Co. KG, 2015.",
          "Kripal Singh, Automobile Engineering (4e), Vol-1 and 2, Standard Publishers, Delhi, 2011.",
          "Robert Fischer, FeritKüçükay, Gunter Jürgens, Rolf Najork, BurkhardPollak, Automotive transmission book (4e), Springer International Publishing Switzerland 2015."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 3241",
        "title": "HYDRAULICS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab",
          "core"
        ],
        "syllabus": [
          "Working principles of hydraulic pumps, hydraulic motors, pressure switch, pressure reducing valve, accumulator, proximity switch, throttle valves, pressure compensated flow control valves and direction control valves",
          "Rigging of manual and electro hydraulic circuits using above components",
          "Working principle of Proportional direction control valve",
          "Proportional pressure relief valve",
          "Command value module",
          "Proximity switches",
          "Rigging of proportional hydraulic circuits using above components"
        ],
        "references": [
          "Industrial Hydraulics Trainee's manual, BOSCH REXROTH manual, Germany 2011",
          "Proportional valve technology Trainee's Manual BOSCH REXROTH manual, Germany 2014"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 3,
        "code": "MTE 3242",
        "title": "IIOT LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab"
        ],
        "syllabus": [
          "Computer Networking fundamentals",
          "Simulation of network devices viz., hub, switch and router using Cisco packet Tracer",
          "Simulation of IIoT environment using Cisco Packet tracer",
          "Operation of MSP432 microcontroller from TI",
          "Interfacing of communication booster packs for Wi-Fi and Radio communication",
          "Sensor data logger using STM32 microcontroller"
        ],
        "references": [
          "MSP432 Manual by Texas Instrumentation",
          "STM32 Manual by STMicroelectronics"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": 7,
        "code": "MTE 3243",
        "title": "PNEUMATICS LAB",
        "credits": {
          "l": 0,
          "t": 0,
          "p": 3,
          "c": 1
        },
        "tags": [
          "lab"
        ],
        "syllabus": [
          "Operations of various valves like directional control valves, flow control valves, pressure control valves and switches like pressure switches, proximity switches",
          "Operations of timers and counters",
          "Rigging of manual pneumatic and electro-pneumatic circuits using above valves and switches",
          "Closed loop Pneumatics: Constant pressure control, Force control, Basics of PID control",
          "Electro-pneumatic control with spring",
          "Properties of electro-pneumatic control with spring",
          "Working of PID controller and its application in closed loop pneumatic circuits"
        ],
        "references": [
          "Practice for Professional Pneumatics Trainee's manual, BOSCH REXROTH manual, Germany 2011",
          "Practice for Professional Electro-Pneumatics Trainee's manual, BOSCH REXROTH manual, Germany 2011",
          "Training system for pneumatics, Bosch Rexroth manual, Germany 2014"
        ],
        "flags": [
          "credits_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4291",
        "title": "INDUSTRIAL TRAINING",
        "credits": null,
        "tags": [
          "core"
        ],
        "syllabus": [
          "Industrial training for a minimum period of 4 weeks",
          "Phased manner during vacation starting from the end of third semester",
          "Submission of training report in prescribed format",
          "Presentation of the training report",
          "Inclusion of certificates issued by the industry"
        ],
        "references": [],
        "flags": [
          "missing_semester",
          "missing_credits",
          "missing_references"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4292",
        "title": "PROJECT WORK/PRACTICE SCHOOL",
        "credits": {
          "l": null,
          "t": null,
          "p": null,
          "c": null
        },
        "tags": [
          "core",
          "lab"
        ],
        "syllabus": [
          "Project work carried out in institution/industry/research laboratory or other competent institutions",
          "Minimum duration of 16 weeks (extendable up to 24 weeks)",
          "Mid-semester evaluation after about 8 weeks",
          "Submission of interim project report during mid-semester evaluation",
          "Final evaluation and viva-voice after submission of final project report",
          "Student presentation before department committee as part of project evaluation"
        ],
        "references": [],
        "flags": [
          "missing_semester",
          "missing_credits",
          "missing_references"
        ]
      },
      {
        "sem": null,
        "code": "ELE 4415",
        "title": "EV BATTERY TECHNOLOGY AND POWERTRAIN DEVELOPMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory",
          "lab"
        ],
        "syllabus": [
          "Basics of Batteries",
          "Battery Parameters",
          "Lithium-Ion Characteristics",
          "Thermal Runaway Battery Management System (BMS)",
          "Functionality",
          "Practical session - Battery Selection and Connection Process with Vehicle Sensors",
          "SOC/SOH Estimation",
          "Cell Balancing",
          "Protection",
          "Thermal Management",
          "CAN Communication",
          "Practical session - BMS development",
          "Overview of Battery & BMS System",
          "Electrical Design",
          "Mechanical Design: Calculations",
          "Mechanical Design using ANSYS",
          "Heat Transfer",
          "Thermal Design of Battery Pack",
          "Battery Pack Assembly and Test",
          "Thermal Analysis on Battery Pack",
          "MATLAB/Simulink-based Battery Pack Modelling",
          "Practical session - Battery life cycle testing",
          "Introduction to EV Powertrain",
          "Overview",
          "Architecture and Components of EV Powertrain",
          "Thermal Management of EV Powertrain",
          "EV Charging Systems and Types of Chargers",
          "Modelling and Simulation of EV Powertrain Components in MATLAB",
          "Modelling and Analysis of EV Powertrain Components in SolidWorks",
          "Analysis of EV Powertrain Components in ANSYS",
          "Case Study on Powertrain of Existing Models"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", 2nd Edition, Wiley-Blackwell, 2012.",
          "Sandeep Dhameja, “Electric Vehicle Battery Systems\", Newnes Publisher, 1st Edition, 2001.",
          "Christopher D. Rahn, “Battery Systems Engineering\" 1st edition, Wiley, 2013.",
          "Bruno Scrosati , K. M. Abraham , Walter A. van Schalkwijk , Jusef Hassoun, “Lithium-Ion Batteries: Advanced Materials, Technologies, and Applications\" 2nd Edition, Wiley-Blackwell, 2013.",
          "Emma Briec, Beate Müller, “Electric Vehicle Batteries: Moving from Research towards Innovation\" 1st Edition, Springer International Publishing AG, 2016."
        ],
        "flags": [
          "missing_sem",
          "department_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "AEE 4420",
        "title": "EV PRODUCT DEVELOPMENT, HOMOLOGATION & HYDROGEN FCEV",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Introduction to EV (2W, 3W & 4W) Market and Opportunities",
          "Electric Vehicle Design Procedure and ICE Model",
          "Introduction to EV Management (Categories, Regulations and Standards)",
          "EV Homologation and Testing",
          "FAME India and Manufacturing Guidelines",
          "EV Certification Process",
          "EV Charging",
          "Electric Vehicles and Retrofitting",
          "Motor Technology and EV Motor Market Analysis",
          "EV Categories and Proposed Changes",
          "EV Retrofitting Business",
          "Battery Technology in EV",
          "EV Battery Market Analysis",
          "Practical session - Conducting a market analysis of the EV industry",
          "Introduction to Product Development Plan",
          "Segment Selection",
          "Product Design Plan",
          "Product Validation Plan",
          "Vehicle Dynamics Selection",
          "Product Design Validation",
          "Product Specification - Competitor Analysis",
          "Selection of Off-the-Shelf Parts",
          "Development Methods",
          "Product Development Plan",
          "Unit Economics",
          "Design Feasibility",
          "Design for Manufacturing",
          "DFMEA and PFMEA",
          "Business Plan",
          "Product Launch",
          "POC/MVP/Working Prototype",
          "Practical session – Using the market research to develop a business plan for an EV manufacturer",
          "Introduction to Future Mobility",
          "Why Hydrogen-based Technology",
          "Essentials of Hydrogen",
          "How Does Hydrogen Compare to Hydrocarbon Fuels in Terms of Energy, Flammability and Safety",
          "Hydrogen Fuel Cells",
          "Use of Hydrogen in IC Engines",
          "Hydrogen Fuel Cell Techniques and Systems",
          "Fuel Cell Engine Safety and Maintenance",
          "Fuel Cell Hybrid Electric Vehicle Acts, Codes, Regulations and Guidelines",
          "Maintenance and Fuelling Facility Requirements",
          "Fuel Cells in Hybrid Electric Vehicles and Pure Electric Vehicles",
          "Auxiliary Power Generation Using Hydrogen",
          "Types of Fuel Cells and Techniques Used",
          "Fuel Stack Module Construction",
          "Fuel Cell Performance, Characteristics",
          "Polarisation",
          "Stoichiometry Effects",
          "Temperature and Pressure Effects",
          "Practical session – Study on Hydrogen fuel cell with MATLAB/SIMULINK"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", 2nd Edition, Wiley-Blackwell, 2012",
          "Tom Denton, “Electric and Hybrid Vehicles” 2nd Edition, CBS Publisher, 1905",
          "Chris Mi, M. Abul Masrur & David Wenzhong Gao, “Hybrid Electric Vehicles: Principles and Applications with Practical Perspectives” 2nd Edition, Wiley Publications, 2017"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "ELE 4417",
        "title": "EV VEHICLE DESIGN & ANALYSIS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to Basic Electronics",
          "Diode Fundamentals",
          "Rectifiers and Filters",
          "Power Electronics for EVs: Voltage Regulators, Inverters and Converters",
          "Special Purpose Diodes",
          "Transistors and Types of Transistors",
          "Operational Amplifier (Op-Amp)",
          "Digital Electronics",
          "EV Control Systems",
          "EV Communication Networks",
          "Microcontrollers and Microprocessors",
          "Introduction to Proteus Software",
          "Circuit Development Using Proteus",
          "Overview and Environment",
          "Basic Syntax",
          "Variables and Commands",
          "Commands",
          "M-files, and Types",
          "Operators",
          "Decision Making and Loops",
          "Vectors",
          "Matrix, and Arrays",
          "Colon Notation and Numbers",
          "Strings and Functions",
          "Numbers",
          "Plotting and Graphics",
          "Algebra",
          "Calculus",
          "Differential, and Integration",
          "Polynomials and Transforms",
          "Programming EV Systems in MATLAB Simulink and Fitting",
          "Developing SIMULINK Models for Vehicle Units",
          "Advisor and QSS Toolbox",
          "QSS-based Vehicle Control",
          "Practical session - Analyze and troubleshoot electronic circuits using simulation tools and lab equipment",
          "Motor Development and Induction Motor Characteristics",
          "Simulink Model to Calculate Vehicle Configuration",
          "Multi-level Inverter Design and Simulation",
          "Solar PV-based Charger Development",
          "Dc-DC Converter",
          "Modelling of Li-ion Battery Pack",
          "Design of EV Using QSS Toolbox",
          "Battery Thermal Modelling",
          "BMS Modelling",
          "Electric 4W Powertrain Modelling",
          "Practical session- Data analysis and visualization using MATLAB for vehicle system",
          "Power Required to Overcome Resistance Forces Acting on the Vehicle",
          "Power Converters in Electric Vehicles",
          "Inverters in Electric Vehicles",
          "Motor and Motor Controllers",
          "Modelling of EV Battery and BMS",
          "Practical session - Modeling and simulation of EV powertrain components, such as motors, controllers, and inverters, using MATLAB/Simulink"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", 2nd Edition, Wiley-Blackwell, 2012",
          "Iqbal Husain, “Electric and Hybrid Vehicles: Design Fundamentals” 2nd Edition, CRC Press, 2010",
          "Ali Emadi, “Advanced Electric Drive Vehicles”, 1st Edition, CRC Press, 2014",
          "Sandeep Dhameja, “Electric Vehicle Battery Systems\", Newnes Publisher, 1st Edition, 2001",
          "Haitham Abu-Rub, Mariusz Malinowski, Kamal Al-Haddad, “Power Electronics for Renewable Energy Systems, Transportation and Industrial Applications” 1st Edition, Wiley-IEEE Press, 2014",
          "J Larminie “Electric Vehicle Technology” 2nd Edition, Wiley-Blackwell, 2012"
        ],
        "flags": [
          "missing_sem",
          "code_department_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "AAE 4421",
        "title": "EV FEA ANALYSIS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Theory of FEA/CAE",
          "Introduction to HyperMesh",
          "Creating and Modifying Geometry",
          "Geometry Clean-up and Defeature",
          "Introduction to 2D Meshing",
          "Introduction to 3D Meshing",
          "Element Quality",
          "Mesh Edit",
          "Introduction to Plastic Meshing",
          "Introduction to 1D Meshing",
          "Modal Analysis",
          "Linear Static Analysis",
          "Buckling Analysis",
          "Connectors",
          "Practical session-Optimization techniques using HyperMesh",
          "Introduction to Abaqus Software",
          "Fundamentals of FEA-Stress",
          "About Abaqus Software-Features",
          "Applications of Abaqus Software in Different Industries",
          "Simple Modelling in Abaqus Software",
          "Create Material and Create Assembly",
          "Create Steps, Loads,, Boundary Conditions",
          "Generate Mesh",
          "Result Visualization",
          "Practical session - Multiphysics analysis using Abaqus",
          "One Dimensional Analysis",
          "Linear Static Analysis and Linear Buckling Analysis",
          "Heat Transfer Analysis",
          "Non-linear Analysis",
          "Dynamic Simulation-Modal Analysis",
          "Impact Analysis",
          "Time-Dependent Load Analysis",
          "Basics of Finite-Element Analysis (FEA) along with ANSYS Tool and Software Interface",
          "Essential Mechanical and Electrical Properties of Materials",
          "Various Case Studies on ANSYS Mechanical",
          "Basics of Computational Fluid Dynamics (CFD)",
          "Various Case Studies on ANSYS Fluent",
          "Practical session - FEA analysis using ANSYS",
          "Simulation of Battery Thermal Management in Electric Vehicle",
          "Vibration and Fatigue Analysis of Battery Pack",
          "Simulation of Structural Integrity for Motor Mount",
          "Thermal Analysis of Liquid-Cooled Radiator",
          "CFD Study of External Cooling Mechanism for Battery Pack",
          "Practical session - Vulnerability analysis"
        ],
        "references": [
          "James Larminie and John Lowry, “Electric Vehicle Technology Explained\", 2nd Edition,Wiley-Blackwell, 2012.",
          "ErikSchaltz, “Electrical Vehicle Design and Modeling” 1st Edition, InTech Publisher, 2011.",
          "J Larminie, “Electric Vehicle Technology”, 2nd EditionWiley-Blackwell, 2012.",
          "Jeff Strain, Ted Harris, Eric Miller, “Introduction to the ANSYS Parametric Design Language (APDL)\", 2nd Edition PADT, Inc., 2019.",
          "Abaqus Analysis User's Guide by Dassault Systems Publisher: Dassault Systems ISBN: N/A (Available as part of the Abaqus documentation).",
          "Patrick J. Roache, “Fundamentals of Computational Fluid Dynamics”Hermosa Pub., Revised Edition, Roache Publisher, Revised Edition, 2003."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MTE 4076",
        "title": "HEAVY VEHICLE TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Fundamentals of Heavy Vehicle Technology",
          "Trends and challenges in heavy vehicle engineering",
          "Vehicle Propulsion Systems",
          "Powertrain",
          "Engine Management",
          "Layout",
          "Components of engine systems",
          "Power Management",
          "Power Components",
          "Vehicle Transmission Systems",
          "Gearboxes",
          "Clutch Units",
          "Retarders",
          "Axles",
          "Propeller shafts",
          "Vehicle Braking System",
          "Pneumatics brakes",
          "Hydraulics brakes",
          "Braking circuits",
          "Service Braking vs Auxiliary Braking",
          "Environmental Impact",
          "Vehicle Axles & Steering system",
          "Vehicle Suspension & Chassis",
          "Vehicle Cabin Overview",
          "Regulation",
          "Crash Safety",
          "Vehicle transport management",
          "Heavy Vehicle Electrical and Electronics",
          "Vehicle Auxiliary Equipment & Functions",
          "Fuel cell technology for Heavy Vehicles",
          "Diagnostic Fault Tracing",
          "Troubleshooting common issues in heavy vehicles",
          "Case studies"
        ],
        "references": [
          "Light and Heavy Vehicle Technology, M.J. Nunney, Elsevier, Fourth Edition 2006",
          "Automotive Technology, Jack Erjavec, Cengage Learning, Fifth Edition, 2009",
          "Motor Automotive technology, Anthony E. Schwaller, Delmar, Third Edition, 1998",
          "Automotive suspension and steering systems, Thomas W. Birch, Delmar Cengage Learning, Third Edition, 1998"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MTE 4401",
        "title": "AUTOTRONICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Fundamentals of automotive electronics",
          "Components for electronic engine management",
          "Sensors & actuators",
          "Digital engine control system",
          "Fuel control maps",
          "SI engine management - injection system controls layout and working of monojetronic, l-jetronic and lh-jetronic",
          "Three way catalytic converter",
          "CI engine management- fuel injection system",
          "Parameters affecting combustion",
          "Noise and emissions in CI engines",
          "Vehicle motion control and stabilization systems",
          "Vehicle motion control - adaptive cruise control",
          "Electronic transmission control",
          "Vehicle stabilization system - antilock braking system",
          "Traction control system",
          "Electronic stability program",
          "Onboard diagnosis system",
          "Future automotive electronic systems"
        ],
        "references": [
          "Young, Griffitns, Automobile electrical & electronic equipments, Butterworths, London, 2010.",
          "Wiliam B. Ribbens, Understanding automotive electronics, (5e), Newnes, Butterworth– Heinemann, 2009.",
          "Robert Bosch, Diesel engine management, (3e), SAE Publications, 2004.",
          "Robert Bosch, Gasoline engine management, (2e), SAE Publications, 2004.",
          "Robert Bosch GmbH, Automotive electrics and automotive electronics, John Wiley and Sons 2008."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4402",
        "title": "HYBRID AND ELECTRIC VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "History of Hybrid and Electric Vehicles technology, Economics and Environmental aspects of vehicle technologies",
          "Vehicle dynamics- vehicle resistance, dynamic equation, tire ground adhesion, maximum tractive effort, vehicle speed, transmission characteristics, vehicle performance",
          "Hybrid and electric drive trains-configurations of electric vehicles, traction motor characteristics, basic concept of hybrid traction, hybrid drive train architecture – series, parallel torque and speed coupling",
          "Electric propulsion unit: different motors, configuration and control of dc and induction motor drives, introduction to power modulators, control, advanced motor drives for EV: PMSM, BLDC, SRM and SyncRel Motor drives",
          "Energy storage, regenerative breaking, classification of different energy management strategies, fundamentals of regenerative braking",
          "Sizing the drive system- propulsion motor, sizing the power electronics, selecting the energy storage technology, communications, supporting subsystems",
          "Hybridness, PHEV, Range extension vehicles, Control of Hybrid and Electric vehicles: ECU, CAN-bus, Vehicle Dynamics Control. Charging stations. Design of series hybrid drive train"
        ],
        "references": [
          "MehrdadEhsani, Modern Electric, Hybrid Electric and Fuel Cell Vehicles- Fundamentals, Theory and Design, (3e), CRC Press, 2018",
          "Iqbal Hussein, Electric and Hybrid Vehicles-Design Fundamentals, (2e), CRC Press, 2010",
          "Gianfranco Pistoia, Electric and Hybrid Vehicles - Power Sources, Models, Sustainability, (2e), CRC Press, 2010"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4403",
        "title": "VEHICLE DYNAMICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to Vehicle System Dynamics: Theoretical background on Vehicle Dynamics and control, Fundamental approach to Vehicle modelling",
          "Longitudinal dynamics: Vehicle Load Distribution – Acceleration, Brake Force Distribution, Braking Efficiency and Braking Distance, Braking, Semi-Trailer",
          "Tire Mechanics: Introduction, Mechanical Properties of Rubber, Slip, Grip and Rolling Resistance, Tire Construction and Force Development, Contact Patch and Contact Pressure Distribution, Tire Brush Model, Lateral Force Generation – Ply Steer and Conicity, Tire Models – Magic Formula, Classification of Tyre Models, and Combined Slip",
          "Lateral Dynamics: Introduction, Bicycle Model, Stability, and Steering Conditions, Effect of road loads on Dynamics of Vehicle – Aerodynamics, rolling resistance, Total road load, Under-steer Gradient and State Space Approach, Parameters affecting vehicle handling characteristics, Subjective and Objective Evaluation of Vehicle Handling and Rollover Prevention",
          "Vertical Dynamics: Introduction, Quarter Car Model, Half Car Model",
          "Introduction to Automotive Safety: Basic concepts, risk evaluation, basic models, accident avoidance, occupant injury prevention, human simulation applications, crash testing, special design models, future vehicle safety",
          "Self-study: Industrial standard related to automotive safety",
          "Advancement in human comfort and safety in automobile"
        ],
        "references": [
          "Thomas D. Gillespie, Fundamentals of Vehicle Dynamics, SAE International 1997",
          "Reza N. Jazar, Vehicle dynamics: theory and application. Springer, 2017",
          "Hans B. Pacejka, Tire and Vehicle Dynamics, Elsevier, 2012",
          "George Peters, Barbara Peters, Automotive Vehicle Safety, CRC Press, 2002",
          "J Y Wong, Theory of Ground Vehicles, John Wiley & Sons Inc., 2001"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4404",
        "title": "MODELLING OF HYBRID AND ELECTRIC VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Vehicle Propulsion and Powertrain Technologies",
          "Objectives of vehicle propulsion control",
          "Powertrain architecture and technologies",
          "Importance of Powertrain Modelling and Models – Drivetrain",
          "Motor design, modelling and simulation of drives for Electric Propulsion",
          "Vehicle dynamics control",
          "Modelling and Control of Battery Management Systems",
          "Braking",
          "Design and Control of Hybrid Electric Vehicles",
          "Modelling and control of Fuel cell based EV"
        ],
        "references": [
          "Shuvra Das, Modeling for Hybrid and Electric Vehicles Using Simscape, Morgan & Claypool Publishers, 2021",
          "Tom Denton, Electric and Hybrid Vehicles, Taylor and Francis, 2020",
          "Mehrdad Ehsani, Modern Electric, Hybrid Electric and Fuel Cell Vehicles- Fundamentals, Theory and Design, (3e), CRC Press, 2018",
          "Gianfranco Pistoia, Behaviour of Lithium ion batteries in Electric Vehicles: Battery Health, Performance, Safety, Cost, (1e), Springer, 2018",
          "Amir Khajepour, Saber Fallah and Avesta Goodarzi, Electric And Hybrid Vehicles Technologies, Modeling And Control: A Mechatronic Approach, Wiley 2014"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4405",
        "title": "DATABASE MANAGEMENT SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Database-System Applications",
          "Relational Databases",
          "Data Storage and Querying",
          "Transaction Management",
          "Database Architecture",
          "Database Users and Administrators",
          "Structure of Relational Databases",
          "Database Schemas",
          "Keys",
          "Relational Query Languages",
          "Relational Operations",
          "SQL Data Definition",
          "SQL Data Types and Schemas",
          "Integrity Constraints",
          "Basic Structure of SQL Queries",
          "Set Operations",
          "Aggregate Functions",
          "Nested Subqueries",
          "Additional Basic Operations",
          "Null Values",
          "Atomic Domains and First Normal Form",
          "Decomposition Using Functional Dependencies",
          "Functional Dependency Theory",
          "Algorithms for Decomposition",
          "Decomposition Using Multivalued Dependencies",
          "Transaction Concept",
          "Introduction to Data Mining",
          "Association rules mining",
          "Market based analysis",
          "Apriori Algorithm",
          "Partition Algorithm",
          "Pincer –Search Algorithm",
          "Dynamic item set counting algorithm",
          "FP-tree growth Algorithm",
          "PC Tree",
          "Multilevel association rules",
          "Clustering Techniques",
          "Clustering paradigms",
          "Partitioning Algorithms",
          "k – Medoid & k- means Algorithms",
          "CLARA",
          "CLARANS",
          "Hierarchical Clustering",
          "DBSCAN"
        ],
        "references": [
          "Silberschatz, Korth, Sudarshan, Database System Concepts, (7e), McGrawHill, New York, 2019.",
          "Ramez Elmasri and Shamkant Navathe, Durvasula V L N Somayajulu, Shyam K Gupta, Fundamentals of Database Systems, (6e), Pearson Education, United States of America,2011.",
          "Thomas Connolly, Carolyn Begg, Database Systems – A Practical Approach to Design, Implementation and Management, (4e), Pearson Education, England, 2005.",
          "Peter Rob, Carlos Coronel, Database Systems–Design, Implementation and Management, (10e), Course Technology, Boston , 2013.",
          "Jiawei Han and Micheline Kamber, Data Mining Concepts and Techniques, Morgan Kauffmann Publishers, (2e), 2008."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4406",
        "title": "CYBER SECURITY FOR INDUSTRIAL AUTOMATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Security",
          "Characteristics of Information",
          "Components of an Information system",
          "Systems Development Life Cycle",
          "Security Systems Development Life Cycle",
          "The Need for Security-Business Needs First",
          "Threats",
          "Attacks",
          "Intruders",
          "Intrusion Detection",
          "Malicious Software – Types, Viruses, Viruses Countermeasures, Worms",
          "Introduction to Database security",
          "SQL Injection, Reliability and Integrity",
          "Sensitive Data",
          "Inference",
          "Multilevel Databases",
          "Proposals for Multilevel Security",
          "Designs of Multilevel Secure Databases",
          "Transport-level Security – Web Security Issues, SSL, TLS, PGP, S/MIME",
          "IP Security – IP Security Policy, Encapsulating Security Payload, Internet Key Exchange",
          "The Need for Firewalls",
          "Firewall Characteristics",
          "Types of Firewalls",
          "Cyber Crimes and Hackers – Cyber Crimes, Hackers, Types of Attacks, Dealing with the Rising Tide of Cyber Crimes, Indian Cyber Law Offences, IEC 62243 Compliance"
        ],
        "references": [
          "William Stallings, Cryptography and Network Security: Principles and Practice, (7e), Pearson, 2017",
          "Michael E. Whitman and Herber J. Mattord, Principles of Information Security, (6e), Centage Learning India Publication, 2017",
          "Charles P Pfleeger and Shari Lawrence Pfleeger, Security in Computing, (5e), PHI, 2015",
          "Joseph Migga Kizza, A Guide to Computer Network Security, (3e), Springer International Edition, 2015",
          "Global Cyber Security Alliance, Quick Start Guide: An Overview of ISA/IEC 62443 standards; Security of Industrial Automation and Control Systems. ISA. 2022"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4407",
        "title": "INTERNETWORKING FOR INDUSTRIES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Computer Networks: Types of networks, Types of transmission media, Concept and types of Multiplexing, Concept and types of Multiple Access techniques, Principles and types of Analog and Digital Modulation",
          "ISO/OSI model: Physical layer: Types of cables, Types of connectors, Communication standards, Data-Link layer, Network Layer: IPv4, IPv6, Routing and Subnetting, Transport Layer: TCP, UDP",
          "Networks in Industrial Process Automation: Introduction to networks in Industrial Process Automation, Networks and Protocols: AS-i, CAN, DeviceNet, Interbus, LON, Foundation Fieldbus, HART, PROFIBUS-PA, BACnet, ControlNet, Industrial Ethernet, Ethernet/IP, MODBUS, PROFIBUS-DP",
          "Fiber Optic Communication: Principles of Fiber-Optic networks, Types of Fiber-Optic cables, Fiber-Optic Network design, Fiber cable installation and setup, Splices and Connectors, Inspection and testing",
          "Radio, Satellite and Infrared Communication: Radio systems, Spread Spectrum techniques, Satellite LANs, Communication bands in satellite communication, Infrared Systems, Very fast Infrared"
        ],
        "references": [
          "Liptak, B.G. (Ed.), Instrument engineers' handbook, Vol. 3: Process software and digital networks, (4e) CRC Press, Boca Raton, London, 2012.",
          "Andrew S. Tanenbaum, Computer Networks, (5e), Prentice Hall of India Pvt. Ltd., 2011.",
          "William Stallings, Data and Computer Communications,(8e), Prentice Hall of India Pvt. Ltd., 2014.",
          "James F. Kurose, Keith W. Ross, Computer Networking (A Top-Down Approach Featuring the Internet), (3e), Pearson Education, 2005.",
          "Todd Lammle, Cisco Certified Network Associate-Study Guide, (2e), Sybex Inc. Publishing. 2000."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MTE 4408",
        "title": "PRINCIPLES OF CRYPTOGRAPHY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction – Security Goals, Attacks, Services and Mechanisms",
          "Mathematics of Cryptography – Euclidean Algorithm, Modular Arithmetic, Fermat's and Euler's Theorems, Testing for Primality, The Chinese Remainder Theorem",
          "Classical Encryption Techniques – Symmetric Cipher Model, Substitution and Transposition Techniques, S-DES, DES, 2DES, 3DES, Modes of Operation, AES - Structure, Round Functions, Key Expansion",
          "Stream Ciphers, RC4",
          "Public-Key Cryptosystems, RSA Algorithm, Diffie-Hellman Key Exchange, ElGamal Cryptographic System",
          "Cryptographic Hash Functions – Applications, Hash Functions based on Cipher Block Chaining, Secure Hash Algorithm, SHA-3",
          "Message Authentication Requirements, Message Authentication Functions, Digital Signatures"
        ],
        "references": [
          "William Stallings, Cryptography and Network Security: Principles and Practice, (7e), Pearson, 2017.",
          "Behrouz A. Forouzan and Debdeep Mukhopadhyay, Cryptography and Network Security, (3e), McGraw Hill, 2015.",
          "AtulKahate, Cryptography and Network Security, (3e), McGraw Hill, 2017.",
          "Bruce Schneier, Applied Cryptography, (2e), John Wiley and Sons, Inc., 1996."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4409",
        "title": "ARTIFICIAL INTELLIGENCE FOR ROBOTIC VISION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Image Formation",
          "Linear Filtering",
          "Correlation",
          "and Convolution",
          "Visual Features: Edge",
          "Blobs",
          "Corner Detection Algorithms",
          "SIFT",
          "SURF",
          "HOG",
          "Geometric transformation",
          "Perceptron",
          "Delta Learning Rule",
          "Multi-layer Perceptron",
          "Backpropagation",
          "optimizers and Regularizers",
          "data augmentation",
          "Introduction to CNN",
          "Evolution of CNN Architectures: AlexNet",
          "ZFNet",
          "VGG",
          "Inception Nets",
          "ResNets",
          "DenseNets",
          "Background of Object Detection",
          "CNN for Recognition and Detection",
          "R-CNN",
          "Fast R-CNN",
          "Faster R-CNN",
          "YOLO",
          "SSD",
          "RetinaNet",
          "CNNs for Segmentation: FCN",
          "SegNet",
          "U-Net",
          "Mask-RCNN Review of RNNs",
          "CNN + RNN Modls for Video Understanding",
          "Deep Generative Models: GAN",
          "Cycle-GANs",
          "Progressive GANs",
          "StackGANs",
          "Pix2Pix Applications",
          "Image Editing",
          "Inpainting",
          "Super-Resolution",
          "Image Restoration",
          "3D Object Generation"
        ],
        "references": [
          "Good fellow, Ian, Yoshua Bengio, and Aaron Courville. Deep learning. MIT press, 2016.",
          "Nielsen, Michael A. Neural networks and deep learning. San Francisco, CA, USA: Determination press, 2015.",
          "Adrian Rosebrock, Deep Learning for Computer vision with Python-Starter Bundle, Pyimagesearch, 2017.",
          "Adrian Rosebrock, Deep Learning for Computer vision with Python-Practitioner Bundle, Pyimagesearch, 2017.",
          "Szeliski, Richard. Computer vision: algorithms and applications. Springer Science & Business Media, 2010.",
          "David, A., and Ponce Jean. Computer vision: a modern approach. Prentice Hall ,2002.",
          "Richard Hartley, Andrew Zisserman, Multiple View Geometry in Computer Vision, 2004."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4410",
        "title": "ROBOT DYNAMICS AND CONTROL",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Review of Robot Kinematics-Transformations: Joint space, Task space, Forward Kinematics, Inverse Kinematics, Jacobians, Trajectory Generation, Serial and Parallel Kinematics",
          "Robot Dynamics-Lagrange-Euler Dynamics, Force, Inertia, and Energy, Lagrange's Equations of Motion, Newton's equations of motion, Formulation of robot dynamics, State-Variable Representations, Dynamics of robots with actuators",
          "Robot control problems – Regulator problem, tracking problem, controllers. Set point Tracking, Actuator Saturation, Integrator Anti-windup Compensation, Quadratic Optimal control problem",
          "Nonlinear dynamics and control – Lyapunov stability theorem, Robust control, Feedback-Linearization Controllers, Lyapunov Designs, Variable-Structure Controllers, Saturation-Type Controllers"
        ],
        "references": [
          "Mark W. Spong, Seth Hutchinson, M. Vidyasagar, Robot Modeling and Control, (2e), John Wiley and sons, 2009",
          "Frank L. Lewis, Robot Manipulator Control- Theory and Practice, (2e), CRC Press, 2003",
          "Mark W. Spong, Robot Dynamics and Control, (2e), John Wiley and sons, 2009",
          "Yoshikawa, Foundations of Robotics: Analysis & Control, (1e), Prentice Hall India, 2009"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4411",
        "title": "ROBOT PATH PLANNING AND MOBILE ROBOTS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Autonomous mobile robots - Locomotion",
          "Wheeled locomotion",
          "Robot kinematics models & constraints",
          "Mobile robot workspace",
          "Configuration Space – Obstacles space, dimensions of configuration space, topology of configuration space, parameterization, transformations",
          "Potential Functions, Gradient descent. Implementation in plane- computation, local minima problem",
          "Algorithms – Analysis and complexity, running time, complexity, completeness",
          "Visibility graph",
          "Graph Search A*, Weighted A*, Anytime & Incremental Search D*",
          "Road Maps",
          "Generalized Voronoi Graph (GVG), GVG – transversality, connectivity, opportunist path planning",
          "Cell Decomposition – Trapezoidal decomposition, Morse cell decomposition, Visibility based decomposition",
          "Sampling Based Algorithms",
          "RapidlyExploring Random Trees (ERT)",
          "Control based planning",
          "Manipulation planning",
          "Optimal motion planning",
          "Feedback motion planning",
          "Motion Planning – Motion planning under kinematics and dynamic constraints",
          "Trajectory planning",
          "Non-holonomic constraints",
          "Path planning",
          "Combined path planning and control"
        ],
        "references": [
          "Fahimi, Farbod, Autonomous robots: modeling, path planning, and control. Vol. 107. Springer Science & Business Media, 2008.",
          "H. Choset, K. M. Lynch, S. Hutchinson, G. A. Kantor, W. Burgard, L. E. Kavraki, S. Thrun Principles of Robot Motion: Theory, Algorithms, and Implementations, MIT Press, Cambridge, MA, 2005.",
          "S. M. LaValle, Planning Algorithms, Cambridge University Press, Cambridge, UK, 2006."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4412",
        "title": "SOFT ROBOTICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Bio robotics",
          "biomimetics",
          "nature-inspired designs",
          "materials for soft robot",
          "biological analogy",
          "Soft Actuators",
          "Soft Sensors",
          "Electroactive Polymer",
          "Ionic Polymer Metal Composites",
          "Shape Memory Alloy",
          "Artificial Muscles based on Electric/Pneumatics",
          "Thermal/Chemical Actuation",
          "Introduction to 3D Printing",
          "3D printing of Soft Materials",
          "Hyper-elasticity",
          "Finite Element Analysis",
          "Stretchable Electronics",
          "Soft Electrical Materials",
          "Soft Mechanical Composite Materials",
          "Gradient of Material Stiffness",
          "Mechanical Soft Materials",
          "Pneumatic Artificial Muscles",
          "Mathematical Modelling of Flexible Manipulator",
          "Introduction to Euler Cautchy Elasticity Problem Hyper-redundant kinematic structures",
          "Resolution of inverse kinematics",
          "Mathematical formulation for animating flexible structure",
          "Bio-mimetics (modelling of snake/earthworm, caterpillar etc)",
          "Continuum Mechanics",
          "Eigenvalues and Eigenvectors",
          "Geometric interpretation of eigenvectors",
          "Cayley-Hamilton theorem",
          "Principal Component Analysis",
          "Singular Value Decomposition",
          "ISO-Map Dimensional Reduction technique",
          "Case Studies on wearable Robotics",
          "Space Robotics",
          "Deep-Sea Robotics",
          "Healthcare Systems",
          "Under-actuated Robots"
        ],
        "references": [
          "Matthew Borgatti, Kari Love, Christopher G. Atkeson, MAKE: Soft Robotics – A DIY Introduction to Squishy, Stretchy, and Flexible Robots, 2018",
          "Jog, C.S., Foundations and applications of mechanics: Volume I: Continuum mechanics, Narosa Publishing House, 2007",
          "Alexander Verl, Alin Albu-Schaffer, Oliver Brock, Annika Raatz, Soft Robotics Transferring Theory to Application, Springer, 2015",
          "Jaeyoun (Jay) Kim, Microscale Soft Robotics: Motivations, Progress, and Outlook, Springer International Publishing, 2017",
          "Cecilia Laschi, Jonathan Rossiter, Fumiya Iida, Matteo Cianchetti, Laura Margheri, Soft Robotics: Trends, Applications and Challenges, Springer International Publishing, 2016"
        ],
        "flags": [
          "missing_semester",
          "uncertain_tags",
          "department_mismatch"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4413",
        "title": "SEMICONDUCTOR AND VLSI SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to Semiconductor devices",
          "Device Basic Structure and Characteristics",
          "High current effects in diodes",
          "Breakdown considerations for various devices",
          "Schottky rectifiers",
          "P-i-N rectifiers",
          "Power BJTs",
          "Parasitics in Power Transistors",
          "Power MOSFETs",
          "Thyristors",
          "Power Insulated Gate Transistors",
          "Heat transfer in power devices",
          "Device packaging",
          "Basic MOS device",
          "Overview of non-ideal behaviour of deep sub-micron MOS transistors",
          "Current mirrors and current sources",
          "Single stage amplifiers",
          "Differential amplifiers – small signal analysis, frequency response, noise",
          "OTA circuits – differential pair, cascodes, folded-cascodes, two-stage OTAs",
          "Stability, frequency compensation, CMRR, PSRR",
          "Feedback",
          "Fully differential op-amps, CMFB",
          "Bandgap references",
          "Output stages",
          "Overview of CMOS device fundamentals (DC Characteristics, AC Characteristics, Processing overview)"
        ],
        "references": [
          "Baliga,G.J., Fundamentals of Power Semiconductor Devices, Springer.",
          "S.M. Sze, Physics of Semiconductor Devices, (2e), Wiley, 1981.",
          "Behzad Razavi, Design of Analog CMOS Integrated Circuits, McGrawHill.",
          "Willy M. C, Analog Design Essentials, Sansen, Springer",
          "Gray, Hurst, Lewis and Meyer, Analysis and Design of Analog Integrated Circuits, Wiley.",
          "Neil H.E. Weste, David Money Harris, Addison-Wesley, CMOS VLSI design: A circuits and systems perspective, Pearson."
        ],
        "flags": [
          "missing_sem",
          "unclear_core_elective_status"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4414",
        "title": "SMART MATERIALS FOR MICRO AND NANO SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Material Science: introduction, structure, defects, bonds and bands",
          "thermodynamics of material, kinetics, nucleation",
          "Thin film nucleation: Atomic view of substrate surfaces",
          "thermodynamic aspects of Nucleation",
          "Kinetic processes in Nucleation and growth",
          "Epitaxy: Lattice mismatch and defects in epitaxial film",
          "epitaxy of compound semiconductors",
          "High and low temp. methods of deposition",
          "Structural and chemical characterization of films and surfaces",
          "XRD, TEM, AFM, SEM",
          "Inter diffusion: compound formation, phase transformation in thin film",
          "metal, semiconductor reaction, mass transport in thin film",
          "Mechanical properties of thin films",
          "Mechanical testing and strength of thin films",
          "analysis of internal stress"
        ],
        "references": [
          "Ephrahim Suhir, Y.C Lee, C. P Wong, Micro- and Opto- Electronic Materials and Structures",
          "Kasturi L. Chopra, Thin Film Phenomena",
          "Kasturi L. Chopra, Indrajeet Kaur, Thin Film Device Applications",
          "Milton Ohring, The Materials Science of Thin Films",
          "Klaus K. Schuegraf, Hand book of thin films deposition processes and techniques; Principles, methods, equipment, and application",
          "O. S. Heaven, Thin Film Physics"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4415",
        "title": "DESIGN OF MICRO AND NANO DEVICES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction and historical background",
          "Microsensors: Sensors and characteristics",
          "Integrated Smart sensors",
          "Sensor Principles/classification",
          "Physical sensors (Thermal sensors, Electrical Sensors, tactile sensors, accelerometers, gyroscopes, Proximity sensors, Angular displacement sensors, Rotational measurement sensors, pressure sensors, Flow sensors, MEMS microphones etc.)",
          "Chemical and Biological sensors (chemical sensors, molecule-based biosensors, cell-based biosensors)",
          "Transduction methods (Optical, Electrostatic, Electromagnetic, Capacitive, Piezoelectric, piezoresistive etc.)",
          "Microactuators: Electromagnetic and Thermal microactuation",
          "Mechanical design of microactuators",
          "Microactuator examples (microvalves, micropumps, micromotors)",
          "Microactuator systems (Ink-Jet printer heads, Micro-mirror TV Projector)",
          "Introduction to interfacing methods (bridge circuits, Programmable gain instrumentation amplifiers, A/D and D/A converters, microcontrollers)",
          "Applications and case studies (Microsensors and actuators in environmental sensing, RF/Electronics devices, Optical/Photonic devices, microsensors for space applications, MEMS sensors in navigation systems, radiation sensors, Medical devices, Bio-MEMS)"
        ],
        "references": [
          "M.-H. Bao, Micromechanical Transducers: Pressure sensors, accelrometers, and gyroscopes, Elsevier, New York, 2000",
          "Richard S. Muller, Roger T. Howe, Stephen D. Senturia, Rosemary L. Smith, and Richard M. White, Microsensors, IEEE Press, IEEE Number PC 0257-6, ISBN 0-87942-254-9, New York, 1991",
          "William Trimmer, Micromechanics and MEMS: Classic and Seminal Papers to 1990, IEEE Press, IEEE Number PC4390, ISBN 0-7803-1085-3, New York",
          "Beckwith T. G., Margoni R. D., Lienhard J. H., Mechanical Measurements, New York: Addison-Wesley Pub. Co, 1995",
          "G. K. Ananthasuresh, K. J. Vinoy, S. Gopalakrishnan, K. N. Bhat, and V. K. Aatre, Micro and Smart Systems, Wiley-India, 2010"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4416",
        "title": "FABRICATION AND TESTING OF MICRO SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Classical scaling in CMOS",
          "Moore's Law",
          "Clean room concept",
          "Material properties",
          "crystal structure",
          "lattice",
          "Growth of single crystal Si",
          "Cleaning and etching",
          "Thermal oxidation",
          "Dopant diffusion in silicon",
          "Deposition & Growth (PVD, CVD, ALD, epitaxy, MBE, ALCVD etc.)",
          "Ion-implantation",
          "Lithography (Photolithography, EUV lithography, X-ray lithography, e-beam lithography etc.)",
          "Etch and Cleaning",
          "CMOS Process integration",
          "Back end of line processes (Copper damascene process, Metal interconnects; Multi-level metallization schemes)",
          "Advanced technologies(SOI MOSFETs, Strained Si, Silicon-Germanium MOS, metal semiconductor source / drain junctions, High K, metal gate electrodes and work function engineering, Double gate MOSFETs, FinFETs, TunnelFETs etc.)",
          "emerging research devices and architectures (Nanowire FETs, CNT FETs, Graphene transistors, Organic FETs)"
        ],
        "references": [
          "James Plummer, M. Deal and P.Griffin, Silicon VLSI Technology, Prentice Hall Electronics",
          "Stephen Campbell, The Science and Engineering of Microelectronics, Oxford University Press, 1996",
          "S.M. Sze (Ed), VLSI Technology, (2e), McGraw Hill, 1988",
          "C.Y. Chang and S.M.Sze (Ed), ULSI Technology, McGraw Hill Companies Inc, 1996"
        ],
        "flags": [
          "missing_semester",
          "department_mismatch (MTE code vs Mechatronics department context)",
          "extra_text_present (unrelated 'PRECISION AGRICULTURE TECHNOLOGY' line)"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4417",
        "title": "SMART FARMING MACHINERY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Importance of agriculture as an industry in the context of shortage of quality food and resources, soil properties and their importance, soil fertility and essential plants nutrients",
          "Soil-water-plant relationship",
          "Types of horticultural crops and its life cycle",
          "Working principles of tools and machinery associated with soil preparation for variety of crops",
          "Principles of sowing and cultivation equipment",
          "Mechanically and electronically controlled fertilizer supply and pesticide spraying machines",
          "Machinery for horticultural crops protection and weed control",
          "Introduction to climate controlled agriculture",
          "Plant response to greenhouse environment",
          "Materials, planning and design of greenhouses",
          "Instrument for measurement: pH, Electrical conductivity, gas analysis, humidity, leaf area, chlorophyll content and soil moisture & temperature",
          "Automatic control of temperature, moisture, air",
          "Smart irrigation systems, hydroponics technology",
          "Working principles of harvesting machinery for various crops",
          "Material handling equipment, conveyer and elevators, their working principle and selection",
          "Grain drying equipment: deep bed dryer, flat bed dryer, tray dryer, fluidized bed dryer, re-circulatory dryer and solar dryer"
        ],
        "references": [
          "R.K. Sharma, A.K.Soni, R. Bhagat, N. Pandey and V.K. Pandey, Basics of Agriculture for Engineers, Daya Publishing House, New Delhi, 2014",
          "Farm Power and Machinery ICAR e-Course",
          "Sanjay Kumar, Farm Power and Machinery, Kalyani Publications, 978-9327287257, 2018",
          "Cecilia Stanghellini; Bert Van 't Ooster; Ep Heuvelink, Greenhouse Horticulture Technology for Optimal Crop Production, ISBN: 978-90-33-8686-329-7, Wageningen Academic Publishers, 2019",
          "Basavaraj; Srigiri, D.; P.R., Jayan, Textbook Of Farm Machinery And Power Engineering, New India Publishing Agency, 2019",
          "Amalendu Chakraverty, Arun S. Mujumdar, Hosahalli S. Ramaswamy, Handbook of Postharvest Technology: Cereals, Fruits, Vegetables, Tea, and Spices, CRC Press, 2003",
          "Prabhat K. Nema, Barjinder Pal Kaur, Arun S. Mujumdar, Drying Technologies for Foods, Fundamentals & Applications, CRC press, 2019"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4418",
        "title": "ROBOTICS AND AUTOMATION IN AGRICULTURE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "General robotic architecture, sensors, drive systems, kinematics, task and trajectory planning, robot controller and operating system",
          "Classification and working of the electric and pneumatic drive used in robots, different types of pneumatic control valves and design of pneumatic control circuits",
          "Working principles of different types of end-effectors, Design and development of robotic end-effector for harvesting different crops",
          "Working principals of thermal, depth, real-sense and multi-spectral cameras, capturing, processing and analysis of different images, integration of vision system with the end effector and drive system",
          "Working Principles of drone, classification of agriculture drones, components of drones, application of drones in agriculture for surveillance and pesticide application"
        ],
        "references": [
          "R Mittle, I Nagrath, Robotics and Control, McGraw Hill Education.",
          "Joji P, Pneumatic Controls, John Wiley & Sons, 2018.",
          "S.K. Pillai, A First Course on Electrical Drives, New Age Publishers.",
          "Gareth J. Monkman, Stefan Hesse, Ralf Steinmann, Henrik Schunk, Robot Grippers, Wiley VCH Verlag GmbH & Co. KGaA, 2006.",
          "Inamuddin, RajenderBoddula, Abdullah M. Asiri, Actuators: Fundamentals, Principles, Materials and Applications, Scrivener Publishing LLC, 2020.",
          "Berthold K.P. Horn, Robot Vision, MIT Press",
          "K. R. Krishna, Agricultural Drones A Peaceful Pursuit, 2018."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4419",
        "title": "FOOD PROCESS AUTOMATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Introduction to Food quality, automated evaluation of food quality, food quality quantization and process control",
          "Typical problems in food quality evaluation, food odor measurement, continuous snack food frying quality",
          "Sampling elaboration with examples",
          "Concepts and systems for data acquisition: ultrasonic signal acquisition, electronic nose data acquisition, image acquisition",
          "Data analysis: Data pre-processing, Static data analysis, Dynamic data analysis, Image processing (Image segmentation, Image feature extraction)",
          "Modeling strategies: Theoretical and empirical modeling, Static and dynamic modeling, Linear statistical modeling, ANN modeling",
          "Prediction: Prediction and classification, Sample classification for grading using linear statistical and ANN models, Electronic nose data classification, Snack food classification for eating quality evaluation, One-step-ahead prediction",
          "Process control: Internal model control, Predictive control, Neuro-fuzzy PDC",
          "Systems integration: Product quality quantization systems integration, product quality and process control systems integration, product quality quantization and process control systems development",
          "Packaging systems: Vacuum, Controlled and Modified atmosphere packaging systems, bottling machines, Cartooning systems, Seal and Shrink-packaging machine, Form, Fill and Sealing machine, Aseptic packaging systems, Retort packaging, Active and Intelligent packaging systems",
          "Future trends in food industry: 3D food printing technology (Extrusion based, inkjet based, Binder jetting, Selective laser sintering)",
          "Self-study topics: Food safety, Quality control system, data analysis, image processing, predictive modelling"
        ],
        "references": [
          "Robberts Theunis C., Food Plant Engineering Systems, CRC Press, Washington, 2013.",
          "Krammer, A. and Twigg, B.A. Quality Control for the Food Industry, Volume 2, Applications. The AVI Publishing Company, Westport, Connecticut.",
          "Ranganna, S., Hand book of Analysis and Quality Control for Fruits and Vegetable Products, Tata McGraw Hill, New Delhi.",
          "N. P. Padhy, S. P. Simon, Soft Computing: With MATLAB Programming, Oxford University Press, 2015.",
          "Sudheer, K P. and Indira, V. Post Harvest Engineering of Horticultural crops. New India Publishing House.",
          "Lal Giridhari, Siddappa and Tondon, Preservation of Fruits and Vegetables. ICAR, New Delhi, 2001.",
          "Srivastava and Sanjeev Kumar. Fruit and Vegetable Preservation: Principles and Practices. Kalyani Publishers, 2008."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4420",
        "title": "DIGITAL AGRICULTURE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Use of electrical energy in agriculture, electro-mechanical energy conversion, Electrical motors, pumps, Selection of motors for different farming applications, remote controlled intelligent irrigation systems, machine learning approach for efficient water usage, renewable energy sources",
          "An Introduction to precision farming, GIS/GPS positioning system for precision farming, Yield monitoring and mapping, soil sampling and analysis, Computers and Geographic information systems, Precision Farming-Issues and conditions, Role of electronics in farm machinery for precision farming",
          "Design and development of IoT system for fully automatic farm, Vertical forming, monitoring of climate conditions, green house automation, crop management, IOT for allied agriculture practices",
          "Data acquisition systems, Test sites, Common measurements, Geologic investigations, Agriculture and Forestry investigations, Atmospheric investigation, visual image interpretation, digital image processing, Earth resource satellite, Ground water level monitoring",
          "The digital agriculture revolution, challenges of digital transformation, key drivers of digital agriculture transformation, Information and Communication Technology (ICT), Mobile Technology and its impact on agriculture and rural development, Artificial Intelligence (AI) based farming, adoption of ICTs and digital technologies in agriculture, Online Marketing of agro-based products, Strengthening Agricultural Market Access with ICT and Digital Tools",
          "Soil sensors calibration, irrigation scheduling, crop water estimation, Water quality management in irrigation"
        ],
        "references": [
          "Singh Brahma and Balraj Singh, Advances in Protected Cultivation, New India Publishing Company, 2014",
          "Sharma P. Precision Farming,Daya Publishing House New Delhi, 2007",
          "Qin Zhang, Precision Agriculture Technology for Crop Farming, (1e), 2016",
          "Narendra Singh Rathore, Sunil Joshi, Naveen Choudhary, Digital Technologies for Agriculture, ISBN: 9789390591916, 2022",
          "Annamaria Castrignano, Gabriele Buttafuoco, Raj Khosla, Abdul Mouazen, Dimitrios Moshou, Olivier Naud, Agricultural Internet of Things and Decision Support for Precision Smart Farming, (1e), 2020",
          "Pradeep Tomar, Gurjit Kaur, Artificial Intelligence and IoT-Based Technologies for Sustainable Farming and Smart Agriculture, 2021"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4441",
        "title": "ANTENNAS, RADAR AND NAVIGATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Antenna Fundamentals: Radiation mechanism and current distribution in thin wire antennas. Antenna fundamental parameters. Radiation Integrals and Auxilliary Potential Functions: Vector potential A and F and their solutions. Electric and magnetic fields of J and M sources. Far field pattern. Duality and reciprocity theorem. Types of Antennas.",
          "Introduction to RADAR and Navigation systems: Radar range equation. Minimum detectable signal, receiver noise, radar clutter, pulse repetition frequency. Doppler effect. Introduction to navigation systems and its types.",
          "Types of RADARs and SONAR: CW radar, FMCW radar. Moving target indicator (MTI) and pulse Doppler radar, Synthetic aperture radar. Radio altimeter, LORAN, DECCA, OMEGA, inland shipping aids, SONAR."
        ],
        "references": [
          "Balanis C. A., Antenna Theory, Analysis and Design (4e), John Wiley and Sons, New Delhi, 2016.",
          "Kraus J.D., Antennas for all Applications (4e), McGraw-Hill, 2001.",
          "Balanis C. A., Introduction to Smart Antennas (1e), Morgan and Claypool Publishers, 2007.",
          "Skolnic M., Introduction to RADAR Systems (2e), McGraw-Hill, 2010.",
          "PeytonZ. and Peebles Jr., Radar Principles (2e), Wiley India, 2009."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4442",
        "title": "AUGMENTED REALITY AND VIRTUAL REALITY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction",
          "The three I's of Virtual reality",
          "History of Virtual Reality",
          "Early Commercial VR Technology",
          "Classic Components of VR System",
          "Multiple Models of Input and Output Interface in Virtual Reality",
          "Gesture Interfaces",
          "Three-Dimensional position trackers",
          "Navigation and Manipulation Interfaces",
          "Graphics",
          "Three-dimensional Sound and Haptic Display",
          "Graphic Displays",
          "Sound Displays",
          "Haptic Feedback",
          "Marker Tracking",
          "Multiple Camera Infrared Tracking",
          "Natural Feature Tracking by Detection",
          "Incremental Tracking",
          "Simultaneous Localization and Mapping",
          "Outdoor Tracking",
          "Computer Architectures for VRs",
          "The Rendering Pipeline",
          "PC Graphics Architecture",
          "Workstation Based Architectures",
          "Distributed VR architectures",
          "Geometric Modelling",
          "Kinematic Modelling",
          "Physical Modelling",
          "Behavioral Modelling",
          "Model management"
        ],
        "references": [
          "Burdea, Grigore C., and Philippe Coiffet. \"Virtual reality technology.\" International Journal of e-Collaboration 2, no. 1 (2006): 61-64.",
          "Schmalstieg, Dieter, and Tobias Hollerer. Augmented reality: principles and practice. Addison-Wesley Professional, 2016.",
          "Parisi, Tony. Learning virtual reality: developing immersive experiences and applications for desktop, web, and mobile. \"O'Reilly Media, Inc.\", 2015.",
          "Aukstakalnis, Steve. Practical augmented reality: A guide to the technologies, applications, and human factors for AR and VR. Addison-Wesley Professional, 2016.",
          "Linowes, Jonathan. Unity virtual reality projects. Packet Publishing Ltd, 2015."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4443",
        "title": "AUTONOMOUS MOBILE ROBOTICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Locomotion: Introduction, Legged Mobile Robots, Wheeled Mobile Robots",
          "Mobile Robot Kinematics and Motion in Global Coordinates: Kinematic Models and Constraints, Mobile Robot Maneuverability, Mobile Robot Workspace, Dynamics of Quadrotor-Type Mobile Robots",
          "Perception: Sensors for Mobile Robots, Feature Extraction",
          "GNSS and Mobile Robot Localization: The Challenge of Localization: Localization-Based Navigation versus Programmed Solutions, Map Representation, Probabilistic Map-Based Localization, Global Navigation Satellite System",
          "Planning, Navigation and Energy Considerations: Competences for Navigation, Navigation Architectures, Energy Limitations and Energetic Efficiency of Mobile Robots",
          "Self-study: Different types of robots and their classification with case studies. Implementing various algorithms, in Mini projects"
        ],
        "references": [
          "Siegwart, Roland, Illah Reza Nourbakhsh, and Davide Scaramuzza. Introduction to autonomous mobile robots. MIT press, 2011.",
          "Howie Choset, Kevin M Lynch, Principles of Robot Motion, MIT Press, 2005.",
          "King Sun Fu, Gonzalez ,Robotics- control, sensing, vision, and intelligence, McGraw-Hill, 1987.",
          "Kagan, Eugene, Nir Shvalb, and Irad Ben-Gal, eds. Autonomous mobile robots and multi-robot systems: Motion-planning, communication, and swarming. John Wiley & Sons, 2019."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4444",
        "title": "BIOMECHATRONICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to biomechatronics, physiological systems- biochemical, nervous, cardiovascular, respiratory, musculoskeletal systems, fusion of bio and mechatronics, components of a biomechatronic system- sensors, actuators, controller, signal processor, few application areas",
          "Sensors for capture of biological signals- surface electromyographic sensors, types of electrodes, intramuscular electromyography, electroencephalography, electrocardiography, electrooculography, nerve cuff, brain array, oxygen light sensors, oxygen consumption sensors",
          "Chemical sensors to capture stimuli produced by various chemical compounds, electric sensors, optical sensors, mechanical sensors, thermal sensors",
          "Purpose of biomechatronic actuators- biological function replacement, augmentation or improvement, design goals of biomechatronic actuators, types of biomechatronic actuators- Motors, electromagnetic actuators, fluidic actuators, shape memory alloys, electroactive polymers, transmissions- linear, rotary, differential gear transmissions",
          "Biomechatronic system model- Model based open loop control, model based closed loop control, case study-model based control of a biomechatronic system",
          "Biomechatronic applications of brain-computer interface, upper limb prosthetic device, upper and lower extremity exoskeletons"
        ],
        "references": [
          "Jacob Segil, Handbook of Biomechatronics, Academic Press, 2019.",
          "Marko B. Popovic, Biomechatronics, Academic Press, 2019.",
          "Graham m. Brooker, Introduction to Biomechatronics, Scitech Publishing, 2012.",
          "Shane Xie, Wei Meng, Biomechatronics in Medical Rehabilitation, Springer, 2017."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MTE 4445",
        "title": "BUILDING AUTOMATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Overview of Digital Controller: Data Form used in computers, Microcomputer, Input / Output Unit, Processor Operation and Software, Sensors, Actuator, I/O devices, Field Controllers",
          "Network and Communication protocols: Networking basics, Types of Networks- Serial and Parallel Communication, RS232 and RS 485 Interfaces, MODBUS protocol overview, BACnet protocol overview",
          "Introduction to Building Management Systems: Buildings and Energy Management, Different systems in a building",
          "Introduction to HVAC, Struxure Ware for Building Operation",
          "General BMS architecture: Introduction to HVAC and Optimal control methods for HVAC Systems: Important components of HVAC, HVAC Control systems and Direct Digital Control, AHU, Chillers, Zones, Air Distribution Systems, Field Devices, Schneider Controllers (PLC's)",
          "Lighting control systems: Strategies for energy management and lighting",
          "Security and Safety Control Systems: Access Control- Introduction, Basic Components, Controller / Panel, Credentials, Reader, Locking Device, How it works / Operations, Type of Card/Readers, Anti-Pass back, Power Requirements, Videos (Digital Video Recorder), Types of Camera, Fire Alarm Systems - Sprinklers",
          "System integration and convergence: Need for integration, interoperability and protocols, BMS integration case studies, iBMS, Compatibility of different internet technologies and its application in BMS",
          "Application of internet for Automation and Management: Web Based Automation, General Architecture, Web Enablement, Data Communication Energy Management: Overview on EMS, Energy Analysis/Audit",
          "Green Buildings (LEED): Green Buildings Approach, Benefits of Green Buildings, Elements of Green Building Design, Leadership in Energy and Environmental Design (LEED), LEED Case Study"
        ],
        "references": [
          "V. K. Jain ,Automation Systems in Smart and Green Buildings, published by Khanna Publishers, 2009",
          "Reinhold A, Understanding Building Automation Systems: Direct Digital Control, Energy Management, Life Safety, Security/access Control, Lighting, Building Management Programs, 2009",
          "Ronnie J. Auvil ,HVAC Control Systems , (2e), 2007",
          "Thomas L. Norman, Integrated Security Systems Design: Concepts, Specifications, and Implementation (1e) by CPP PSP CSC 2007",
          "Benantar, Messaoud, Access Control Systems: Security, Identity Management and Trust Models, Springer publication, 2005"
        ],
        "flags": []
      },
      {
        "sem": null,
        "code": "MTE 4446",
        "title": "CLOUD COMPUTING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction",
          "Cloud infrastructure",
          "Cloud computing delivery models and services",
          "Cloud computing at Amazon",
          "The Google perspective",
          "Microsoft Windows Azure",
          "Application paradigms",
          "Architectural styles of cloud computing",
          "Cloud resource management and scheduling",
          "Cloud resource virtualization",
          "Types of virtualization",
          "Understanding hypervisors",
          "Virtual machine and its components",
          "Resource management",
          "Memory ballooning",
          "Thin virtual provisioning",
          "Storage tiering",
          "Virtual LAN",
          "VLAN trunking",
          "VLAN tagging",
          "Business continuity and cloud management",
          "Virtual machine fault tolerance",
          "Virtual machine replication methods",
          "Cloud security",
          "Virtual machine security",
          "Access control and identity management",
          "Cloud tools: Eucalyptus",
          "OpenNebula/OpenStack",
          "CloudSim"
        ],
        "references": [
          "Dan C Marinescu, Cloud Computing Theory and Practice, Elsevier, 2013",
          "Rajkumar Buyya, Christian Vecchiola, S. Thamarai Selvi, Mastering Cloud Computing, McGraw Hill, 2017",
          "Anthony T. Velte, Toby J. Velte, Robert Elsenpeter, Cloud Computing: A Practical Approach, McGraw Hill, 2017"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4447",
        "title": "DATA ANALYTICS AND MACHINE INTELLIGENCE",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Statistical topics for Data science, Data- sources, privacy and confidentiality, samples vs. population",
          "Data Pre-processing",
          "Data Analysis and Visualization – descriptive, inferential statistics, data mining techniques",
          "Grouping – Cluster Analysis",
          "Market Basket Analysis, Association Analysis, Market Basket Analysis",
          "Evaluation of Classification and Predictive performance, Forecasting models as application",
          "Big-analytics software architectures",
          "Introduction to Machine Learning, Mathematical Preliminaries, Supervised Learning, Model Selection, learning theory-bias/variance trade-off, Unsupervised learning-clustering, Dimensionality reduction techniques, Ensemble Models, Reinforcement learning",
          "Deep Feed forward Networks: architecture design, Back propagation algorithm, Regularization for Deep Learning, Dataset Augmentation techniques, Adversarial Training, Optimization for Training Deep Models, Convolutional Networks using Baseline models, Recurrent and Recursive Networks, Time Series Applications"
        ],
        "references": [
          "Kevin P Murphy, Machine Learning: A Probabilistic Perspective, MITcPress, 2012",
          "Mehryar Mohri, Afshin Rostamizadeh, and Ameet Talwalkar, Foundations of Machine Learning, MIT Press, 2012",
          "Ian Goodfellow, Yoshua Bengio and Aaron Courville, Deep Learning, MIT Press 2016",
          "Glenn J. Myatt, Wayne P. Johnson, Making Sense of Data I: A Practical, Guide to Exploratory Data Analysis and Data Mining, (2e), John Wiley & Sons Publication, 2014"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4448",
        "title": "DATA MINING AND VISUALIZATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "The Statistical Data Mining Process: The Data Pre-processing Phase and Analytical Phase",
          "The Basic Data Types: Non-dependency Oriented Data, Dependency Oriented Data, Association Pattern Mining, Data Clustering, Outlier Detection, Data Classification, Application Scenarios",
          "Data Classification: Feature Selection for Classification, Filter, Wrapper and Embedded Models, Decision Trees, Rules based classifiers, SVM, Probabilistic Classifiers and Neural Nets",
          "Mining Data Streams: Data Structures for Streams, Clustering Data Streams, Streaming Classification",
          "Mining Text Data: Document Preparation and Similarity Computation, Specialized Classification Methods for Text",
          "Mining Time-Series Data: Time-Series Preparation and Similarity, Time-Series Forecasting, Clustering, Classification and Outlier detection",
          "Mining Discrete Sequences: Sequential Pattern, Sequence Clustering, Hidden Markov Models and Sequence Classification",
          "Mining Web Data: Web Crawling and Resource Discovery, Search Engine Indexing and Query Processing, Ranking Algorithms, Recommender Systems, Web Usage Mining",
          "Data Visualization, principles, tools and techniques"
        ],
        "references": [
          "Charu Aggarwal, Data Mining, 2(e), 2015",
          "CR Rao, Data Mining and Data Visualization, 2(e), 2010",
          "Claus O. Wilke, Fundamentals of Data Visualization, 2020, 2(e), O'Reilly"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4449",
        "title": "DIGITAL MANUFACTURING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Digital manufacturing: Types of production systems",
          "Needs of digital manufacturing, effective & efficient use of digital manufacturing (DM) tools. Scope of digital manufacturing in future",
          "Flexible manufacturing systems, Computers in manufacturing industries, Key challenges, techniques, requirements, product life cycle management, Integration of CAD/CAM systems, Industrial control systems",
          "Digital twin, architecture of digital twins, case studies on the application of digital twins in different domains"
        ],
        "references": [
          "M.P.Groover, E.W.Zimmers Jr., “CAD/CAM: Computer aided design and manufacturing”, Prentice-Hall of India Pvt. Ltd. 2001",
          "P.N.Rao, “CAD/CAM: Principles & Application”, Tata McGraw Hill 2005",
          "Tai Ran Hsu, MEMS and Microsystems- Design and manufacturing, Tata McGraw Hill, 2001",
          "Marc J. Madou, Fundamentals of microfabrication,2002",
          "https://www.coursera.org/learn/ethics-technology-engineering/"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4450",
        "title": "DEEP LEARNING FOR COMPUTER VISION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Image Formation",
          "Linear Filtering",
          "Correlation and Convolution",
          "Visual Features: Edge, Blobs, Corner Detection Algorithms",
          "SIFT",
          "SURF",
          "HOG",
          "Multi-layer Perceptron",
          "Backpropagation",
          "Introduction to CNN",
          "Evolution of CNN Architectures: AlexNet, ZFNet, VGG, Inception Nets, ResNets, DenseNets",
          "Visualization of Kernels",
          "Backprop-to-image/Deconvolution Methods",
          "Background of Object Detection",
          "CNN for Recognition and Detection",
          "R-CNN",
          "Fast R-CNN",
          "Faster R-CNN",
          "YOLO",
          "SSD",
          "RetinaNet",
          "CNNs for Segmentation: FCN, SegNet, U-Net, Mask-RCNN",
          "Review of RNNs",
          "CNN + RNN Models for Video Understanding",
          "Implementation using Deep Learning Libraries",
          "Deep Generative Models: GAN, Cycle-GANs, Progressive GANs, StackGANs, Pix2Pix",
          "Applications: Image Editing, Inpainting, Super-Resolution, Image Restoration, 3D Object Generation"
        ],
        "references": [
          "Goodfellow, Ian, Yoshua Bengio, and Aaron Courville. Deep learning. MIT press, 2016.",
          "Nielsen, Michael A. Neural networks and deep learning. San Francisco, CA, USA: Determination press, 2015.",
          "Szeliski, Richard. Computer vision: algorithms and applications. Springer Science & Business Media, 2010.",
          "David, A., and Ponce Jean. Computer vision: a modern approach. Prentice Hall ,2002.",
          "Bishop, Christopher. Neural Networks for Pattern Recognition, New York, NY: Oxford University Press, 1995.",
          "Richard Hartley, Andrew Zisserman, Multiple View Geometry in Computer Vision, 2004",
          "Mitchell, Tom. Machine Learning. New York, NY: McGraw-Hill, 1997."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4451",
        "title": "DESIGN OF MECHANICAL DRIVES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction",
          "bevel gear and worm gear",
          "beam strength",
          "dynamic load and wear load",
          "heat dissipation and efficiency of worm gear",
          "sliding contact bearings",
          "lubricants",
          "viscosity",
          "bearing modulus",
          "Sommerfield number",
          "coefficient of friction",
          "mechanism of film lubrication",
          "eccentricity and minimum oil film thickness",
          "Belt drives",
          "power transmission",
          "flat and V belts",
          "power rating",
          "V-flat drives",
          "selection of belts and pulleys",
          "Wire and rope drives - types & construction of wire ropes",
          "loads & stresses in ropes",
          "selection of wire ropes",
          "Chain drives",
          "chordal action",
          "sprocket size and teeth",
          "chain speed",
          "selection of roller chains",
          "Mechanical brakes - block brakes",
          "band brakes",
          "pivoted Shoe brakes",
          "disc brake",
          "torque capacity",
          "heat dissipation",
          "clutches",
          "friction clutches",
          "disc clutch",
          "cone clutch",
          "design projects"
        ],
        "references": [
          "Shigley J. E. and Mischke C. R., Mechanical Engineering Design, (5e), McGraw Hill Inc, New York, 2004.",
          "Bhandari V. B., Design of Machine Elements, (2e), Tata McGraw-Hill Publishing Company Limited, New Delhi, 2007.",
          "Norton R. L., Machine Design - An Integrated Approach, (2e), Prentice Hall Inc, New Jersy, 2004.",
          "Juvenile R. C. and Marshek K. M., Fundamentals of Machine Component Design, (3e), John Wiley and Sons, Inc, New York, 2000.",
          "Mahadevan K. and Balaveera Reddy K., Machine Design Data Hand Book, (4e), CBS Publishers and Distributors, New Delhi, 2014."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4452",
        "title": "ELECTRIC VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "History of Vehicle technology",
          "Case studies on vehicles",
          "Economics and Environmental aspects of vehicle technologies – IC, Hybrid and EV",
          "Overview of vehicle dynamics",
          "Power Plants in vehicle technologies",
          "IC Engine based vehicles – Fundamentals and types",
          "IC Engine speed torque characteristics",
          "EV Power plant characteristics",
          "Electric Vehicle components: Battery, Motors and Auxiliary units",
          "Types of Electric Vehicle configurations",
          "Concept of regenerative braking and its significance in Electric Vehicles",
          "Control of Electric Vehicles",
          "Challenges in Electric Vehicles",
          "Hybrid Vehicles – Series, Parallel, Series Parallel and Complex configurations",
          "Fuel Cell based vehicles – Fundamentals and Future Potential of FCEV",
          "Solar Powered EV",
          "Case studies on types of Electric and Hybrid Vehicles"
        ],
        "references": [
          "MehrdadEhsani, Modern Electric, Hybrid Electric and Fuel Cell Vehicles- Fundamentals, Theory and Design, (3e), CRC Press, 2018",
          "Iqbal Hussein, Electric and Hybrid Vehicles-Design Fundamentals, (2e), CRC Press, 2010",
          "Gianfranco Pistoia, Electric and Hybrid Vehicles - Power Sources, Models, Sustainability, (2e), CRC Press, 2010"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4453",
        "title": "EMBEDDED SYSTEMS AND RTOS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to embedded system, attributes and major application areas of ES",
          "Processor and memory organization",
          "Communication networks",
          "ARM processor introduction and architectural inheritance",
          "Architectural features of ARM Processor",
          "ARM instruction set",
          "Pipelined architecture in ARM",
          "THUMB instruction format",
          "Memory mapped peripherals",
          "Architectural features of ARM Cortex M3 and programming examples",
          "Introduction To Real-Time Operating Systems",
          "Tasks and Task states",
          "Semaphores",
          "Message queues",
          "Mail boxes and pipes",
          "Hard and Soft real time systems",
          "Scheduling considerations",
          "Multicore real time systems",
          "Case studies"
        ],
        "references": [
          "Wolf, Wayne, Computers as Components- Principles of Embedded Computing System Design, Morgan-Kaufmann, 2000.",
          "Steve Furber, ARM System-on-chip Architecture, Pearson Education, 2000.",
          "Andrew Sloss, Domnic Symes, Chris Wright, ARM system Developer's Guide, 1st edition."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4454",
        "title": "ENGINEERING MATERIALS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Crystal structures",
          "Miller indices",
          "crystal imperfections",
          "mechanism of solidification",
          "nucleation and crystal growth",
          "phases in solids",
          "equilibrium diagrams",
          "iron-Carbon systems",
          "principle and objectives of heat treatment",
          "TTT diagrams",
          "electronic materials",
          "deposition of thin films",
          "insulators and dielectric properties",
          "polarization in dielectrics",
          "electrostriction",
          "piezoelectricity",
          "ferroelectricity",
          "magnetic materials",
          "magnetic dipole and moments",
          "magnetization",
          "super paramagnetic materials",
          "applications of magnetic materials",
          "photonic materials",
          "refraction",
          "reflection",
          "absorption",
          "emission phenomena"
        ],
        "references": [
          "Donald R. Askeland and Pradeep P. Fulay, The Science and Engineering of Materials, Cengage learning publishers, (6e),2011.",
          "Lakhtin Yu., Engineering Physical metallurgy and heat treatment, MIR Publishers, Moscow, 1985.",
          "Higgins R.A., Engineering Metallurgy, (5e), ELBS, London,1983."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4452",
        "title": "ELECTRIC VEHICLES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "History of Vehicle technology.",
          "Case studies on vehicles.",
          "Economics and Environmental aspects of vehicle technologies – IC, Hybrid and EV.",
          "Overview of vehicle dynamics.",
          "Power Plants in vehicle technologies.",
          "IC Engine based vehicles – Fundamentals and types.",
          "IC Engine speed torque characteristics.",
          "EV Power plant characteristics.",
          "Electric Vehicle components: Battery, Motors and Auxiliary units.",
          "Types of Electric Vehicle configurations.",
          "Concept of regenerative braking and its significance in Electric Vehicles.",
          "Control of Electric Vehicles.",
          "Challenges in Electric Vehicles.",
          "Hybrid Vehicles – Series, Parallel, Series Parallel and Complex configurations.",
          "Fuel Cell based vehicles – Fundamentals and Future Potential of FCEV.",
          "Solar Powered EV.",
          "Case studies on types of Electric and Hybrid Vehicles."
        ],
        "references": [
          "MehrdadEhsani, Modern Electric, Hybrid Electric and Fuel Cell Vehicles- Fundamentals, Theory and Design, (3e), CRC Press, 2018.",
          "Iqbal Hussein, Electric and Hybrid Vehicles-Design Fundamentals, (2e), CRC Press, 2010.",
          "Gianfranco Pistoia, Electric and Hybrid Vehicles - Power Sources, Models, Sustainability, (2e), CRC Press, 2010."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4453",
        "title": "EMBEDDED SYSTEMS AND RTOS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to embedded system, attributes and major application areas of ES",
          "Processor and memory organization",
          "Communication networks",
          "ARM processor introduction, architectural inheritance",
          "Architectural features of ARM Processor, instruction set",
          "Pipelined architecture in ARM",
          "THUMB instruction format",
          "memory mapped peripherals",
          "architectural features of ARM Cortex M3 and programming examples",
          "Introduction To Real-Time Operating Systems",
          "Tasks and Task states",
          "Semaphores",
          "Message queues, Mail boxes and pipes",
          "Hard and Soft real time systems",
          "scheduling considerations",
          "Multicore real time systems",
          "Case studies"
        ],
        "references": [
          "Wolf, Wayne, Computers as Components- Principles of Embedded Computing System Design, Morgan-Kaufmann, 2000.",
          "Steve Furber, ARM System-on-chip Architecture, Pearson Education, 2000.",
          "Andrew Sloss, Domnic Symes, Chris Wright, ARM system Developer's Guide, 1st edition."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4454",
        "title": "ENGINEERING MATERIALS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Crystal structures",
          "Miller indices",
          "crystal imperfections",
          "mechanism of solidification",
          "nucleation and crystal growth",
          "phases in solids",
          "equilibrium diagrams",
          "iron-Carbon systems",
          "principle and objectives of heat treatment",
          "TTT diagrams",
          "electronic materials",
          "deposition of thin films",
          "insulators and dielectric properties",
          "polarization in dielectrics",
          "electrostriction",
          "piezoelectricity",
          "ferroelectricity",
          "magnetic materials",
          "magnetic dipole and moments",
          "magnetization",
          "super paramagnetic materials",
          "applications of magnetic materials",
          "photonic materials",
          "refraction",
          "reflection",
          "absorption",
          "emission phenomena"
        ],
        "references": [
          "Donald R. Askeland and Pradeep P. Fulay, The Science and Engineering of Materials, Cengage learning publishers, (6e),2011.",
          "Lakhtin Yu., Engineering Physical metallurgy and heat treatment, MIR Publishers, Moscow, 1985.",
          "Higgins R.A., Engineering Metallurgy, (5e), ELBS, London,1983.",
          "Avner S.H., Introduction to Physical Metallurgy, (3e), McGraw Hill. Delhi, 2004.",
          "Arzamasov, Material Science, MIR Publishers, Moscow. 1989."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4455",
        "title": "FRACTIONAL ORDER MODELLING AND CONTROL",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Fractional order calculus: Review of basic definitions of integer-order derivatives and integrals, Definition of Riemann-Liouville integration, Definitions of RL, Caputo and Grunwald-Letnikov fractional derivatives, Various geometrical and physical interpretations, Computation for basic functions, Laplace transforms",
          "Fractional-order modeling: Review of complex analysis concepts, Fractional-order transfer function representation, Commensurate and noncommensurate TFs, FO modelling of electrical circuit elements, Models of circuits/mechanical systems using FO elements, FO models of heat transfer, Overview of FO models of biological systems",
          "Fractional-order Control: Superiority over conventional IO control, FO PID control, Design of FO state-feedback, Realization and implementation issues, Survey of realization methods, Case study",
          "Self-study: Risk management in industrial control systems"
        ],
        "references": [
          "K. B. Oldham and J. Spanier. The Fractional Calculus. Dover Publications, USA, 2006.",
          "Kilbas, H. M. Srivastava, and J. J. Trujillo. Theory and Applications of Fractional Differential Equations, Elsevier, Netherlands, 2006.",
          "Podlubny. Fractional Differential Equations. Academic Press, USA, 1999.",
          "C. A. Monje, Y. Q. Chen, B. M. Vinagre, D. Xue, and V. Feliu. Fractional-order Systems and Control: Fundamentals and Applications. Springer-Verlag London Limited, UK, 2010.",
          "R. L. Magin. Fractional Calculus in Bioengineering. Begell House Publishers, USA, 2006.",
          "R. Caponetto, G. Dongola, L. Fortuna, and I. Petras. Fractional Order Systems: Modeling and Control Applications. World Scientific, Singapore, 2010.",
          "K. S. Miller and B. Ross. An Introduction to the Fractional Calculus and Fractional Differential Equations. John Wiley & Sons, USA, 1993.",
          "S. Das. Functional Fractional Calculus for System Identification and Controls, Springer, Germany, 2011.",
          "M. D. Ortigueira. Fractional Calculus for Scientists and Engineers. Springer, Germany, 2011.",
          "Petras. Fractional-Order Nonlinear Systems: Modeling, Analysis and Simulation. Springer, USA, 2011."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MTE 4456",
        "title": "HUMAN ROBOT INTERACTION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "IO channels",
          "Framework and design flow",
          "Ergonomics",
          "prototyping and lifecycle",
          "usability engineering",
          "HCI models",
          "Cognitive and scoio organizational issues",
          "Evalution techniques and .design rules",
          "Collaborative models – HCI",
          "application framework",
          "mobile HCI design and case study",
          "virtual layouts and process flow in web interfacing design",
          "Case studies on different human robot interactions"
        ],
        "references": [
          "Alan Dix, Janet Finlay, Gregory Abowd, Russell Beale, Human Computer Interaction, (3e), Pearson Education, 2004",
          "Brian Fling, Mobile Design and Development, (1e), O'Reilly Media Inc., 2009",
          "Bill Scott and Theresa Neil, Designing Web Interfaces, (1e), O'Reilly, 2009"
        ],
        "flags": [
          "typos_in_syllabus (e.g., 'scoio' likely 'social', 'Evalution' likely 'Evaluation')"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4457",
        "title": "MACHINE LEARNING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to Machine Learning",
          "Review of Linear Algebra",
          "Review of Probability theory",
          "Overview of Convex optimization",
          "Hidden Markov models",
          "Bayesian decision theory",
          "Maximum likelihood ratio",
          "Parametric classification",
          "Regression",
          "Multivariate methods",
          "K-nearest neighbor classification",
          "Supervised learning: Logistic regression",
          "Perceptron",
          "Generative learning algorithms",
          "Naïve Bayes",
          "Support vector machines",
          "Model selection and feature selection",
          "Evaluation and debugging learning algorithms",
          "Unsupervised learning: Clustering",
          "K-means",
          "Hierarchical clustering",
          "Competitive learning",
          "Dimensionality reduction techniques",
          "Hidden Markov model",
          "Linear Regression",
          "Generating diverse learners",
          "Ensemble techniques",
          "Applications of Machine Learning in diverse fields"
        ],
        "references": [
          "Shai Shalev-Shwartz and Shai Ben-David, Understanding Machine Learning, Cambridge University Press. 2017.",
          "Ethem Alpaydin, Introduction to Machine Learning, (2e), MIT Press, 2010.",
          "Mehryar Mohri, Afshin Rostamizadeh and Amet Talwalkar, Foundation of Machine Learning, (1e), MIT Press 2012.",
          "Dive into Deep Learning Aston Zhang and Zachary C. Lipton and Mu Li and Alexander J. Smola, 2019",
          "Christopher M. Bishop, Pattern Recognition and Machine Learning, (1e), Springer, 2007."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4458",
        "title": "MACHINE TOOL TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Types of motion in cutting",
          "cutting speed",
          "feed",
          "depths of cut in machining",
          "cutting tools classification",
          "nomenclature of single point cutting tool",
          "difference between orthogonal and oblique cutting",
          "mechanism of metal cutting",
          "types of chips",
          "chip breakers",
          "forces acting on a tool",
          "merchant circle diagram",
          "velocity relations",
          "specific energy in cutting",
          "tool wear",
          "tool life factors",
          "Taylor's tool life equation",
          "tool wear mechanisms",
          "heat distribution in metal cutting",
          "measurement of temperature in metal cutting",
          "lathe tool dynamometer",
          "cutting fluids selection and applications",
          "cutting tool materials",
          "specifications for inserts and tool holders",
          "CNC tooling",
          "tool presetting",
          "automated tool & pallet changing",
          "work holding",
          "cutting process parameter selection",
          "jigs and fixtures",
          "types of clamping devices",
          "principles of clamping"
        ],
        "references": [
          "Milton C.Shaw, Metal Cutting Principles, (2e), Oxford University Press, 2000.",
          "Kempster, Jigs and Fixtures, (3e), Mark Howard Publications, 2004.",
          "Steve Krar, Arthur Gill and Peter Smid, Machine Tool Technology Basics, (2e), Industrial Press Inc., U.S, 2012.",
          "Sharma. P. C, A Text Book of Production Engineering, (7e), SChand Publishers, New Delhi, 2008."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4459",
        "title": "MACHINE VISION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Vision System Components",
          "Pinhole Camera Model",
          "Image Acquisition",
          "Sampling & Quantization",
          "Fundamentals of Color Image Processing and Color Space Conversion",
          "Basic Operations on Images",
          "Geometrical Transformations",
          "Image Enhancement",
          "Spatial Domain",
          "Frequency Domain Processing",
          "Image Noise",
          "Image Restoration",
          "Morphological Operations",
          "Region Segmentation",
          "Feature Extraction",
          "Background Subtraction",
          "Lucas Kanade Optical Flow Estimation",
          "Object Tracking using Kalman Filter",
          "Localization using Passive Markers",
          "Linear Camera Model",
          "RGB+D camera",
          "Time of Flight (ToF) cameras",
          "Camera Calibration",
          "Intrinsic and Extrinsic Camera Parameters",
          "Stereo",
          "Epipolar Geometry",
          "Estimation of Fundamental Matrix",
          "Computing Depth",
          "Motion Field and Optical Flow",
          "Structure from Motion",
          "Observation Matrix",
          "Computer Vision Software Tools for Color and Shape Detection",
          "Human Detection",
          "Object Tracking",
          "Camera Calibration",
          "Depth Estimation",
          "Stereo Correspondence Algorithms"
        ],
        "references": [
          "Rafael C. Gonzalez, Richard E. Woods, Digital Image Processing, (3e), Pearson Education, 2008.",
          "Szeliski, Computer Vision: Algorithms & Applications, Springer, 2012",
          "Milan Sonka, Vaclav Hlavac, Roger Boyle, Image Processing, Analysis and Machine Vision, (2e), 1998.",
          "Boguslaw Cyganek & J. Paul Siebert, An Introduction to 3D Computer Vision Techniques and Algorithms, (1e), Wiley, 2009",
          "David A. Forsyth, Jean Ponce, Computer vision: A modern approach, Pearson Education Limited.",
          "E.R. Davies, Royal Holloway, Machine Vision: Theory, Algorithms and Practicalities, (3e), University of London, 2004."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4460",
        "title": "MECHANICAL VIBRATIONS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to mechanical vibration, vibration system and types",
          "Vibration analysis - degrees of freedom, mathematical modelling",
          "Equations of motion, SHM, natural frequency of single degree of freedom system – mathematical modelling, derivation of governing differential equation of motion for free undamped and damped systems",
          "Forced vibration – single degree of freedom system under harmonic excitation, steady state, reciprocating and rotating unbalance, transmissibility and isolation, base excitation with harmonic input",
          "Two degree of freedom systems - natural frequencies and mode shapes, forced vibration",
          "Natural frequency of multi-degree of freedom systems, vibration control, vibration testing and measurement"
        ],
        "references": [
          "Groover G.K., Mechanical Vibrations, Nemchand and Bros, Roorkee, 2012",
          "Singirisu Rao S, Mechanical Vibration, Pearson Education, Delhi, 2004",
          "Dukkapatti Rao V., Text Book of Mechanical Vibration. Prentice Hall of India Ltd, 2004",
          "Daniel Imnan J. Engineering Vibration, Prentice Hall, New Delhi, 2001",
          "Thomson W.T., Theory of Vibrations with Applications, Chapman and Hall, 4th Edition, 1993"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4461",
        "title": "MICRO AND NANO FABRICATION OF ELECTRONIC DEVICES",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Intrinsic and extrinsic semiconductors",
          "Zener diodes, Schottky diode",
          "BJTs, MOSFETs",
          "Optoelectronic devices - LEDs, photodetectors, solar cells",
          "Moore's Law, Scaling in CMOS",
          "Clean room concept",
          "Crystal structure of silicon, material properties",
          "Silicon wafer types",
          "Basic wafer fabrication operations: layering, patterning, doping, heat treatment",
          "Lithography - photolithography, X-ray lithography, e-beam lithography, scanning probe",
          "Photoresists, masks",
          "Etching - wet and dry",
          "Deposition and growth - CVD, PVD, ALD, MBE",
          "Metallization - sputtering, CVD, electroplating",
          "Polishing",
          "Process and device evaluation",
          "Process yield",
          "CMOS and SOI Technology",
          "SOI MOSFET, strained SiGe MOSFET",
          "Characterization: two-point, four-point probes, capacitance voltage profiling, scanning electron microscopy, transmission electron microscopy, X-ray diffraction",
          "Packaging methods"
        ],
        "references": [
          "Stephen A. Campbell, Fabrication Engineering at the Micro- and Nanoscale, Oxford University Press, 2013",
          "Gary S. May, Simon M. Sze, Fundamentals of semiconductor fabrication, Wiley, 2003",
          "James D. Plummer, Michael D. Deal, Peter B. Griffin, Silicon VLSI Technology: Fundamentals, Practice and Modeling, Prentice Hall, 2009",
          "D. Chattyopadhyay, P.C. Rakshit, Electronics Fundamentals and Applications, New Age International, 2020"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4462",
        "title": "MICRO ELECTRO MECHANICAL SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "MEMS and Microsystems applications",
          "Review of Mechanical concepts",
          "Actuation and Sensing techniques",
          "Scaling laws in miniaturization",
          "Materials for MEMS",
          "Micro System fabrication techniques",
          "Micro manufacturing",
          "Micro system Packaging",
          "Bonding techniques for MEMS",
          "Overview of MEMS areas"
        ],
        "references": [
          "Chang Liu, Foundations of MEMS, Pearson 2012",
          "Tai-Ran Hsu, MEMS and Microsystems Design and Manufacture, TMH, 2002",
          "Chang C Y and Sze S. M., VLSI Technology, McGraw-Hill, New York, 2000",
          "Julian W Gardner, Microsensors: Principles and Applications, John Wiley & Sons, 1994",
          "Mark Madou, Fundamentals of Micro fabrication, CRC Press, New York, 1997",
          "Stephen D. Senturia, Microsystem design, Springer (India), 2006",
          "Thomas B. Jones, Electromechanics and MEMS, Cambridge University Press, 2001",
          "James J Allen, MEMS Design, Taylor and Francis, 2005"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MTE 4463",
        "title": "MICRO MANUFACTURING SYSTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction, working principles and process parameters",
          "Machine tools",
          "Applications of the micro manufacturing processes",
          "Challenges in meso, micro, and nanomanufacturing",
          "Industrial applications and future scope of micro-manufacturing processes",
          "Different instruments related to micro manufacturing such as microsensors, microactuators, microsystems",
          "Working principles, machine construction, and applications of micromachining",
          "Nanofinishing",
          "Microjoining",
          "Microforming",
          "Microcasting",
          "Micromolding",
          "LIGA for micro/nano products and features",
          "Diversified industrial applications of the micro-manufactured processes",
          "Recent research trends in this area"
        ],
        "references": [
          "Jain V. K., Introduction to Micromachining, Narosa Publishing house Pvt. Ltd., 2010.",
          "Jain V. K., Micromanufacturing, CRC Press, 2012.",
          "Jain V. K., Advanced Machining Processes, Allied Publishers Pvt. Ltd., 2014.",
          "Mahalik N. P., Micromanufacturing & Nanotechnology, Springer Berlin Heidelberg, 2006.",
          "Jackson J. M., Microfacbrication & Nanomanufacturing, CRC Press, 2005."
        ],
        "flags": [
          "department_mismatch (MTE code vs Mechatronics department)",
          "semester_inferred_from_course_code"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4464",
        "title": "NANO TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to nanotechnology",
          "bottom-up and top-down approaches",
          "physical and chemical properties",
          "methods of preparation of nanoparticles",
          "carbon nanostructures and their applications",
          "physical chemistry of nanosystems",
          "micro electro mechanical devices and technologies-microsensors",
          "MEMS fabrication processes and applications",
          "microscale and nanoscale heat conduction",
          "nanofluids preparation and characterization",
          "nanomaterials used in energy and environmental applications and their properties",
          "future development of micro actuators",
          "nanolithography",
          "photoresist patterning",
          "photolithography",
          "electron beam lithography",
          "production of polygon mirrors",
          "optic fibers",
          "future trends in nanotechnology"
        ],
        "references": [
          "Charles P. Poole, Introduction to Nanotechnology, Wiley-Interscience, 2003",
          "Guozhong Cao, Nanostructures & Nanomaterials, Imperial College Press, 2004",
          "C B Sobhan, Microscale and Nanoscale Heat Transfer, Taylor and Francis, 2008",
          "Norio Taniguchi, Nanotechnology, Oxford University Press, 2008",
          "James J Allen, MEMS Design, Taylor and Francis, 2005"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4465",
        "title": "OBJECT ORIENTED PROGRAMMING USING PYTHON",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Introduction to the Object-oriented programming using Python language",
          "Data types",
          "Variable and arrays",
          "Type conversion and casting",
          "Generators",
          "Iterators",
          "Operators",
          "control statements",
          "functions",
          "Modules",
          "Classes and inheritance",
          "Abstraction",
          "Encapsulation",
          "Polymorphism",
          "Packages and interfaces",
          "Working with In-built data-structures",
          "List",
          "Tuples",
          "Dictionaries",
          "set and application involving abstract DS",
          "Exception handling",
          "Thread concepts – synchronization",
          "inter thread communication",
          "Input/output – File: file input stream",
          "File output stream",
          "Random access files",
          "Reader",
          "Writer",
          "Decorators",
          "Map",
          "Reduce",
          "Collections",
          "Serialization",
          "Serializable",
          "Object input stream",
          "Object output stream",
          "Swings - swing fundamentals",
          "Introduction to event handling",
          "Application: GUI",
          "Accessing a database",
          "Django",
          "Flask"
        ],
        "references": [
          "John Zelle. Python Programming: An Introduction to Computer Science (3e). CRC Press.",
          "Muller and Guido. Introduction to Machine Learning with Python: A Guide for Data Scientists. (2e). Prentice Hall of India.",
          "Mark Lutz. Programming Python: Powerful Object-Oriented Programming. (2e). Prentice Hall of India."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4466",
        "title": "PRODUCTION AND OPERATIONS MANAGEMENT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction",
          "production consumption cycle",
          "forecasting- quantitative and qualitative methods",
          "Forecast control",
          "measures of forecast accuracy",
          "product development and design",
          "product life cycle",
          "process design",
          "process charts",
          "flow diagrams and man machine charts",
          "capacity planning",
          "breakeven analysis",
          "single and multi-product P-V charts",
          "aggregate planning",
          "trial and error approach",
          "use of transportation algorithm",
          "job shop scheduling",
          "Sequencing of “n” jobs through 2 machines",
          "“n” jobs through 3 machines",
          "2 jobs through “n” machines",
          "inventory management and line balancing",
          "resource conversion and concepts",
          "planning models and behavioural applications",
          "case studies"
        ],
        "references": [
          "Adam Everett E. Jr. and Ebert Ronald J., Production and Operations Management, Prentice Hall of India Pvt. Ltd., 2002.",
          "Chase Richard B., Aquilano Nicholas J. and Jacobs F. Roberts, Production and Operations Management, Tata McGraw-Hill publishing Co. Ltd., 1999.",
          "Eilon Samuel, Elements of Production Planning and Control, Universal Publishing Corporation, 1991.",
          "Monks Joseph G., Operations Management, Tata McGraw-Hill Publishing Co. Ltd., 2004.",
          "Krajewski Lee J. and Ritzman Larry P., Operations Management, Pearson Education Pvt. Ltd., 2005.",
          "https://www.coursera.org/learn/ethics-technology-engineering"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4467",
        "title": "REINFORCEMENT LEARNING FOR ROBOTICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Probability basic concepts: Probability, Random variables discrete and continuous, Conditional probability, Probability distributions, Bayes theorem, Maximum Likelihood and MAP",
          "Sequential Decision Making with Evaluative Feedback",
          "Learning Action Values, Estimating Action Values Incrementally",
          "Optimistic Initial Values Upper-Confidence Bound (UCB) Action Selection",
          "Jonathan Langford: Contextual Bandits for Real World Reinforcement Learning",
          "Markov Decision Processes",
          "Examples of MDPs, The Goal of Reinforcement Learning",
          "Michael Littman: The Reward Hypothesis",
          "Continuing Tasks, Examples of Episodic and Continuing Tasks",
          "Value Functions & Bellman Equations: Value Functions",
          "Rich Sutton and Andy Barto: A brief History of RL",
          "Bellman Equation Derivation Why Bellman Equations?",
          "Optimal Policies, Optimal Value Functions",
          "Using Optimal Value Functions to Get Optimal Policies",
          "Dynamic Programming: Iterative Policy Evaluation, Policy Improvement, Policy Iteration",
          "Flexibility of the Policy Iteration Framework, Efficiency of Dynamic Programming",
          "Monte Carlo Methods for Prediction & Control: Using Monte Carlo for Prediction",
          "Using Monte Carlo for Action Values, Using Monte Carlo methods for generalized policy iteration",
          "Solving the Blackjack, Example: Epsilon-soft policies off-policy learning matter",
          "Importance Sampling, Off-Policy Monte Carlo Prediction",
          "Temporal Difference Learning Methods for Prediction",
          "Rich Sutton: The Importance of TD Learning, The advantages of temporal difference learning Comparing TD and Monte Carlo",
          "Andy Barto and Rich Sutton: More on the History of RL",
          "Temporal Difference Learning Methods for Control: Sarsa: GPI with TD",
          "Sarsa in the Windy Grid World, What is Q-learning?",
          "Q-learning in the Windy Grid World, How is Q-learning off-policy?",
          "Expected Sarsa, Expected Sarsa in the Cliff World, Generality of Expected Sarsa",
          "Planning, Learning & Acting: What is a Model, Comparing Sample and Distribution Models",
          "Random Tabular Q-planning, The Dyna Architecture, The Dyna Algorithm",
          "Dyna & Q-learning in a Simple Maze, what if the model is inaccurate? In-depth with changing environments",
          "Drew Bagnell: self-driving, robotics, and Model Based RL",
          "Self-study: Case studies on applications and implementation of different reinforcement learning algorithms"
        ],
        "references": [
          "Richard S. Sutton and Andrew G. Barto. Introduction to Reinforcement Learning, (2e), MIT Press. 2017. [Draft copies available now]",
          "Dimitri Bertsikas and John G. Tsitsiklis. Neuro Dynamic Programming. Athena Scientific. 1996.",
          "EnesBilgin, Mastering Reinforcement Learning with Python: Build next-generation, self-learning models using reinforcement learning techniques and best practices. Packt, (2e). 2020."
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4468",
        "title": "RENEWABLE ENERGY TECHNOLOGY",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Energy resources – Electrical energy generation",
          "Indian Power Generation",
          "Environmental aspects of Electrical Energy generation",
          "Solar Energy – fundamentals of solar energy, Solar thermal and Photovoltaics",
          "Solar cells, solar modules and sizing, solar photovoltaics systems, solar photovoltaic applications",
          "Grid connected PV systems",
          "Wind Energy Systems – Fundamentals of wind energy systems",
          "Grid connected and standalone wind power generation",
          "Small hydropower, Geo-thermal power generation",
          "Tidal energy, wave energy and conversion systems",
          "Biomass Energy",
          "Fuel cells and Hydrogen Energy Systems"
        ],
        "references": [
          "D.P. Kothari, K.C. Singal, and Rakesh Ranjan, Renewable Energy Sources and Emerging Technologies, (3e), PHI, 2022",
          "G.D. Rai, Non-conventional Energy Sources, Khanna Publishers, 2004",
          "Solanki C.S, Solar Photovoltaics - Fundamentals, Technologies and Applications, (3e), PHI, 2015",
          "S.M. Muyeen, Wind Energy Conversion Systems: Technology and Trends (Green Energy and Technology), Springer, 2012"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4469",
        "title": "SUSTAINABLE MANUFACTURING",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Concept of sustainability, environmental, economic and social dimensions of sustainability",
          "Relation between green, lean and sustainable manufacturing",
          "Environmental conscious quality function deployment",
          "Environmental impact assessment methods",
          "Sustainability assessment - concept models and various approaches",
          "Sustainable manufacturing processes - Abrasive Jet Machining, Laser beam machining, Ultrasonic Machining, Electro Chemical Machining, Electro Discharge Machining",
          "Product Life cycle management and analysis - Tools for LCA, optimization for achieving sustainability in manufacturing, value analysis, analysis for carbon footprint, software packages for sustainability analysis",
          "Case studies on Evaluation on Machining Processes for Sustainable Manufacturing",
          "SDL on Introduction to Sustainability using coursera course"
        ],
        "references": [
          "Subramanian S. M., Monica M.S., Handbook of Sustainability in Additive Manufacturing, Vol. 2, Springer Publication, 2018",
          "Atkinson G, Dietz S, Neumayer E, Handbook of sustainable manufacturing, Edward Elgar Publishing limited, Ed. 2, 2014",
          "Paul C. P., Jinoop A. N., Additive Manufacturing, McGraw Hill, 2021",
          "https://www.coursera.org/learn/sustainability"
        ],
        "flags": [
          "missing_semester",
          "department_code_mismatch (MTE vs MECHATRONICS)"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4470",
        "title": "SYSTEMS MODELLING AND SIMULATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Principles of modeling and simulation",
          "modeling and simulation of mixed systems",
          "transfer function",
          "block diagram",
          "state space representation of SISO",
          "MIMO",
          "modeling of dynamic systems",
          "construction",
          "analysis",
          "practical applications",
          "linear systems",
          "methods of model order determination",
          "impulse and frequency response methods",
          "system identification",
          "algorithms for parameter estimation",
          "gradient algorithm",
          "least square algorithm",
          "ARX",
          "ARMAX applications of LS and ARMA methods",
          "regression methods",
          "introduction to nonlinear modeling",
          "identification NARMAX model",
          "case studies UAV quad-rotor",
          "hard discs",
          "maglev systems",
          "ball and beam systems"
        ],
        "references": [
          "George Pelz, Mechatronic Systems Modeling and Simulation with HDLs, Wiley, 2003",
          "Devdas Shetty, Richard Kolk, Mechatronics System Design, (2e), Cengage Learning, 2010",
          "Benjamin C. Kuo, FaridGolnarghi, Automatic Control Systems, (8e), Wiley, 2009",
          "Jack W. Lewis, Modeling of Engineering Systems PC-Based Techniques and Design Tools, High Text Publications, 2000",
          "Ioan D. Landau, Gianluca Zito, Digital Control Systems Design, Identification and Implementation, Springer, 2006",
          "System Identification: Theory for the User (2nd Edition), Lennart Ljung, Pearson: Prentice Hall"
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4471",
        "title": "WIRELESS SENSOR NETWORKS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Challenges for wireless sensor networks",
          "Single node architecture – Hardware components",
          "Energy consumption of sensor nodes",
          "Network architecture – Types of sources and sinks",
          "Single hop versus multi-hop networks",
          "Multiple sinks and sources",
          "Wireless channel and communication fundamentals – Frequency allocation",
          "Modulation and demodulation",
          "MAC protocols – Fundamentals of (wireless) MAC protocols",
          "contention-based protocols",
          "SMAC – BMAC",
          "TRAMA",
          "IEEE 802.15.4 MAC protocol",
          "Q-MAC (Querry MAC)",
          "Q-MAC (QoS MAC)",
          "Routing challenges and design",
          "SPIN COUGAR",
          "ACQUIRE",
          "LEACH",
          "PEGASIS",
          "GF",
          "GAF",
          "GEAR",
          "Aggregation techniques – TAG",
          "Tiny DB traditional transport control protocols",
          "Wireless protocols – LANs: 802.11",
          "802.11a/b/g",
          "802.16-WiMAX",
          "UWB communications",
          "wireless personal area networks",
          "Blue Tooth",
          "Healthcare monitoring system using wireless sensor networks",
          "remote home lighting and appliance control system",
          "automatic speed control and vehicle tracking using GSM and GPS technologies"
        ],
        "references": [
          "KazemSohraby, Daniel Minoli and TaiebZnati, Wireless Sensor Networks Technology- Protocols and Applications, John Wiley & Sons, 2010",
          "Holger Karl and Andreas Willig, Protocols and Architectures for Wireless Sensor Networks, John Wiley & Sons, Ltd Paperback edition, 2007",
          "Ananthram Swami, Qing Zhao, Yao-Win Hong, Lang Tong Pub, Wireless Sensor Networks Signal Processing and Communications, First Edition, John Wiley & Sons, 2007",
          "Murthy, Ad Hoc Wireless Networks: Architectures and Protocols, Pearson Education, 2006",
          "Sridhar S. Iyengar, NandanParameshwaran, Vir V. Phoha, N. Balakrishnan, Chuka D. Okoye, Fundamentals of Sensor Network Programming: Applications and Technology, First Edition, John Wiley & Sons, 2010"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4311",
        "title": "AUTONOMOUS MOBILE ROBOTS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "theory"
        ],
        "syllabus": [
          "Locomotion: Introduction, Legged Mobile Robots, Wheeled Mobile Robots",
          "Mobile Robot Kinematics and Motion in Global Coordinates: Kinematic Models and Constraints, Mobile Robot Maneuverability, Mobile Robot Workspace",
          "Dynamics of Quadrotor-Type Mobile Robots",
          "Perception: Sensors for Mobile Robots, Feature Extraction",
          "GNSS and Mobile Robot Localization: The Challenge of Localization: Localization-Based Navigation versus Programmed Solutions, Map Representation",
          "Probabilistic Map-Based Localization",
          "Global Navigation Satellite System",
          "Planning, Navigation and Energy Considerations: Competences for Navigation, Navigation Architectures, Energy Limitations and Energetic Efficiency of Mobile Robots"
        ],
        "references": [
          "Siegwart, Roland, Illah Reza Nourbakhsh, and Davide Scaramuzza. Introduction to autonomous mobile robots. MIT press, 2011.",
          "Howie Choset, Kevin M Lynch, Principles of Robot Motion, MIT Press, 2005.",
          "King Sun Fu, Gonzalez, Robotics- control, sensing, vision, and intelligence, McGraw-Hill, 1987.",
          "Kagan, Eugene, Nir Shvalb, and Irad Ben-Gal, eds. Autonomous mobile robots and multi-robot systems: Motion-planning, communication, and swarming. John Wiley & Sons, 2019."
        ],
        "flags": [
          "missing_semester",
          "tags_inferred_from_context"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4312",
        "title": "FARM AUTOMATION",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "elective",
          "theory"
        ],
        "syllabus": [
          "Farm automation system, sensors, controller, actuators, regulators and servos",
          "Agriculture robotic vehicles: Wheel-type robot tractor, Crawler type robotic tractor, rice transplanting robot, robot combined harvester",
          "Automation in irrigation: Automated Irrigation, Portable timer system, Timer/Sensor Hybrid/SCADA, Methods of automating Irrigation layout, Machine Learning in Tank Monitoring System",
          "IoT in Irrigation: IoT based Automated Irrigation System, Solar based Automatic Irrigation System, components, operation, Automation by sensing soil moisture, Automation using ANN based controller operation, Crop water estimate, Remote Monitoring design of Automatic Irrigation system, Cost and Benefits of Automation",
          "Automation in Protected Cultivation: Automation in seed, seedling and nursery, automation in seed processing, automation in polyhouse: Heading and Pruning Automation in Polyhouse Production, Mechanical Mass Harvesting of Fruits, Nuts and Vegetables",
          "Automation through robots: Harvesting and picking, weed control, Autonomous mowing, pruning, seeding, spraying and thinning, Phenotyping, Sorting and packing, Utility platforms robots, Soil moisture, nutrient status analysis by robots, Smart cameras for weed-crop segmentation",
          "Automation in food processing: Introduction, Post-Harvest and Food Processing Unit Operations, Material Handling, Packaging and Transportation, Novel Food processing techniques"
        ],
        "references": [
          "Brian Wahlin and DarellZimbelman, Canal Automation for Irrigation Systems, American Society of Civil Engineers, 2014",
          "Qin Zhang and Francis J Pierce, Agricultural Automation: Fundamentals and Practices, CRC Press",
          "Darwin G. Caldwell, Robotics and Automation in the Food Industry. Current and Future Technologies, Woodhead Publishing Series in Food Science, Technology and Nutrition, (2013)",
          "P. J. Fellows, Food Processing Technology, Principles and Practice, (4e)"
        ],
        "flags": [
          "missing_semester"
        ]
      },
      {
        "sem": 4,
        "code": "MTE 4313",
        "title": "HYDRAULICS AND PNEUMATICS SYTEMS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Pneumatic systems",
          "structure and signal flow",
          "compressors",
          "actuators and control valves",
          "single acting and double acting cylinders",
          "manual pneumatics",
          "single and multiple actuators",
          "limit switches",
          "proximity sensors",
          "electro pneumatics and design of electro pneumatic circuits",
          "direction control valves",
          "relay control systems",
          "timers",
          "counters",
          "pressure control valves",
          "closed loop pneumatics",
          "Flow control valves",
          "Hydraulic systems",
          "physical principles of oil hydraulics",
          "hydraulic actuators",
          "valves and accessories",
          "hydraulic power pack",
          "types of hydraulic pumps",
          "accumulator",
          "Filters",
          "hydraulic circuits",
          "regenerative",
          "meter in",
          "meter out",
          "bleed off",
          "sequencing",
          "pressure reducing circuits",
          "electro hydraulic circuits",
          "proportional hydraulics",
          "servo hydraulics"
        ],
        "references": [
          "Anthony Esposito, Fluid power with applications, Pearson Education, 2003",
          "Andrew A. Parr, Hydraulics and Pneumatics, Elsevier Science & Technology Books, 1999",
          "Scholz D., Proportional Hydraulics, Festo Didactic GMBH & Co, Germany, 2002",
          "Majumdar S.R., Pneumatic Systems - Principles and Maintenance, Tata McGraw Hill, 2000",
          "Merkle D., Rupp K. and Scholz D., Electrohydraulics Basic Level TP 601, Festo Didactic GMBH & Co, Germany, 1994"
        ],
        "flags": [
          "typo_in_title",
          "missing_semester_info_in_text"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4314",
        "title": "INDUSTRIAL IOT",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction to Industrial IoT, Components of IIoT",
          "Sensors: Acceleration (Accelerometers - Piezoelectric, Capacitive); Proximity & Range (Proximity Switches, Ultrasonic Sensor, Hall Effect Sensor, Eddy Current Sensor)",
          "Temperature: Bimetallic, RTD, Thermocouple, Thermistor, Optical Pyrometer",
          "Pressure: Electric Transducers, Pressure Transmitters, Pressure Gauges (McLeod, Knudsen, Pirani, Vacuum)",
          "Flow: Ultrasonic, V Cone, Laser Doppler, Mass flowmeters",
          "Introduction to PLC: Advantage of PLC, Chronological Evolution of PLC, Types of PLC, Parts of PLC and Block diagram, I/O modules and interfacing, networking of PLC, Input-Output System (Sinking and Sourcing), power supply module, Programming Equipments",
          "PLC Programming: Formats using contacts and coils, latching, conversion of relay logic diagrams to ladder diagrams, Digital logic implementation in ladder programming",
          "PLC Functions: Timer and counter functions, Arithmetic functions, R-trig/F-trig pulses, shift registers, sequence functions, PID principles and functional block, position indicator with PID control",
          "Industrial Process Automation, Networks and Protocols: AS-i, CAN, DeviceNet, Interbus, LON, Foundation Fieldbus, HART, PROFIBUS-PA, BACnet, ControlNet, Industrial Ethernet, Ethernet/IP, MODBUS, PROFIBUS-DP",
          "Database-System Applications: Purpose of Database Systems, View of Data, Database Languages, Relational Databases",
          "Security: Introduction to security, Characteristics of Information, Components of an Information system, Security System Development Lifecycle, Business Needs, Threats, Attacks, Intruders, Intrusion detection"
        ],
        "references": [
          "Liptak, B.G. (Ed.), Instrument engineers' handbook, Vol. 3: Process software and digital networks, (4e) CRC Press, Boca Raton, London, 2012.",
          "Andrew S. Tanenbaum, Computer Networks, (5e), Prentice Hall of India Pvt. Ltd., 2011.",
          "William Stallings, Data and Computer Communications, (8e), Prentice Hall of India Pvt. Ltd., 2014."
        ],
        "flags": [
          "missing_sem"
        ]
      },
      {
        "sem": null,
        "code": "MTE 4315",
        "title": "INTRODUCTION TO INDUSTRIAL ROBOTICS",
        "credits": {
          "l": 3,
          "t": 0,
          "p": 0,
          "c": 3
        },
        "tags": [
          "core",
          "theory"
        ],
        "syllabus": [
          "Introduction: definition of robots, anatomy, degrees of freedom, Robot configuration, control parameters, actuators and sensors",
          "Spatial Descriptions and Transformations: Frame representation and mapping, operators",
          "Industrial Manipulator Kinematics: link description, forward kinematics of industrial robots, Inverse kinematics of standard industrial manipulators",
          "Industrial Manipulator Dynamics: Jacobian and force vector. Forward dynamics and inverse dynamic simulations in Robo Analyzer software",
          "Robotics Application: Image processing: colour detection through Open CV programming. Arduino programming for servo and DC motor control",
          "Socio-economic and Safety Aspect of Industrial Robots: Social and labor issues impact. Economic analysis. Safety, training, maintenance and quality improvement, Robotics technology of the future"
        ],
        "references": [
          "John J. Craig, Introduction to Robotics: Mechanics and Control, (3e), PHI, 2005.",
          "C. Peter. Robotics, Vision and Control: Fundamental Algorithms in MATLAB. Vol. 73. Springer, 2011.",
          "G. Ashitava, Robotics: Fundamental Concepts and Analysis, Oxford University Press, 2006.",
          "Murray, Richard M., Zexiang Li, S. Shankar Sastry, and S. Shankara Sastry, A Mathematical Introduction to Robotic Manipulation, CRC press, 1994.",
          "Siciliano, Bruno, and Oussama Khatib. \"Robotics and the Handbook.\" Springer Handbook of Robotics. Springer, Cham, 2016.",
          "Groover, Mikell P., Mitchell Weiss, and Roger N. Nagel. Industrial robotics: technology, programming and application. McGraw-Hill Higher Education, 1986."
        ],
        "flags": [
          "missing_semester"
        ]
      }
    ]
  }
}